[
    {
        "id": 62390431,
        "published_at": "2023-07-02T23:30:00Z",
        "title": "Choi Ju-hui Appointed CEO of TVing, First Female Head in Korean Streaming Sector",
        "file_name": "2023-07-02_62390431.txt",
        "full_text": "Korea’s leading entertainment company, CJ ENM has appointed Choi Ju-hui as CEO of the TVing streaming service in which it has a controlling stake, following the recent resignation of CEO Jay Yang. Choi becomes the first female CEO in the Korean OTT platform business.\r\nChoi’s appointment also follows completion of the merger between TVing and Seezn, a smaller streamer previously owned by local telco giant, KT Corp. The merger is expected to bring cost savings in marketing and customer acquisition, benefitting from KT’s network of 14 million subscribers.\r\nChoi brings a wealth of leadership experience from the IT industry. She held key positions in Korean e-commerce companies, W Concept and Trenbe, a luxury goods online retail startup. Prior to these roles, Choi was also part of the Boston Consulting Group and Walt Disney Korea, managing the Asian business strategy at the time that Disney+ was launched in Korea.\r\nCJ ENM also named Kim Ji-won as the new head of Mnet Plus Business, a K-pop culture platform launched last year, offering K-pop originals from Mnet Music and KCON, and fan-artist interactions. Kim previously held roles at Samsung Electronics, LG Electronics and NCSOFT.\r\n“The new leadership announcement is aligned with CJ ENM’s vision to become a global IP powerhouse. In addition to securing quality IPs backed by solid production capabilities, we are expanding our focus to strengthen our platform business to enhance competitiveness,” said a company spokesperson.\r\nTving, which is already the Korean home for Paramount+, will work with the American firm for upcoming projects including action thriller, “A Bloody Lucky Day” and period drama, “Queen Woo.”",
        "sentiment_score": 0.128,
        "sentiment_rank": "positive",
        "tagged_sent_topics": "Business Model Resilience",
        "company_name": "The Walt Disney Company",
        "company_id": 191473,
        "url": "https://variety.com/2023/tv/news/choi-ju-hui-tving-female-ceo-korean-streaming-1235660043/"
    },
    {
        "id": 62390373,
        "published_at": "2023-07-02T22:34:00Z",
        "title": "Nuclear power and net zero",
        "file_name": "2023-07-02_62390373.txt",
        "full_text": "Clean energy campaigns are not only promoting solar, wind and biomass power in Thailand, but also prompting conversations about nuclear energy.\r\nConsidered a highly contentious energy source by some people, nuclear power technology was addressed by Dhanin Chearavanont, senior chairman of Charoen Pokphand Group, during a recent speech he delivered at the three-day World Chinese Entrepreneurs Convention in Bangkok, which ended on June 26.\r\nNuclear power offers the potential to strengthen Thailand's economy because of its lower development costs than some other forms of clean energy. Yet much of society remains concerned about possible negative impacts from the segment.\r\nExecutives both in the power sector and outside it can see the benefits of nuclear power, but for most people the paramount issue is safety.\r\nKNOWLEDGE IS POWER\r\nEducating people on nuclear technology is necessary if a new government wants to push ahead with nuclear power projects in a clean energy push, said Suvit Toraninpanich, chairman of the Renewable Energy Industry Club under the Federation of Thai Industries (FTI).\r\n\"All nuclear power issues must be linked to improving knowledge,\" he said, referring to information regarding the benefits and safety issues concerning nuclear power.\r\nMr Suvit is aware nuclear energy development is highly contentious among some Thais, who are concerned about the negative impact of potential radioactive leaks and waste management, although this source of energy is cleaner than using fossil fuels.\r\nIf the government decides to add nuclear technology to the list of clean energy development projects over the long term, it must start educating the public right away, he said.\r\n\"Nuclear power topics should appear in children's textbooks,\" said Mr Suvit.\r\n\"Opposition to nuclear power projects should be based on knowledge, not rallies driven by emotions.\"\r\nThere are many types of nuclear technology Thailand could choose to adopt.\r\nHe said the country might not want to develop a large conventional reactor, with electricity generation capacity of 700 megawatts, as is used in Japan. There are two alternatives: a small modular reactor (SMR), with a capacity of up to 300MW per module, and a micro modular reactor (MMR), with a maximum capacity of 10MW per module.\r\n\"One MMR equals 10 solar farms. But while solar farms generate electricity during the daytime, an MMR can produce electricity around the clock,\" said Mr Suvit.\r\nMMRs are widely used, particularly to fuel submarines.\r\nIn Thailand, the government set a target to have renewable energy make up 50% of fuels used for electricity generation in the country within two decades, up from 12% last year.\r\nThe FTI proposed the proportion of clean energy should increase to 80% of the total to support manufacturers that need to reduce carbon dioxide emissions during their production processes to maintain their exports in countries with campaigns aimed at combatting global warming.\r\nIncreasing the country's supply of renewable energy would also help the government achieve its carbon neutrality target, he said.\r\nAt the 26th UN Climate Change Conference in Glasgow in 2021, Prime Minister Prayut Chan-o-cha vowed that Thailand would be more aggressive in addressing climate change and strive to reach carbon neutrality, a balance between carbon dioxide emissions and absorption, by 2050.\r\nThe government needs to come up with good management plans for renewable and cleaner forms of energy to keep its decarbonisation campaign on track, said Mr Suvit.\r\nNot all factories can manage to install solar panels, which require 10,000 square metres to produce 1MW of electricity, because of limited space within their factory compounds, he said.\r\nA law also prohibits factories from buying renewable power across provinces, thereby limiting its use, said Mr Suvit.\r\nFRESH ATTEMPT\r\nThe country's energy authorities again included a nuclear power plant project in the latest national power development plan (PDP), after previous attempts failed to lead to any progress in building up this source.\r\nThe PDP for 2023 to 2037 aims to better promote and support greater use of renewable forms of energy.\r\nUnder the PDP, the authorities plan to develop two nuclear power generation facilities with a combined capacity of 800MW.\r\nThey expect the plants to start operations towards the end of the plan, in either 2036 or 2037, said Wattanapong Kurovat, director-general of the Energy Policy and Planning Office.\r\nThe new government will be asked to endorse this latest PDP, and if approved, a public hearing on the plan would be held, he said.\r\nMr Wattanapong said SMRs are receiving greater interest from authorities in Europe and Japan amid campaigns to combat global warming, which is blamed for causing climate change.\r\nUnlike fossil fuel-fired power plants that emit carbon dioxide, nuclear power reactors do not produce air pollution or carbon dioxide while operating.\r\nAccording to the Washington, DC-based Nuclear Energy Institute, electricity generated by nuclear power prevents more than 470 million metric tonnes of carbon dioxide emissions per year from entering the earth's atmosphere that would otherwise be generated through the use of fossil fuels. Some advocates suggest this is almost equivalent to taking 100 million passenger vehicles off the road.\r\nSMRs, which produce one-third of the electricity generated by conventional nuclear power reactors, offer the potential to develop a cleaner form of energy.\r\nMany SMRs can be produced in factories and transported to their destination by trucks or trains.\r\nImages of a caesium-137 cylinder that went missing from a power plant in Prachin Buri earlier this year. Green Network Facebook Page\r\nLONG HISTORY\r\nPlans to develop a nuclear power plant in Thailand trace back to 1969 when the government agreed to build a plant in Chon Buri province.\r\nThe project faced several delays, including the global oil price crisis in 1974 that drove up costs, along with opposition from local officials.\r\nNuclear energy was mentioned in the 2010 PDP, as authorities proposed a nuclear power project with a total capacity of 2,000MW set to start operations in either 2020 or 2021.\r\nHowever, the project was removed from the PDP in 2011 after the Fukushima incident when a massive earthquake and tsunami triggered nuclear reactor meltdowns and radiation leaks at Japan's coastal nuclear facility in March of that year.\r\nRatchaburi Electricity Generating Plc, a subsidiary of the state-run Electricity Generating Authority of Thailand (Egat), expressed an interest in investing in a nuclear power business overseas, but later decided to cancel the plan, according to media reports.\r\nThe company, which has since changed its name to Ratch Group, announced in January 2016 a joint venture with China General Nuclear Power Corporation and Guangxi Investment Group to develop Fangchenggang Nuclear Power Project Phase II in Guangxi, 45 kilometres from the Vietnamese border.\r\nThis facility falls within the large conventional reactor category.\r\nRatch was to inject 7.5 billion baht in capital through a subsidiary for a 10% shareholding, while China General Nuclear Power would have held a 51% stake and 39% would belong to Guangxi Investment Group.\r\nThe company was the first Thai firm to become involved with this form of technology, but it chose to exit the project after a few years without providing any reasons for the move.\r\nThe outlook for a nuclear energy policy in Thailand remains murky.\r\nEchoing Mr Suvit's view, Mr Wattanapong agrees that public acceptance of nuclear technology is the most important factor in the government's nuclear ambitions.\r\nMany people still have a negative perception of nuclear technology following the Fukushima incident and the explosion at the Chernobyl nuclear power station in the Soviet Union in 1986, he said.\r\nA picture shows a caesium-137 cylinder which went missing from a power plant in Prachin Buri earlier this year. Prachin Buri Public Relations Facebook page\r\nThe authorities need to educate the public and show people how SMR technology is safe if they want to develop nuclear power plants, said Mr Wattanapong.\r\n\"Public education is the most crucial aspect for a nuclear power plan, and good preparation is needed if the new government agrees to adopt SMR technology,\" he said.\r\nElectricity Generating Plc (Egco), another subsidiary of Egat, plans to conduct a feasibility study on SMR technology after it successfully used refinery off-gas containing hydrogen to fuel electricity generation at its power plant in the US.\r\nNuclear and hydrogen energy have the potential to help countries achieve their net-zero targets, a balance between greenhouse gas emissions and absorption, said Egco president Thepparat Theppitak.\r\nHe said he believes the number of large conventional reactors in use will gradually be reduced and replaced by SMRs.\r\nSAFETY FIRST\r\nSanan Angubolkul, chairman of the Thai Chamber of Commerce, said the issue requires thorough study, with Thailand delving into successful examples from countries that use nuclear energy.\r\n\"Thailand faces challenges in terms of energy costs in the short, medium and long term,\" he said.\r\n\"Regarding nuclear energy, we need to review the benefits and safety of having nuclear power plants in the country. This includes evaluating factors such as site selection, technology and various impacts.\"\r\nAccording to Mr Sanan, in the short and medium term, Thailand is still capable of utilising other alternative and clean energy sources, as the country has made significant progress in these areas compared with neighbouring countries.\r\nThailand can continue to develop and increase the proportion of these energy sources used domestically, he said.\r\nChaichan Chareonsuk, chairman of the Thai National Shippers' Council, said Thailand has power plants that generate electricity from various energy sources, such as water, dams, gas and coal.\r\nThese have been the country's long-standing power sources, he said.\r\nThe issue with nuclear power plants is not solely technology nor production cost per unit, said Mr Chaichan.\r\n\"The main issue we should consider is public participation through hearings, providing people with knowledge and a better understanding. This issue is delicate as most Thais are rightly concerned about their safety,\" he said.\r\n\"Safety codes in Thailand must be strict and more rigorous. For example, in everyday life safety measures such as wearing crash helmets and fastening seat belts are fundamental. We still have a long way to go in terms of safety awareness.\"\r\nMr Chaichan said providing knowledge and raising awareness about safety is crucial.\r\nMaintenance and repairs must adhere to standards, while employees performing such tasks should receive thorough training and be well-prepared, he said.\r\nRADIATION FEARS\r\nTwo incidents in Thailand reflect the level of concern over the negative impacts of using radioactive materials, which could hinder plans to develop nuclear power generation facilities.\r\nThe first incident involved a missing caesium-137 cylinder from a power plant in Prachin Buri earlier this year. Its disappearance reflected alleged irregularities and dealt a blow to fruit sales in the eastern province.\r\nCaesium-137 is used in a variety of equipment that measures dampness and density in construction work, liquid levels in pipes or tanks, and the thickness of many materials, including steel.\r\nHowever, the isotope can be dangerous because it can cause cancer if the radioactive material is not managed properly.\r\nMedia crews reported a problem concerning caesium-137 at a National Power Plant 5A Co facility at 304 Industrial Park after a radioactive rod went missing from the company on Feb 23. However, a complaint was not lodged until March 10.\r\nAfter searches took place over a number of days, the authorities found radiated red dust believed to have come from the remains of a caesium-137 tube at a steel smelter in Prachin Buri's Kabin Buri district.\r\nThe authorities were later criticised for not removing the waste effectively.\r\nThe Office of Atoms for Peace argued that a plan to mitigate the fallout from the radioactive incident took longer than expected as the office had to take into account input from experts and local residents.\r\nChoosing a site to store the radioactive material was not easy because of the risks involved and officials had to wait for the residual heat from the smelter's furnace to cool down completely before they could move in and estimate the volume of radioactive dust present, said the office.\r\nPenchom Saetang, director of Ecological Alert and Recovery, told reporters the explanations showed how unprepared the country is regarding radiation-related incidents.\r\nOne impact following the incident was consumers cancelled purchase orders for fruit from Prachin Buri, even though officials insisted no contamination was detected within a five-kilometre radius of the steel factory, according to media reports.\r\nThe other incident involved a protest by a civic group in 2019 against a government plan to build a nuclear research reactor in Nakhon Nayok's Ongkharak district.\r\nThe 20MW reactor was meant to replace a small 58-year-old reactor in Bangkok.\r\nCapt Vilas Obeouan, head of the civic group, told the media the plan to develop a new domestic reactor should be shelved, citing alleged irregularities and questions over safety measures, as well as the way the state agency managed radioactive waste.",
        "sentiment_score": 0.7184,
        "sentiment_rank": "positive",
        "tagged_sent_topics": "Energy Management",
        "company_name": "Electricity Generating Public Company Limited",
        "company_id": 202462,
        "url": "https://www.bangkokpost.com/business/2604135/nuclear-power-and-net-zero"
    },
    {
        "id": 62390424,
        "published_at": "2023-07-02T21:36:35Z",
        "title": "Titanic submarine implosion sparks fears of serious damage to historic wreck",
        "file_name": "2023-07-02_62390424.txt",
        "full_text": "Fears for the future of the Titanic wreck site remain after the tragic destruction of the Titan submersible that killed five men. \r\nThe president of RMS Titanic, Inc. (RMST), the only company allowed to salvage from the doomed ship, has warned that tourism to the ship risk damaging it. \r\nJessica Sanders told the New York Post: \"Thats part of our concern, and that was part of our concern when they started tourist expeditions.\" \r\nShe added: \"There have been a lot of expeditions in the last couple of years. They say that they didnt do anything... We just need to verify.\" \r\nJessica said visiting the wreck is like \"going to a museum\" where people need to be respectful of what is around them. \r\nDebris from the Titan submersible, recovered from the ocean floor near the wreck of the Titanic, is unloaded from the ship Horizon Arctic at the Canadian Coast Guard pier in St John's, Newfoundland (\r\nAP)\r\nRMST is also partly responsible for conservation of the site and visitors to it must follow strict guidelines when navigating the 2.5 square-mile area. \r\nTitan suffered what was likely a \"catastrophic implosion\" near the wreck and a debris field was found around 1,600 feet from the bow. \r\nThe distance from the wreck means it is unlikely Titanic suffered further damage from the Titan implosion, but this has not been confirmed.\r\nJessica added: Again, we have no reason to believe that the Titan submersible came in contact with the wreck site. The investigation is ongoing. \r\nA salvage operation by the US and Canadian Coast Guards in the wake of the disasters is ongoing.\r\nThe Titanic has long been a focus of disaster tourism ever since its final resting place was discovered in 1985. \r\nThe infamous ship secured its place in folklore under tragic circumstances when it sank after striking an iceberg on April 15, 1912. Over 1,500 people were killed as a result of the ship's demise.\r\nThe Titanic continues to draw people from all over the world (\r\nPopperfoto via Getty Images)\r\nOceanGate Expeditions, the owner of the submersible, advertised a visit to the site for paying tourists. \r\nIts five passengers included British billionaire Hamish Harding, businessman Shahzada Dawood and his son and OceanGates CEO and co-founder Stockton Rush. \r\nAlso killed was French diver and Titanic expert Paul-Henri Nargeolet, who reportedly believed the ship \"shouldnt be just for a handful of people who can afford to get there.\"\r\nOf Nargeolet and the horrific circumstances of his death, Jessica said: \"Its difficult because this one ended in a tragedy. But do I think the response is you should never be able to go? Then that contradicts a person that I deeply respected.\"\r\nThere are some calls after the Titan incident for visits to the Titanic to stop due to safety concerns.\r\nSebastian Harris visited the ship in a submersible with his father G. Michael Harris, when he was 13.\r\nSebastian Harris recalled a frightening experience when he became the youngest person to visit the Titanic wreck (\r\nFacebook)\r\n\"While we got down to [the] depth where it flowed over the bow, I spent some time placing a plaque. And then shortly after that, you know, as far as I knew, I fell asleep essentially,\" Sebastian told The Story, adding his father, who was the expedition leader co-piloting the Mir II submersible tried to shake him awake.\r\n\"Turns out we were at 17% oxygen [in the submersible]. And so what happens? You go unconscious. They realized what the issue was, cranked the oxygen back up and ultimately everything was fine,\" he said.\r\nSome groups including the RMST hope to bring the ship back up to be displayed on land. \r\nRead More\r\nRead More\r\nRead More\r\nRead More\r\nRead More",
        "sentiment_score": -0.8779,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Product Quality & Safety",
        "company_name": "Facebook, Inc",
        "company_id": 190623,
        "url": "https://www.mirror.co.uk/news/us-news/titanic-submarine-implosion-sparks-fears-30374430"
    },
    {
        "id": 62390672,
        "published_at": "2023-07-02T20:55:00Z",
        "title": "ROSEN, TRUSTED INVESTOR COUNSEL, Encourages DZS Inc. Investors with Losses to Secure Counsel Before Important Deadline in First Filed Securities Class Action Commenced by the Firm – DZSI",
        "file_name": "2023-07-02_62390672.txt",
        "full_text": "NEW YORK, July 02, 2023 (GLOBE NEWSWIRE) -- \r\nWHY: Rosen Law Firm, a global investor rights law firm, reminds purchasers of the securities of DZS Inc. (NASDAQ: DZSI) between March 10, 2023 and May 31, 2023, both dates inclusive (the Class Period), of the important August 14, 2023 lead plaintiff deadline in the securities class action commenced by the Firm.\r\nSO WHAT: If you purchased DZS securities during the Class Period you may be entitled to compensation without payment of any out of pocket fees or costs through a contingency fee arrangement.\r\nWHAT TO DO NEXT: To join the DZS class action, go to https://rosenlegal.com/submit-form/?case_id=16915 or call Phillip Kim, Esq. toll-free at 866-767-3653 or email pkim@rosenlegal.com or cases@rosenlegal.com for information on the class action. A class action lawsuit has already been filed. If you wish to serve as lead plaintiff, you must move the Court no later than August 14, 2023. A lead plaintiff is a representative party acting on behalf of other class members in directing the litigation.\r\nWHY ROSEN LAW: We encourage investors to select qualified counsel with a track record of success in leadership roles. Often, firms issuing notices do not have comparable experience, resources, or any meaningful peer recognition. Many of these firms do not actually litigate securities class actions, but are merely middlemen that refer clients or partner with law firms that actually litigate the cases. Many of these firms do not actually litigate securities class actions. Be wise in selecting counsel. The Rosen Law Firm represents investors throughout the globe, concentrating its practice in securities class actions and shareholder derivative litigation. Rosen Law Firm has achieved the largest ever securities class action settlement against a Chinese Company. Rosen Law Firm was Ranked No. 1 by ISS Securities Class Action Services for number of securities class action settlements in 2017. The firm has been ranked in the top 4 each year since 2013 and has recovered hundreds of millions of dollars for investors. In 2019 alone the firm secured over $438 million for investors. In 2020, founding partner Laurence Rosen was named by law360 as a Titan of Plaintiffs Bar. Many of the firms attorneys have been recognized by Lawdragon and Super Lawyers.\r\nDETAILS OF THE CASE: According to the lawsuit, throughout the Class Period, defendants made materially false and/or misleading statements and/or failed to disclose, among other things, that: (1) DZS financial statements from March 31, 2023 to the present contained certain errors; (2) as a result, DZS would need to restate its previously filed quarterly financial statement for the period ending March 31, 2023; (3) the Company had ongoing undisclosed issues with its internal controls over financial reporting; and (4) as a result, defendants statements about its business, operations, and prospects, were materially false and misleading and/or lacked a reasonable basis at all relevant times. When the true details entered the market, the lawsuit claims that investors suffered damages.\r\nTo join the DZS class action, go to https://rosenlegal.com/submit-form/?case_id=16915 or call Phillip Kim, Esq. toll-free at 866-767-3653 or email pkim@rosenlegal.com or cases@rosenlegal.com for information on the class action\r\nNo Class Has Been Certified. Until a class is certified, you are not represented by counsel unless you retain one. You may select counsel of your choice. You may also remain an absent class member and do nothing at this point. An investors ability to share in any potential future recovery is not dependent upon serving as lead plaintiff.\r\nFollow us for updates on LinkedIn: https://www.linkedin.com/company/the-rosen-law-firm or on Twitter: https://twitter.com/rosen_firm or on Facebook: https://www.facebook.com/rosenlawfirm.\r\nRosen Law Firm represents investors throughout the globe, concentrating its practice in securities class actions and shareholder derivative litigation. Rosen Law Firm was Ranked No. 1 by ISS Securities Class Action Services for number of securities class action settlements in 2017. The firm has been ranked in the top 4 each year since 2013. Rosen Law Firm has achieved the largest ever securities class action settlement against a Chinese Company. Rosen Law Firms attorneys are ranked and recognized by numerous independent and respected sources. Rosen Law Firm has secured hundreds of millions of dollars for investors.\r\nAttorney Advertising. Prior results do not guarantee a similar outcome.\r\n-------------------------------\r\nContact Information:\r\n        Laurence Rosen, Esq.Phillip Kim, Esq.The Rosen Law Firm, P.A.275 Madison Avenue, 40th FloorNew York, NY 10016Tel: (212) 686-1060Toll Free: (866) 767-3653Fax: (212) 202-3827lrosen@rosenlegal.compkim@rosenlegal.comcases@rosenlegal.comwww.rosenlegal.com",
        "sentiment_score": -0.9844,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Selling Practices & Product Labeling",
        "company_name": "DZS Inc",
        "company_id": 246014,
        "url": "https://www.globenewswire.com/news-release/2023/07/02/2698241/673/en/ROSEN-TRUSTED-INVESTOR-COUNSEL-Encourages-DZS-Inc-Investors-with-Losses-to-Secure-Counsel-Before-Important-Deadline-in-First-Filed-Securities-Class-Action-Commenced-by-the-Firm-DZS.html"
    },
    {
        "id": 62390659,
        "published_at": "2023-07-02T20:25:00Z",
        "title": "ROSEN, A LEADING LAW FIRM, Encourages Canopy Growth Corporation Investors with Losses to Secure Counsel Before Important Deadline in Securities Class Action – CGC",
        "file_name": "2023-07-02_62390659.txt",
        "full_text": "NEW YORK, July 02, 2023 (GLOBE NEWSWIRE) -- \r\nWHY: Rosen Law Firm, a global investor rights law firm, reminds purchasers of securities of Canopy Growth Corporation (NASDAQ: CGC) between May 31, 2022 and May 10, 2023, both dates inclusive (the Class Period), of the important July 24, 2023 lead plaintiff deadline.\r\nSO WHAT: If you purchased Canopy Growth securities during the Class Period you may be entitled to compensation without payment of any out of pocket fees or costs through a contingency fee arrangement.\r\nWHAT TO DO NEXT: To join the Canopy Growth class action, go to https://rosenlegal.com/submit-form/?case_id=16092 or call Phillip Kim, Esq. toll-free at 866-767-3653 or email pkim@rosenlegal.com or cases@rosenlegal.com for information on the class action. A class action lawsuit has already been filed. If you wish to serve as lead plaintiff, you must move the Court no later than July 24, 2023. A lead plaintiff is a representative party acting on behalf of other class members in directing the litigation.\r\nWHY ROSEN LAW: We encourage investors to select qualified counsel with a track record of success in leadership roles. Often, firms issuing notices do not have comparable experience, resources or any meaningful peer recognition. Many of these firms do not actually handle securities class actions, but are merely middlemen that refer clients or partner with law firms that actually litigate the cases. Be wise in selecting counsel. The Rosen Law Firm represents investors throughout the globe, concentrating its practice in securities class actions and shareholder derivative litigation. Rosen Law Firm has achieved the largest ever securities class action settlement against a Chinese Company. Rosen Law Firm was Ranked No. 1 by ISS Securities Class Action Services for number of securities class action settlements in 2017. The firm has been ranked in the top 4 each year since 2013 and has recovered hundreds of millions of dollars for investors. In 2019 alone the firm secured over $438 million for investors. In 2020, founding partner Laurence Rosen was named by law360 as a Titan of Plaintiffs Bar. Many of the firms attorneys have been recognized by Lawdragon and Super Lawyers.\r\nDETAILS OF THE CASE: According to the lawsuit, defendants throughout the Class Period made false and/or misleading statements and/or failed to disclose that: (1) there were material weaknesses in Canopy Growths internal controls over accounting and financial reporting; (2) as a result, Canopy Growth improperly booked sales of its BioSteel business unit; (3) as a result, Canopy Growths revenue was overstated; and (4) as a result of the foregoing, defendants positive statements about Canopy Growths business, operations, and prospects were materially misleading and/or lacked a reasonable basis. When the true details entered the market, the lawsuit claims that investors suffered damages.\r\nTo join the Canopy Growth class action, go to https://rosenlegal.com/submit-form/?case_id=16092 or call Phillip Kim, Esq. toll-free at 866-767-3653 or email pkim@rosenlegal.com or cases@rosenlegal.com for information on the class action.\r\nNo Class Has Been Certified. Until a class is certified, you are not represented by counsel unless you retain one. You may select counsel of your choice. You may also remain an absent class member and do nothing at this point. An investors ability to share in any potential future recovery is not dependent upon serving as lead plaintiff.\r\nFollow us for updates on LinkedIn: https://www.linkedin.com/company/the-rosen-law-firm, on Twitter: https://twitter.com/rosen_firm or on Facebook: https://www.facebook.com/rosenlawfirm/.\r\nAttorney Advertising. Prior results do not guarantee a similar outcome.\r\n-------------------------------\r\nContact Information:\r\n        Laurence Rosen, Esq.Phillip Kim, Esq.The Rosen Law Firm, P.A.275 Madison Avenue, 40th FloorNew York, NY 10016Tel: (212) 686-1060Toll Free: (866) 767-3653Fax: (212) 202-3827lrosen@rosenlegal.compkim@rosenlegal.comcases@rosenlegal.comwww.rosenlegal.com",
        "sentiment_score": -0.9769,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Selling Practices & Product Labeling",
        "company_name": "Canopy Growth Corporation",
        "company_id": 207124,
        "url": "https://www.globenewswire.com/news-release/2023/07/02/2698240/673/en/ROSEN-A-LEADING-LAW-FIRM-Encourages-Canopy-Growth-Corporation-Investors-with-Losses-to-Secure-Counsel-Before-Important-Deadline-in-Securities-Class-Action-CGC.html"
    },
    {
        "id": 62390486,
        "published_at": "2023-07-02T16:30:03Z",
        "title": "Israel stocks higher at close of trade; TA 35 up 0.81%",
        "file_name": "2023-07-02_62390486.txt",
        "full_text": "Investing.com Israel stocks were higher after the close on Sunday, as gains in the Real Estate, Banking and Technology sectors led shares higher.\r\nAt the close in Tel Aviv, the TA 35 gained 0.81%.\r\nThe best performers of the session on the TA 35 were Nova (TASE:NVMI), which rose 3.77% or 1,580.00 points to trade at 43,500.00 at the close. Meanwhile, Tower Semiconductor Ltd (TASE:TSEM) added 3.07% or 420.00 points to end at 14,090.00 and Enlight Renewable Energy Ltd (TASE:ENLT) was up 2.38% or 155.00 points to 6,670.00 in late trade.\r\nThe worst performers of the session were Israel Corp (TASE:ILCO), which fell 1.14% or 1,110.00 points to trade at 96,000.00 at the close. Strauss Group (TASE:STRS) declined 1.05% or 88.00 points to end at 8,256.00 and Shapir Engineering Industry (TASE:SPEN) was down 0.98% or 25.00 points to 2,528.00.\r\nRising stocks outnumbered declining ones on the Tel Aviv Stock Exchange by 296 to 171 and 34 ended unchanged.\r\nShares in Nova (TASE:NVMI) rose to 52-week highs; gaining 3.77% or 1,580.00 to 43,500.00. \r\nCrude oil for August delivery was up 0.84% or 0.59 to $70.45 a barrel. Elsewhere in commodities trading, Brent oil for delivery in September rose 0.91% or 0.68 to hit $75.19 a barrel, while the August Gold Futures contract rose 0.52% or 9.90 to trade at $1,927.80 a troy ounce.\r\nUSD/ILS was up 0.30% to 3.71, while EUR/ILS rose 0.74% to 4.05.\r\nThe US Dollar Index Futures was down 0.42% at 102.57.",
        "sentiment_score": 0.2732,
        "sentiment_rank": "positive",
        "tagged_sent_topics": "Energy Management",
        "company_name": "Tower Semiconductor Ltd",
        "company_id": 193682,
        "url": "https://www.investing.com/news/stock-market-news/israel-stocks-higher-at-close-of-trade-ta-35-up-081-3118307"
    },
    {
        "id": 62390614,
        "published_at": "2023-07-02T16:00:00Z",
        "title": "‘The Bear’ is coming back and so are Carmy’s pristine white tees. But what do the stylish chefs of Toronto wear when the heat is on?",
        "file_name": "2023-07-02_62390614.txt",
        "full_text": "“The Bear,” a frenetic dramedy about a struggling Chicago restaurant, has many charms. Its extreme close-ups, for one, which invade the space of a side of salted meat and star Jeremy Allen White’s stubbled cheek with equal impunity; its effortless flips from deep pathos to high comedy faster than a sear can turn to a burn; the quirky four-dimensional characters, drawn with as much tenderness as a slow-cooked roast beef. Yes, the meat metaphors are (well) done now.\r\nBut you can’t talk about “The Bear” without paying homage to one of its central, if largely unsung, characters. We refer, of course, to the immaculately fitted white T-shirts worn by White as chef Carmy, which the show’s costume designers have said are old-school loopwheel cotton tees from German basics brand Merz B. Schwanen. Despite the kitchen’s abundance of tomato-based juices, Carmy’s white T-shirts somehow manage to remain as pristine and pure as his dream of transforming his late brother’s dive into a food destination to rival the Michelin-starred kitchens he trained in.\r\n“The Bear” season two drops on Disney Plus July 19 (bonjour, Luca, the Hot Pastry Chef) and it got us thinking: What do the stylish chefs in our own city’s restaurants wear to see them through a stressful service? How do they balance function and fashion when the heat is on? And how do they keep their whites as pristine as Carmy’s tee?\r\nHands! Here’s what they had to say.\r\nTaylor McMeekin, Drake Hotel\r\nThe new executive chef of Toronto stalwart the Drake Hotel is very particular when it comes to his aprons.\r\n“I have tried many apron companies and have had a few that I found bunched in uncomfortable areas or twisted easily,” says Taylor McMeekin. After much trial and error, he found his Holy Grail brand, Search &amp; Rescue. “I have been wearing their aprons for the better part of a decade. They are durable and I like the cut.”\r\nHe’s equally passionate about his go-to kitchen shoe, Birkenstock Bostons. “I have always worn them in the kitchen,” says McMeekin. “They save my back when I’m standing for long periods, have a classic look and are easy to remove if needed.” They’re actually the first piece of uniform he’d recommend to someone beginning their kitchen career. “The inexpensive rubber ones are a great start. They’re easily cleaned and durable.”\r\nWhen it comes to his requisite white chef jackets, McMeekin is loyal to short-sleeved ones from Bragard, a classic French uniform brand, calling them “light and breathable.” The finishing touch: his signature glasses frames, either a Tom Ford pair or Ray-Bans.\r\nAnd when he’s not in the kitchen, his uniform is just as precise. “You will find me in a black band tee, Vans Old Skool All Blacks and white sport socks.”\r\nNuit Regular, Kiin, Pai, Sukhothai, Selva\r\nThe co-owner of four Toronto restaurants, Nuit Regular is a study in style contrasts. Outside the kitchen, she’s all about playful, colourful looks. “I have a very bohemian style,” she says. “In the summertime, I love to wear long, flowy dresses and skirts and, in the fall, I love kimono-style wraps.”\r\nAt work, however, she’s much more restrained. “In the kitchen, I’m dressed very simply and comfortably; it is a very basic look that I will always wear, with the exception of my headwrap.”\r\nRegular started wearing colourful Thai headwraps as a practical way to keep her hair out of her face while cooking — a chef’s hat didn’t feel right. “I remembered my ancestors used to wrap their hair with these long, coloured scarves, so I started doing that,” she says. “It also makes me feel closer to my ancestors and my Thai culture, knowing this is how they wrapped their hair. Whenever I cook in the kitchen, it almost feels like my ancestors are watching over me.”\r\nSteel-toed boots are also a must. “I feel safe in the kitchen wearing them,” she explains. “If sharp knives or hot foods accidentally fall on the floor, I know my toes will be safe!”\r\nWhile she’ll wear a Thai-inspired chef’s jacket on special occasions, Regular deliberately chooses to wear a basic uniform sourced from Chef Works most days. “I’ve tried to wear a traditional outfit from Thailand in the kitchen, but it didn’t work. I felt like it was too much of a distraction, and there was a more relaxed and casual feel from my team, like if we were off work,” she says. “Whereas when I switched over to my chef’s jacket, it was back to business as usual.”\r\nWhether he’s whipping up plates at the ultra-buzzy Milou or off duty, chances are you’ll find Mikey Kim wearing a baseball cap. “It’s just my thing,” says Kim, who names the TK as his current favourite hat. “I wear a cap to prevent hair from getting in the food, but I also wear them outside of work.”\r\nInvariably, you’ll also find him in a pair of Dickies pants. “They are wide enough to allow movement and they are super durable,” he says. “They last forever before ripping.”\r\nWhile he’ll often wear white pants — “I’m extra” — Kim recommends the trusty combination of short-sleeve chef’s whites, a black apron and dark pants to remain relatively presentable in the kitchen. In the event of a rogue stain, he uses a mix of equal parts vinegar and laundry detergent, left to soak for five minutes and then scrubbed off. “If the stain remains, dissolve a half cup baking soda in hot water and let it soak for five minutes,” he says. “This should get rid of most stains.”\r\nKim’s streetwear-leaning esthetic means his shoes of choice are Vans or Nikes, but he never wears street shoes in the kitchen. “Sometimes there are accidental spills or grease and the floors can get dangerously slippery,” he says. “Always try to wear shoes with non-slip soles.” He likes the Birkenstock Tokio Super Grip.\r\n“I can’t stress enough how important shoes are,” he concludes. “As cooks, we’re on our feet all day and night, and the feet are where all the problems start. Your feet will determine the longevity and quality of your career, so take care of them!”\r\nKyle Rindinella, Ristorante Sociale\r\nCarmy may be famous for his kitchen tee, but Kyle Rindinella’s just not a fan.\r\n“I always found the neck of a bib apron would annoy me (with a T-shirt), so I always go for something with a collar,” says the chef at new King West eatery Ristorante Sociale, an Enoteca Sociale sister spot.\r\nWhen Rindinella’s in the kitchen, expect to find him either in a mechanic’s shirt or a chef’s coat from industry fave Chef Works. “They have great ventilation in the sides that fit great,” says Rindinella, who’s big on keeping things breezy at work. “I look for pieces that have good airflow and that I feel good wearing for 12 hours.”\r\nPieces that fit that criteria include Uniqlo’s black jeans (they’ve got the perfect amount of give); white leather Birkenstocks (“not only the most comfortable shoes I have found, they always start a conversation being all white”); and two tried-and-tested apron styles: a blue denim number by author and chef Christine Flynn, and Blunt Roll versions he’s had forever.\r\nIf he’s working service on the dining room floor, however, Rindinella likes to dress up a bit. “I find myself gravitating to wearing collared dress shirts, a tie and a blazer,” he says. “Usually with something fun like a farfalle pasta-shaped gold pin.”\r\nWhen it comes to his stain-vs-whites tips, Rindinella has a hard recommend: Linda, an Italian laundry bar soap. “It’s my go-to helper for getting stains out of anything,” he says. “Whether I’m working in the kitchen or on the floor during service, the Linda bar helps get any stain out and it’s very affordable!”\r\nUmberto Aceto, Petty Cash\r\nOne word guides every choice Umberto Aceto makes when getting dressed for work: freedom. “Being unrestricted is essential in the kitchen, to ensure you are able to move quickly and efficiently,” says the newly minted executive chef at the fun downtown spot Petty Cash.\r\nIntegral to this are “well-fitted” vented-back, short-sleeve chef coats. On weekdays, he likes a white coat from Chef’s Warehouse, while Saturdays see him in a more casual navy button-down. “The one piece that overlaps is my black Rag &amp; Bone boot-cut jeans,” he says. “They transition so easily from a service to a night out on the town after work.”\r\nWhile he’s got his uniform down now, he did have a memorable faux pas early in his career. “I tried to wear charcoal grey suede boots my first week at Buca and my chef de cuisine said, ‘This is not a fashion show,’” he recalls. These days, you’ll find him in his trusty Blundstone boots, beloved for their ankle support.\r\nAs for his advice for keeping chef’s whites Carmy levels of pristine: “Petty Cash pizza sauce, blood or jus — just hit it with Tide to Go ASAP. Acting quickly is part of the process to get the results you want,” he says. If that doesn’t work? Outsource it, like most kitchens do when it comes to their uniforms. “Trust your linen service,” Aceto says. “They can get stains out better than we can.”\r\nSHARE:Anyone can read Conversations, but to contribute, you should be a registered Torstar account holder. If you do not yet have a Torstar account, you can create one now (it is free)\r\nSign In\r\nRegister\r\nConversations are opinions of our readers and are subject to theCode of Conduct.The Star\r\n does not endorse these opinions.",
        "sentiment_score": -0.4215,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Product Quality & Safety",
        "company_name": "Buca",
        "company_id": 251163,
        "url": "https://www.thestar.com/life/fashion_style/2023/07/02/the-bear-is-coming-back-and-so-are-carmys-pristine-white-tees-but-what-do-the-stylish-chefs-of-toronto-wear-when-the-heat-is-on.html"
    },
    {
        "id": 62390662,
        "published_at": "2023-07-02T15:48:00Z",
        "title": "HAGENS BERMAN, NATIONAL TRIAL ATTORNEYS, Encourages SentinelOne (S) Investors with Substantial Losses to Contact Firm’s Attorneys, Securities Fraud Class Action Pending",
        "file_name": "2023-07-02_62390662.txt",
        "full_text": "SAN FRANCISCO, July 02, 2023 (GLOBE NEWSWIRE) -- Hagens Berman urges SentinelOne, Inc. (NYSE: S) investors who suffered substantial losses submit your losses now.\r\nClass Period: June 1, 2022 June 1, 2023Lead Plaintiff Deadline: Aug. 7, 2023Visit:www.hbsslaw.com/investor-fraud/SContact An Attorney Now:S@hbsslaw.com844-916-0895\r\nSentinelOne, Inc. (S) Securities Fraud Class Action: \r\nThe complaint alleges Defendants made false and misleading statements and failed to disclose that: (1) SentinelOne lacked effective internal controls over accounting and financial reporting; (2) as a result, the companys key reported business metric annualized recurring revenue or ARR was overstated; and (3) as a result, the companys guidance was overstated.\r\nInvestors learned the truth on June 1, 2023, when after the market closed, SentinelOne published a press release titled SentinelOne Announces First Quarter Fiscal Year 2024 Financial Results. Therein, the Company disclosed that [a]s a result of a change in methodology and correction of historical inaccuracies, which we further describe in our letter to shareholders, we made a one-time adjustment to ARR of $27.0 million or approximately 5% of total ARR.\r\nThe Company also revised its fiscal year 2024 revenue guidance downward to a range of $590 million to $600 million from a range of $631 million to $640 million.\r\nIn a shareholder letter published the same day, SentinelOne further explained that we . . . discovered historical upsell and renewal recording inaccuracies relating to ARR on certain subscription and consumption contracts, which are now corrected and that [w]e are applying a comparable estimated adjustment to the remaining quarters in fiscal year 23, which we believe is a reasonable approximation of the impact in those periods.\r\nOn this news, SentinelOnes stock price fell $7.28 per share, or more than 35%, to close at $13.44 per share on June 2, 2023.\r\nWere focused on investors losses and proving SentinelOne first became aware of the historical inaccuracies in ARR and the decline in customer usage well before the companys disclosures, said Reed Kathrein, the Hagens Berman partner leading the investigation.\r\nIf you invested in SentinelOne and have substantial losses, or have knowledge that may assist the firms investigation, click here to discuss your legal rights with Hagens Berman.\r\nWhistleblowers: Persons with non-public information regarding SentinelOne should consider their options to help in the investigation or take advantage of the SEC Whistleblower program. Under the new program, whistleblowers who provide original information may receive rewards totaling up to 30 percent of any successful recovery made by the SEC. For more information, call Reed Kathrein at 844-916-0895 or email S@hbsslaw.com.\r\nAbout Hagens BermanHagens Berman is a global plaintiffs rights complex litigation law firm focusing on corporate accountability through class-action law. The firm is home to a robust securities litigation practice and represents investors as well as whistleblowers, workers, consumers and others in cases achieving real results for those harmed by corporate negligence and fraud. More about the firm and its successes can be found at hbsslaw.com. Follow the firm for updates and news at @ClassActionLaw. \r\nContact: \r\nReed Kathrein, 844-916-0895",
        "sentiment_score": -0.975,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Selling Practices & Product Labeling",
        "company_name": "SentinelOne Inc",
        "company_id": 243915,
        "url": "https://www.globenewswire.com/news-release/2023/07/02/2698230/32716/en/HAGENS-BERMAN-NATIONAL-TRIAL-ATTORNEYS-Encourages-SentinelOne-S-Investors-with-Substantial-Losses-to-Contact-Firm-s-Attorneys-Securities-Fraud-Class-Action-Pending.html"
    },
    {
        "id": 62390571,
        "published_at": "2023-07-02T15:15:02Z",
        "title": "Tyson Foods to drop 'no antibiotics ever' label on some chicken products- WSJ",
        "file_name": "2023-07-02_62390571.txt",
        "full_text": "July 2 (Reuters) - Tyson Foods is reintroducing\r\ncertain antibiotics to its chicken supply chain, and will drop\r\nits \"no antibiotics ever\" tagline from Tyson-branded chicken\r\nproducts, the Wall Street Journal reported on Sunday.\r\nThis will involve drugs that \"are not important\" to human\r\nhealth and will apply to all fresh, frozen and ready-made\r\nproducts under its brand, the report said.\r\n(Reporting by Shivani Tanna in Bengaluru; Editing by Chizu\r\nNomiyama)",
        "sentiment_score": -0.4939,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Customer Welfare",
        "company_name": "Tyson Foods, Inc",
        "company_id": 190115,
        "url": "https://www.marketscreener.com/quote/stock/TYSON-FOODS-INC-14672/news/Tyson-Foods-to-drop-no-antibiotics-ever-label-on-some-chicken-products-WSJ-44249068/"
    },
    {
        "id": 62390321,
        "published_at": "2023-07-02T15:00:06Z",
        "title": "Designing the First Apple Macintosh: The Engineers’ Story",
        "file_name": "2023-07-02_62390321.txt",
        "full_text": "In 1979 the Macintosh personal computer existed only as the pet idea of Jef Raskin, a veteran of the Apple II team, who had proposed that Apple Computer Inc. make a low-cost appliance-type computer that would be as easy to use as a toaster. Mr. Raskin believed the computer he envisioned, which he called Macintosh, could sell for US $1000 if it was manufactured in high volume and used a powerful microprocessor executing tightly written software.\r\nMr. Raskins proposal did not impress anyone at Apple Computer enough to bring much money from the board of directors or much respect from Apple engineers. The company had more pressing concerns at the time: the major Lisa workstation project was getting under way, and there were problems with the reliability of the Apple III, the revamped version of the highly successful Apple II.\r\nThis article was first published as Design case history: Apples Macintosh. It appeared in the December 1984 issue of IEEE Spectrum. A PDF version is available on IEEE Xplore. The diagrams and photographs appeared in the original print version. The author spoke with many members of the design team in the months following the 1984 introduction of the Macintosh, however, Steve Jobs did not grant an interview for this article.\r\nAlthough the odds seemed against it in 1979, the Macintosh, designed by a handful of inexperienced engineers and programmers, is now recognized as a technical milestone in personal computing. Essentially a slimmed-down version of the Lisa workstation with many of its software features, the Macintosh sold for $2495 at its introduction in early 1984; the Lisa initially sold for $10,000. Despite criticism of the Macintoshthat it lacks networking capabilities adequate for business applications and is awkward to use for some tasksthe computer is considered by Apple to be its most important weapon in the war with IBM for survival in the personal-computer business.\r\nFrom the beginning, the Macintosh project was powered by the dedicated drive of two key players on the project team. For Burrell Smith, who designed the Macintosh digital hardware, the project represented an opportunity for a relative unknown to demonstrate outstanding technical talents. For Steven Jobs, the 29-year-old chairman of Apple and the Macintosh projects director, it offered a chance to prove himself in the corporate world after a temporary setback: although he cofounded Apple Computer, the company had declined to let him manage the Lisa project. Mr. Jobs contributed relatively little to the technical design of the Macintosh, but he had a clear vision of the product from the beginning. He challenged the project team to design the best product possible and encouraged the team by shielding them from bureaucratic pressures within the company.\r\nBurrell Smith and the Early Mac Design\r\nMr. Smith, who was a repairman in the Apple II maintenance department in 1979, had become hooked on microprocessors several years earlier during a visit to the electronics-industry area south of San Francisco known as Silicon Valley. He dropped out of liberal-arts studies at the Junior College of Albany, New York, to pursue the possibilities of microprocessorsthere isnt anything you cant do with those things, he thought. Mr. Smith later became a repairman in Cupertino, Calif., where he spent much time studying the cryptic logic circuitry of the Apple II, designed by company cofounder Steven Wozniak.\r\nMr. Smiths dexterity in the shop impressed Bill Atkinson, one of the Lisa designers, who introduced him to Mr. Raskin as the man whos going to design your Macintosh. Mr. Raskin replied noncommittally, Well see about that.\r\nHowever, Mr. Smith managed to learn enough about Mr. Raskin s conception of the Macintosh to whip up a makeshift prototype using a Motorola 6809 microprocessor, a television monitor, and an Apple II. He showed it to Mr. Raskin, who was impressed enough to make him the second member of the Macintosh team.\r\nBut the fledgling Macintosh project was in trouble. The Apple board of directors wanted to cancel the project in September 1980 to concentrate on more important projects, but Mr. Raskin was able to win a three-month reprieve.\r\nMeanwhile Steve Jobs, then vice president of Apple, was having trouble with his own credibility within the company. Though he had sought to manage the Lisa computer project, the other Apple executives saw him as too inexperienced and eccentric to entrust him with such a major undertaking, and he had no formal business education. After this rejection, he didnt like the lack of control he had, noted one Apple executive. He was looking for his niche.\r\nMr. Jobs became interested in the Macintosh project, and, possibly because few in the company thought the project had a future, Mr. Jobs was made its manager. Under his direction, the design team became as compact and efficient as the Macintosh was tobea group of engineers working at a distance from all the meetings and paper-pushing of the corporate mainstream. Mr. Jobs, in recruiting the other members of the Macintosh team, lured some from other companies with promises of potentially lucrative stock options.\r\nThe Macintosh project was known in the company as Steves folly.\r\nWith Mr. Jobs at the helm, the project gained some credibility among the board of directorsbut not much. According to one team member, it was known in the company as Steves folly. But Mr. Jobs lobbied for a bigger budget for the project and got it. The Macintosh team grew to 20 by early 1981.\r\nThe decision on what form the Macintosh would take was left largely to the design group. At first the members had only the basic principles set forth by Mr. Raskin and Mr. Jobs to guide them, as well as the example set by the Lisa project. The new machine was to be easy to use and inexpensive to manufacture. Mr. Jobs wanted to commit enough money to build an automated factory that would produce about 300 000 computers a year. So one key challenge for the design group was to use inexpensive parts and to keep the parts count low.\r\nMaking the computer easy to use required considerable software for the user-computer interface. The model was, of course, the Lisa workstation with its graphic windows to display simultaneously many different programs. Icons, or little pictures, were used instead of cryptic computer terms to represent a selection of programs on the screen; by moving a mouse, a box the size of a pack of cigarettes, the user manipulated a cursor on the screen. The Macintosh team redesigned the software of the Lisa from scratch to make it operate more efficiently, since the Macintosh was to have far less memory than the 1 million bytes of the Lisa. But the Macintosh software was also required to operate quicker than the Lisa software, which had been criticized for being slow.\r\nDefining the Mac as the Project Progressed\r\nThe lack of a precise definition for the Macintosh project was not a problem. Many of the designers preferred to define the computer as they went along. Steve allowed us to crystallize the problem and the solution simultaneously, recalled Mr. Smith. The method put strain on the design team, since they were continually evaluating design alternatives. We were swamped in detail, Mr. Smith said. But this way of working also led to a better product, the designers said, because they had the freedom to seize opportunities during the design stage to enhance the product.\r\nSuch freedom would not have been possible had the Macintosh project been structured in the conventional way at Apple, according to several of the designers. No one tried to control us, said one. Some managers like to take control, and though that may be good for mundane engineers, it isnt good if you are self-motivated.\r\nCentral to the success of this method was the small, closely knit nature of the design group, with each member being responsible for a relatively large portion of the total design and free to consult other members of the team when considering alternatives. For example, Mr. Smith, who was well acquainted with the price of electronic components from his early work on reducing the cost of the Apple II, made many decisions about the economics of Macintosh hardware without time-consuming consultations with purchasing agents. Because communication among team members was good, the designers shared their areas of expertise by advising each other in the working stages, rather than waiting for a final evaluation from a group of manufacturing engineers. Housing all members of the design team in one small office made communicating easier. For example, it was simple for Mr. Smith to consult a purchasing agent about the price of parts if he needed to, because the purchasing agent worked in the same building.\r\nAndy Hertzfeld, who transferred from the Apple II software group to design the Macintosh operating software, noted, In lots of other projects at Apple, people argue about ideas. But sometimes bright people think a little differently. Somebody like Burrell Smith would design a computer on paper and people would say. Itll never work. So instead Burell builds it lightning fast and has it working before the guy can say anything.\r\nWhen you have one person designing the whole computer, he knows that a little leftover gate in one part may be used in another part.Andy Herzfeld\r\nThe closeness of the Macintosh group enabled it to make design tradeoffs that would not have been possible in a large organization, the team members contended. The interplay between hardware and software was crucial to the success of the Macintosh design, using a limited memory and few electronic parts to perform complex operations. Mr. Smith, who was in charge of the computers entire digital hardware design, and Mr. Herzfeld became close friends and often collaborated. When you have one person designing the whole computer, Mr. Hertzfeld observed, he knows that a little leftover gate in one part may be used in another part.\r\nTo promote interaction among the designers, one of the first things that Mr. Jobs did in taking over the Macintosh project was to arrange special office space for the team. In contrast to Apples corporate headquarters, identified by the company logo on a sign on its well-trimmed lawn, the teams new quarters, behind a Texaco service station, had no sign to identify them and no listing in the company telephone directory. The office, dubbed Texaco Towers, was an upstairs, low-rent, plasterboard-walled, tacky-carpeted place, the kind youd find at a small law outfit, according to Chris Espinosa, a veteran of the original Apple design team and an early Macintosh draftee. It resembled a house more than an office, having a communal area much like a living room, with smaller rooms off to the side for more privacy in working or talking. The decor was part college dormitory, part electronics repair shop: art posters, beanbag chairs, coffee machines, stereo systems, and electronic equipment of all sorts scattered about.\r\nWhenever a competitor came out with a product, we would buy and dismantle it, and it would kick around the office.Chris Espinosa\r\nThere were no set work hours and initially not even a schedule for the development of the Macintosh. Each week, if Mr. Jobs was in town (often he was not), he would hold a meeting at which the team members would report what they had done the previous week. One of the designers sidelines was to dissect the products of their competitors. Whenever a competitor came out with a product, we would buy and dismantle it, and it would kick around the office, recalled Mr. Espinosa.\r\nIn this way, they learned what they did not want their product to be. In their competitors products, Mr. Smith saw a propensity for using connectors and slots for inserting printed-circuit boardsa slot for the video circuitry, a slot for the keyboard circuitry, a slot for the disk drives, and memory slots. Behind each slot were buffers to allow signals to pass onto and off the printed-circuit board properly. The buffers meant delays in the computers operations, since several boards shared a backplane, and the huge capacitance required for multiple PC boards slowed the backplane. The number of parts required made the competitors computers hard to manufacture, costly, and less reliable. The Macintosh team resolved that their PC would have but two printed-circuit boards and no slots, buffers, or backplane.\r\nA challenge in building the Macintosh was to offer sophisticated software using the fewest and least-expensive parts.\r\nTo squeeze the needed components onto the board, Mr. Smith planned the Macintosh to perform specific functions rather than operate as a flexible computer that could be tailored by programmers for a wide variety of applications. By rigidly defining the configuration of the Macintosh and the functions it would perform, he eliminated much circuitry. Instead of providing slots into which the user could insert printed-circuit boards with such hardware as memory or coprocessors, the designers decided to incorporate many of the basic functions of the computer in read-only memory, which is more reliable. The computer would be expanded not by slots, but through a high-speed serial port.\r\nWriting the Macs Software\r\nThe software designers were faced in the beginning with often-unrealistic schedules. We looked for any place where we could beg, borrow, or steal code, Mr. Herzfeld recalled. The obvious place for them to look was the Lisa workstation. The Macintosh team wanted to borrow some of the Lisas software for drawing graphics on the bit-mapped display. In 1981, Bill Atkinson was refining the Lisa graphics software, called Quickdraw, and began to work part-time implementing it for the Macintosh.\r\nQuickdraw was a scheme for manipulating bit maps to enable applications programmers to construct images easily on the Macintosh bit-mapped display. The Quickdraw program allows the programmer to define and manipulate a regiona software representation of an arbitrarily shaped area of the screen. One such region is a rectangular window with rounded comers, used throughout the Macintosh software. Quickdraw also allows the programmer to keep images within defined boundaries, which make the windows in the Macintosh software appear to hold data. The programmer can unite two regions, subtract one from the other, or intersect them.\r\nIn Macintosh, the Quickdraw program was to be tightly written in assembly-level code and etched permanently in ROM. It would serve as a foundation for higher-level software to make use of graphics.\r\nQuickdraw was an amazing graphics package, Mr. Hertzfeld noted, but it would have strained the capabilities of the 6809 microprocessor, the heart of the early Macintosh prototype. Motorola Corp. announced in late 1980 that the 68000 microprocessor was available, but that chip was new and unproven in the field, and at $200 apiece it was also expensive. Reasoning that the price of the chip would come down before Apple was ready to start mass-producing the Macintosh, the Macintosh designers decided to gamble on the Motorola chip.\r\nAnother early design question for the Macintosh was whether to use the Lisa operating system. Since the Lisa was still in the early stages of design, considerable development would have been required to tailor its operating system for the Macintosh. Even if the Lisa had been completed, rewriting its software in assembly code would have been required for the far smaller memory of the Macintosh. In addition, the Lisa was to have a multitasking operating system, using complex circuitry and software to run more than one computer program at the same time, which would have been too expensive for the Macintosh. Thus the decision was made to write a Macintosh operating system from scratch, working from the basic concepts of the Lisa. Simplifying the Macintosh operating system posed the delicate problem of restricting the computers memory capacity enough to keep it inexpensive but not so much as to make it inflexible.\r\nThe Macintosh would have no multitasking capability but would execute only one applications program at a time. Generally, a multitasking operating system tracks the progress of each of the programs it is running and then stores the entire state of each programthe values of its variables, the location of the program counter, and so on. This complex operation requires more memory and hardware than the Macintosh designers could afford. However, the illusion of multitasking was created by small programs built into the Macintosh system software. Since these small programssuch as one that creates the images of a calculator on the screen and does simple arithmeticoperate in areas of memory separate from applications, they can run simultaneously with applications programs.\r\nEmbedding Macintosh software in 64 kilobytes of read-only memory increased the reliability of the computer and simplified the hardware [A]. About one third of the ROM software is the operating system. One third is taken up by Quickdraw, a program for representing shapes and images for the bit-mapped display. The remaining third is devoted to the user ­interface toolbox, which handles the display of windows, text editing, menus, and the like. The user interface of the Macintosh includes pull-down menus, which appear only when the cursor is placed over the menu name and a button on the mouse is pressed. Above, a user examining the file menu selects the open command, which causes the computer to load the file (indicated by darkened icon) from disk into internal memory. The Macintosh software was designed to make the toolbox routines optional for programmers; the applications program offers the choice of whether or not to handle an event [B].\r\nSince the Macintosh used a memory-mapped scheme, the 68000 microprocessor required no memory management, simplifying both the hardware and the software. For example, the 68000 has two modes of operation: a user mode, which is restricted so that a programmer cannot inadvertently upset the memory-management scheme; and a supervisor mode, which allows unrestricted access to all of the 68000s commands. Each mode uses its own stack of pointers to blocks of memory. The 68000 was rigged to run only in the supervisor mode, eliminating the need for the additional stack. Although seven levels of interrupts were available for the 68000, only three were used.\r\nAnother simplification was made in the Macintoshs file structure, exploiting the small disk space with only one or two floppy disk drives. In the Lisa and most other operating systems, two indexes access a program on floppy disk, using up precious random-access memory and increasing the delay in fetching programs from a disk. The designers decided to use only one index for the Macintosha block map, located in RAM, to indicate the location of a program on a disk. Each block map represented one volume of disk space.\r\nThis scheme ran into unexpected difficulties and may be modified in future versions of the Macintosh, Mr. Hertzfeld said. Initially, the Macintosh was not intended for business users, but as the design progressed and it became apparent that the Macintosh would cost more than expected, Apple shifted its marketing plan to target business users. Many of them add hard disk drives to the Macintosh, making the block-map scheme unwieldy.\r\nBy January 1982, Mr. Hertzfeld began working on software for the Macintosh, perhaps the computers most distinctive feature, which he called the user-interface toolbox.\r\nThe toolbox was envisioned as a set of software routines for constructing the windows, pull-down menus, scroll bars, icons, and other graphic objects in the Macintosh operating system. Since RAM space would be scarce on the Macintosh (it initially was to have only 64 kilobytes), the toolbox routines were to be a part of the Macintoshs operating software; they would use the Quickdraw routines and operate in ROM.\r\nIt was important however, not to handicap applications programmerswho could boost sales of the Macintosh by writing programs for itby restricting them to only a few toolbox routines in ROM. So the toolbox code was designed to fetch definition functionsroutines that use Quickdraw to create a graphic image such as a windowfrom either the systems disk or an applications disk. In this way, an applications programmer could add definition functions for a program, which Apple could incorporate in later versions the Macintosh by modifying the system disk. We were nervous about putting (the toolbox) in ROM, recalled Mr. Hertzfeld, We knew that after the Macintosh was out, programmers would want to add to the toolbox routines.\r\nAlthough the user could operate only one applications program at a time, he could transfer text or graphics from one applications program to another with a toolbox routine called scrapbook. Since the scrapbook and the rest of the toolbox routines were located in ROM, they could run along with applications programs, giving the illusion of multitasking. The user would cut text from one program into the scrapbook, close the program, open another, and paste the text from the scrapbook. Other routines in the toolbox, such as the calculator, could also operate simultaneously with applications programs.\r\nLate in the design of the Macintosh software, the designers realized that, to market the Macintosh in non-English-speaking countries, an easy way of translating text in programs into foreign languages was needed. Thus computer code and data were separated in the software to allow translation without unraveling a complex computer program, by scanning the data portion of a program. No programmer would be needed for translation.\r\nPlacing an Early Bet on the 68000 Chip\r\nThe 68000, with a 16-bit data bus and 32-bit internal registers and a 7.83-megahertz clock, could grab data in relatively large chunks. Mr. Smith dispensed with separate controllers for the mouse, the disk drives, and other peripheral functions. We were able to leverage off slave devices, Mr. Smith explained, and we had enough throughput to deal with those devices in a way that appeared concurrent to the user.\r\nWhen Mr. Smith suggested implementing the mouse without a separate controller, several members of the design team argued that if the main microprocessor was interrupted each time the mouse was moved, the movement of the cursor on the screen would always lag. Only when Mr. Smith got the prototype up and running were they convinced it would work.\r\nLikewise, in the second prototype, the disk drives were controlled by the main microprocessor. In other computers, Mr. Smith noted, the disk controller is a brick wall between the disk and the CPU, and you end up with a poor-performance, expensive disk that you can lose control of. Its like buying a brand-new car complete with a chauffeur who insists on driving everywhere.\r\nThe 68000 was assigned many duties of the disk controller and was linked with a disk-controller circuit built by Mr. Wozniak for the Apple II. Instead of a wimpy little 8-bit microprocessor out there, we have this incredible 68000its the worlds best disk controller, Mr. Smith said.\r\nDirect-memory-access circuitry was designed to allow the video screen to share RAM with the 68000. Thus the 68000 would have access to RAM at half speed during the live portion of the horizontal line of the video screen and at full speed during the horizontal and vertical retrace. [See diagram, below.]\r\nThe 68000 microprocessor, which has exclusive access to the read-only memory of the Macintosh, fetches commands from ROM at full speed.83 megahertz. The 68000 shares the random-access memory with the video and sound circuitry, having access to RAM only part of the time [A]; it fetches instructions from RAM at an average speed of about 6 megahertz. The video and sound instructions are loaded directly into the video-shift register or the sound-counter, respectively. Much of the glue circuitry of the Macintosh is contained in eight programmable-array-logic chips. The Macintoshs ability to play four independent voices was added relatively late in the design, when it was realized that most of the circuitry needed already existed in the video circuitry [B]. The four voices are added in software and the digital samples stored in memory. During the video retrace, sound data is fed into the sound buffer.\r\nWhile building the next prototype, Mr. Smith saw several ways to save on digital circuitry and increase the execution speed of the Macintosh. The 68000 instruction set allowed Mr. Smith to embed subroutines in ROM. Since the 68000 has exclusive use of the address and data buses of the ROM, it has access to the ROM routines at up to the full clock speed. The ROM serves somewhat as a high-speed cache memory. While building the next prototype, Mr. Smith saw several ways to save on digital circuitry and increase the execution speed of the Macintosh. The 68000 instruction set allowed Mr. Smith to embed subroutines in ROM. Since the 68000 has exclusive use of the address and data buses of the ROM, it has access to the ROM routines at up to the full clock speed. The ROM serves somewhat as a high-speed cache memory.\r\nThe next major revision in the original concept of the Macintosh was made in the computers display. Mr. Raskin had proposed a computer that could be hooked up to a standard television set. However, it became clear early on that the resolution of television display was too coarse for the Macintosh. After a bit of research, the designers found they could increase the display resolution from 256 by 256 dots to 384 by 256 dots by including a display with the computer. This added to the estimated price of the Macintosh, but the designers considered it a reasonable tradeoff.\r\nTo keep the parts count low, the two input/output ports of the Macintosh were to be serial. The decision to go with this was a serious one, since the future usefulness of the computer depended largely on its efficiency when hooked up to printers, local-area networks, and other peripherals. In the early stages of development, the Macintosh was not intended to be a business product, which would have made networking a high priority.\r\nWe had an image problem. We wore T-shirts and blue jeans with holes in the knees, and we had a maniacal conviction that we were right about the Macintosh, and that put some people off.Chris Espinosa\r\nThe key factor in the decision to use one high-speed serial port was the introduction in the spring of 1981 of the Zilog Corp.s 85530 serial-communications controller, a single chip to replace two less expensive conventional parts vanilla chipsin the Macintosh. The risks in using the Zilog chip were that it had not been proven in the field and it was expensive, almost $9 apiece. In addition, Apple had a hard time convincing Zilog that it seriously intended to order the part in high volumes for the Macintosh.\r\nWe had an image problem, explained Mr. Espinosa. We wore T-shirts and blue jeans with holes in the knees, and we had a maniacal conviction that we were right about the Macintosh, and that put some people off. Also, Apple hadnt yet sold a million Apple IIs. How were we to convince them that we would sell a million Macs?\r\nIn the end, Apple got a commitment from Zilog to supply the part, which Mr. Espinosa attributes to the negotiating talents of Mr. Jobs. The serial input/output ports gave us essentially the same bandwidth that a memory-mapped parallel port would, Mr. Smith said. Peripherals were connected to serial ports in a daisy-chain configuration with the Apple bus network.\r\nDesigning the Macs Factory Without the Product\r\nIn the fall of 1981, as Mr. Smith worked on the fourth Macintosh prototype, the design for the Macintosh factory was getting under way. Mr. Jobs hired Debi Coleman, who was then working as financial manager at Hewlett-Packard Co. in Cupertino, Calif., to handle the finances of the Macintosh project. A graduate of Stanford University with a masters degree in business ad­ministration, Ms. Coleman was a member of a task force at HP that was studying factories, quality management, and inventory management. This was good training for Apple, for Mr. Jobs was intent on using such concepts to build a highly automated manufacturing plant for the Macintosh in the United States.\r\nBriefly he considered building the plant in Texas, but since the designers were to work closely with the manufacturing team in the later stages of the Macintosh design, he decided to locate the plant at Fremont, Calif., less than a half-hours drive from Apples Cupertino headquarters.\r\nMr. Jobs and other members of the Macintosh team made frequent tours of automated plants in various industries, particularly in Japan. At long meetings held after the visits, the manufacturing group discussed whether to borrow certain methods they had observed.\r\nThe Macintosh factory borrowed assembly ideas from other computer plants and other industries. A method of testing the brightness of cathode-ray tubes was borrowed from television manufacturers.\r\nThe Macintosh factory design was based on two major concepts. The first was just-in-time inventory, calling for vendors to deliver parts for the Macintosh frequently, in small lots, to avoid excessive handling of components at the factory and reduce damage and storage costs. The second concept was zero-defect parts, with any defect on the manufacturing line immediately traced to its source and rectified to prevent recurrence of the error.\r\nThe factory, which was to churn out about a half million Macintosh computers a year (the number kept increasing), was designed to be built in three stages: first, equipped with stations for workers to insert some Macintosh components, delivered to them by simple robots; second, with robots to insert components instead of workers; and third, many years in the future, with integrated automation, requiring virtually no human operators. In building the factory, Steve was willing to chuck all the traditional ideas about manufacturing and the relationship between design and manufacturing, Ms. Coleman noted. He was willing to spend whatever it cost to experiment in this factory. We planned to have a major revision every two years.\r\nBy late 1982, before Mr. Smith had designed the final Macintosh prototype, the designs of most of the factorys major subassemblies were frozen, and the assembly stations could be designed. About 85 percent of the components on the digital-logic printed-circuit board were to be inserted automatically, and the remaining 15 percent were to be surface-mounted devices inserted manually at first and by robots in the second stage of the factory. The production lines for automatic insertion were laid out to be flexible; the number of stations was not defined until trial runs were made. The materials-delivery system, designed with the help of engineers recruited from Texas Instruments in Dallas, Texas, divided small and large parts between receiving doors at the materials distribution center. The finished Macintoshes coming down the conveyor belt were to be wrapped in plastic and stuffed into boxes using equipment adapted from machines used in the wine industry for packaging bottles.\r\nMost of the discrete components in the Macintosh are inserted automatically into the printed-circuit boards.\r\nAs factory construction progressed, pressure built on the Macintosh design team to deliver a final prototype. The designers had been working long hours but with no deadline set for the computers introduction. That changed in the middle of 1981, after Mr. Jobs imposed a tough and sometimes unrealistic schedule, reminding the team repeatedly that real artists ship a finished product. In late 1981, when IBM announced its personal computer, the Macintosh marketing staff began to refer to a window of opportunity that made it urgent to get the Macintosh to customers.\r\nWe had been saying, Were going to finish in six months for two years, Mr. Hertzfeld recalled.\r\nThe new urgency led to a series of design problems that seemed to threaten the Macintosh dream.\r\nThe Mac Team Faces Impossible Deadlines\r\nThe computers circuit density was one bottleneck. Mr. Smith had trouble paring enough circuitry off his first two prototypes to squeeze them onto one logic board. In addition, he needed faster circuitry for the Macintosh display. The horizontal resolution was only 384 dotsnot enough room for the 80 characters of text needed for the Macintosh to compete as a word processor. One suggested solution was to use the word-processing software to allow an 80-character line to be seen by horizontal scrolling. However, most standard computer displays were capable of holding 80 characters, and the portable computers with less capability were very inconvenient to use.\r\nAnother problem with the Macintosh display was its limited dot density. Although the analog circuitry, which was being designed by Apple engineer George Crow, accommodated 512 dots on the horizontal axis, Mr. Smiths digital circuitrywhich consisted of bipolar logic arraysdid not operate fast enough to generate the dots. Faster bipolar circuitry was considered but rejected because of its high-power dissipation and its cost. Mr. Smith could think of but one alternative: combine the video and other miscellaneous circuitry on a single custom n-channel MOS chip.\r\nMr. Smith began designing such a chip in February 1982. During the next six months the size of the hypothetical chip kept growing. Mr. Jobs set a shipping target of May 1983 for the Macintosh but, with a backlog of other design problems, Burrell Smith still had not finished designing the custom chip, which was named after him: the IBM (Integrated Burrell Machine) chip.\r\nMeanwhile, the Macintosh offices were moved from Texaco Towers to more spacious quarters at the Apple headquarters, since the Macintosh staff had swelled to about 40. One of the new employees was Robert Belleville, whose previous employer was the Xerox Palo Alto Research Corp. At Xerox he had designed the hardware for the Star workstationwhich, with its windows, icons. and mouse, might be considered an early prototype of the Macintosh. When Mr. Jobs offered him a spot on the Macintosh team, Mr. Belleville was impatiently waiting for authorization from Xerox to proceed on a project he had proposed that was similar to the Macintosha low-cost version of the Star.\r\nAsthe new head of the Macintosh engineering, Mr. Belleville faced the task of directing Mr. Smith, who was proceeding on what looked more and more like a dead-end course. Despite the looming deadlines, Mr. Belleville tried a soft-sell approach.\r\nI asked Burrell if he really needed the custom chip, Mr. Belleville recalled. He said yes. I told him to think about trying something else.\r\nAfter thinking about the problem for three months, Mr. Smith concluded in July 1982 that the difference in size between this chip and the state of Rhode Island is not very great. He then set out to design the circuitry with higher-speed programmable-array logicas he had started to do six months earlier. He had assumed that higher resolution in the horizontal video required a faster clock speed. But he realized that he could achieve the same effect with clever use of faster bipolar-logic chips that had become available only a few months earlier. By adding several high­-speed logic circuits and a few ordinary circuits, he pushed the resolution up to 512 dots.\r\nAnother advantage was that the PALs were a mature technology and their electrical parameters could tolerate large variations from the specified values, making the Macintosh more stable and more reliableimportant characteristics for a so-called appliance product. Since the electrical characteristics of each integrated circuit may vary from those of other ICs made in different batches, the sum of the variances of 50or so components in a computer may be large enough to threaten the systems integrity.\r\nIt became an intense and almost religious argument about the purity of the systems design versus the users freedom to configure the system as he liked. We had weeks of argument over whether to add a few pennies to the cost of the machine.Chris Espinosa\r\nEven as late as the summer of 1982, with one deadline after another blown, the Macintosh designers were finding ways of adding features to the computer. After the team disagreed over the choice of a white background for the video with black characters or the more typical white-on-black, it was suggested that both options be made available to the user through a switch on the back of the Macintosh. But this compromise led to debates about other questions.\r\nIt became an intense and almost religious argument, recalled Mr. Espinosa, about the purity of the systems design versus the users freedom to configure the system as he liked. We had weeks of argument over whether to add a few pennies to the cost of the machine.\r\nThe designers, being committed to the Macintosh, often worked long hours to refine the system. A programmer might spend many night hours to reduce the time needed to format a disk from three minutes to one. The reasoning was that expenditure of a Macintosh programmers time amounted to little in comparison with a reduction of two minutes in the formatting time. If you take two extra minutes per user, times a million people, times 50 disks to format, thats a lot of the worlds time, Mr. Espinosa explained.\r\nBut if the groups commitment to refinements often kept them from meeting deadlines, it paid off in tangible design improvements. There was a lot of competition for doing something very bright and creative and amazing, said Mr. Espinosa. People were so bright that it became a contest to astonish them.\r\nThe Macintosh teams approach to workinglike a Chautauqua, with daylong affairs where people would sit and talk about how they were going to do this or thatsparked creative thinking about the Macintoshs capabilities. When a programmer and a hardware designer started to discuss how to implement the sound generator, for instance, they were joined by one of several nontechnical members of the teammarketing staff, finance specialists, secretarieswho remarked how much fun it would be if the Macintosh could sound four distinct voices at once so the user could program it to play music. That possibility excited the programmer and the hardware engineer enough to spend extra hours in designing a sound generator with four voices.\r\nThe payoff of such discussions with nontechnical team members, Mr. Espinosa said, was coming up with all those glaringly evident things that only somebody completely ignorant could come up with. If you immerse yourself in a group that doesnt know the technical limitations, then you get a group mania to try and deny those limitations. You start trying to do the impossibleand once in a while succeeding.\r\nNobody had even considered designing a four-voice [sound] generatorthat is, not until group mania set in.\r\nThe sound generator in the original Macintosh was quite simplea one-bit register connected to a speaker. To vibrate the speaker, the programmer wrote a software loop that changed the value of the register from one to zero repeatedly. Nobody had even considered designing a four-voice generatorthat is, not until group mania set in.\r\nMr. Smith was pondering this problem when he noticed that the video circuitry was very similar to the sound-generator circuitry. Since the video was bit-mapped, a bit of memory represented one dot on the video screen. The bits that made up a complete video image were held in a block of RAM and fetched by a scanning circuit to generate the image. Sound circuitry required similar scanning, with data in memory corresponding to the amplitude and frequency of the sound emanating from the speaker. Mr. Smith reasoned that by adding a pulse-width-modulator circuit, the video circuitry could be used to generate sound during the last microsecond of the horizontal retracethe time it took the electron beam in the cathode-ray tube of the display to move from the last dot on each line to the first dot of the next line. During the retrace the video-scanning circuitry jumped to a block of memory earmarked for the amplitude value of the sound wave, fetched bytes, deposited them in a buffer that fed the sound generator, and then jumped back to the video memory in time for the next trace. The sound generator was simply a digital-to-analog converter connected to a linear amplifier.\r\nTo enable the sound generator to produce four distinct voices, software routines were written and embedded in ROM to accept values representing four separate sound waves and convert them into one complex wave. Thus a programmer writing applications programs for the Macintosh could specify separately each voice without being concerned about the nature of the complex wave.\r\nGearing up to Build Macs\r\nIn the fall of 1982, as the factory was being built and the design of the Macintosh was approaching its final form, Mr. Jobs began to play a greater role in the day-to-day activities of the designers. Although the hardware for the sound generator had been designed, the software to enable the computer to make sounds had not yet been written by Mr. Hertzfeld, who considered other parts of the Macintosh software more urgent. Mr. Jobs had been told that the sound generator would be impressive, with the analog circuitry and the speaker having been upgraded to accommodate four voices. But since this was an additional hardware expense, with no audible results at that point, one Friday Mr. Jobs issued an ultimatum: If I dont hear sound out of this thing by Monday morning, were ripping out the amplifier.\r\nThat motivation sent Mr. Hertzfeld to the office during the weekend to write the software. By Sunday afternoon only three voices were working. He telephoned his colleague Mr. Smith and asked him to stop by and help optimize the software.\r\nDo you mean to tell me youre using subroutines! Burrell Smith exclaimed after examining the problem. No wonder you cant get four voices. Subroutines are much too slow.\r\nDo you mean to tell me youre using subroutines! Mr. Smith exclaimed after examining the problem. No wonder you cant get four voices. Subroutines are much too slow.\r\nBy Monday morning, the pair had written the microcode programs to produce results that satisfied Mr. Jobs.\r\nAlthough Mr. Jobss input was sometimes hard to define, his instinct for defining the Macintosh as a product was important to its success, according to the designers. He would say, This isnt what I want. I dont know what I want, but this isnt it. Mr. Smith said.\r\nHe knows what great products are, noted Mr. Hertzfeld. He intuitively knows what people want.\r\nOne example was the design of the Macintosh casing, when clay models were made to demonstrate various possibilities. I could hardly tell the difference between two models, Mr. Hertzfeld said. Steve would walk in and say, This one stinks and this one is great. And he was usually right.\r\nBecause Mr. Jobs placed great emphasis on packaging the Macintosh to occupy little space on a desk, a vertical design was used, with the disk drive placed underneath the CRT.\r\nMr. Jobs also decreed that the Macintosh contain no fans, which he had tried to eliminate from the original Apple computer. A vent was added to the Macintosh casing to allow cool air to enter and absorb heat from the vertical power supply, with hot air escaping at the top. The logic board was horizontally positioned.\r\n[Steve] Jobs at times gave unworkable orders. When he demanded that the designers reposition the RAM chips on an early printed-circuit board because they were too close together, most people chortled.\r\nMr. Jobs, however, at times gave unworkable orders. When he demanded that the designers reposition the RAM chips on an early printed-circuit board because they were too close together, most people chortled, one designer said. The board was redesigned with the chips farther apart, but it did not work because the signals from the chips took too long to propagate over the increased distance. The board was redesigned again to move the chips back to their original position.\r\nStopping the Radiation Leaks\r\nWhen the design group started to concentrate on manufacturing, the most imposing task was preventing radiation from leaking from the Macintoshs plastic casing. At one time the fate of the Apple II had hung in the balance as its designers tried unsuccessfully to meet the emissions standards of the Federal Communications Commission. I quickly saw the number of Apple II components double when several inductors and about 50 capacitors were added to the printed-circuit boards, Mr. Smith recalled. With the Macintosh, however, he continued, we eliminated all of the discrete electronics by going to a connector-less and solder-less design; we had had our noses rubbed in the FCC regulations, and we knew how important that was. The high­speed serial I/O ports caused little interference because they were easy to shield.\r\nAnother question that arose toward the end of the design was the means of testing the Macintosh. In line with the zero-defect concept, the Macintosh team devised software for factory workers to use in debugging faults in the printed-circuit boards, as well as self-testing routines for the Macintosh itself.\r\nThe disk controller is tested with the video circuits. Video signals sent into the disk controller are read by the microprocessor. We can display on the screen the pattern we were supposed to receive and the pattern we did receive when reading off the disk, Mr. Smith explained, and other kinds of prepared information about errors and where they occurred on the disk.\r\nTo test the printed-circuit boards in the factory, the Macintosh engineers designed software for a custom bed-of-nails tester that checks each computer in only a few seconds, faster than off-the-­shelf testers. If a board fails when a factory worker places it on the tester, the board is handed to another worker who runs a diagnostic test on it. A third worker repairs the board and returns it to the production line.\r\nEach Macintosh is burned inthat is, turned on and heatedto detect the potential for early failures before shipping, thus increasing the reliability of the computers that are in fact shipped.\r\nWhen Apple completed building the Macintosh factory, at an investment of $20 million, the design team spent most of its time there, helping the manufacturing engineers get the production lines moving. Problems with the disk drives in the middle of 1983 required Mr. Smith to redesign his final prototype twice.\r\nSome of the plans for the factory proved troublesome, according to Ms. Coleman. The automatic insertion scheme for discrete components was unexpectedly difficult to implement. Many of the precise specifications for the geometric and electrical properties of the parts had to be reworked several times. Machines proved to be needed to align many of the parts before they were inserted. Although the machines, at $2000 apiece, were not expensive, they were a last-minute requirement.\r\nThe factory had few major difficulties with its first experimental run in December 1983, although the project had slipped from its May 1983 deadline. Often the factory would stop completely while engineers busily traced the faults to the sourcespart of the zero-defect approach. Mr. Smith and the other design engineers virtually lived in the factory that December.\r\nIn January 1984 the first salable Macintosh computer rolled off the line. Although the production rate was erratic at first, it has since settled at one Macintosh every 27 secondsabout a half million a year.\r\nAn Unheard of $30 Million Marketing Budget\r\nThe marketing of the Macintosh shaped up much like the marketing of a new shampoo or soft drink, according to Mike Murray, who was hired in 1982 as the third member of the Macintosh marketing staff. If Pepsi has two times more shelf space than Coke, he explained, you will sell more Pepsi. We want to create shelf space in your mind for the Macintosh.\r\nTo create that space on a shelf already crowded by IBM, Tandy, and other computer companies, Apple launched an aggressive advertising campaignits most expensive ever.\r\nMr. Murray proposed the first formal marketing budget for the Macintosh in late 1983: he asked for $40 million. People literally laughed at me, he recalled. They said, What kind of a yo-yo is this guy? He didnt get his $40 million budget, but he got close to it$30 million.\r\nWeve established a beachhead with the Macintosh. If IBM knew in their heart of hearts how aggressive and driven we are, they would push us off the beach right now.Mike Murray\r\nThe marketing campaign started before the Macintosh was introduced. Television viewers watching the Super Bowl football game in January 1984 saw a commercial with the Macintosh overcoming Orwells nightmare vision of 1984.\r\nOther television advertisements, as well as magazine and billboard ads, depicted the Macintosh as being easy to learn to use. In some ads, the Mac was positioned directly alongside IBMs personal computer. Elaborate color foldouts in major magazines pictured the Macintosh and members of the design team.\r\nThe interesting thing about this business, mused Mr. Murray, is that there is no history. The best way is to come in really smart, really understand the fundamentals of the technology and how the software dealers work, and then run as fast as you can.\r\nThe Mac Team Disperses\r\nWeve established a beachhead with the Macintosh, explained Mr. Murray. Were on the beach. If IBM knew in their heart of hearts how aggressive and driven we are, they would push us off the beach right now, and I think theyre trying. The next 18 to 24 months is do-or-die time for us.\r\nWith sales of the Lisa workstation disappointing, Apple is counting on the Macintosh to survive. The ability to bring out a successful family of products is seen as a key to that goal, and the company is working on a series of Macintosh peripheralsprinters, local-area networks, and the like. This, too, is proving both a technical and organizational challenge.\r\nOnce you go from a stand-alone system to a networked one, the complexity increases enormously, noted Mr. Murray. We cannot throw it all out into the market and let people tell us what is wrong with it. We have to walk before we can run.\r\nOnly two software programs were written by Apple for the MacintoshMacpaint, which allows users to draw pictures with the mouse, and Macwrite, a word-processing program. Apple is counting on independent software vendors to write and market applications programs for the Macintosh that will make it a more attractive product for potential customers. The company is also modifying some Lisa software for use on Macintosh and making versions of the Macintosh software to run on the Lisa.\r\nMeanwhile the small, coherent Macintosh design team is no longer. Nowadays were a large company, Mr. Smith remarked.\r\nThe pendulum of the project swings, explained Mr. Hertzfeld, who has taken a leave of absence from Apple. Now the company is a more mainstream organization, with managers who have managers working for them. Thats why Im not there, because I got spoiled working on the Macintosh design team.",
        "sentiment_score": -0.43035,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "GHG Emissions || Product Quality & Safety",
        "company_name": "Apple Inc",
        "company_id": 191469,
        "url": "https://spectrum.ieee.org/apple-macintosh"
    },
    {
        "id": 62390599,
        "published_at": "2023-07-02T14:31:03Z",
        "title": "ROSEN, A LEADING LAW FIRM, Encourages SentinelOne, Inc. Investors to Secure Counsel Before Important Deadline in Securities Class Action - S",
        "file_name": "2023-07-02_62390599.txt",
        "full_text": "NEW YORK, July 2, 2023 /PRNewswire/ --\r\nWHY: Rosen Law Firm, a global investor rights law firm, reminds purchasers of securities of SentinelOne, Inc. (NYSE: S) between June 1, 2022 and June 1, 2023, both dates inclusive (the \"Class Period\"), of the important August 7, 2023 lead plaintiff deadline. \r\nSO WHAT: If you purchased SentinelOne securities during the Class Period you may be entitled to compensation without payment of any out of pocket fees or costs through a contingency fee arrangement.\r\nWHAT TO DO NEXT: To join the SentinelOne class action, go to https://rosenlegal.com/submit-form/?case_id=16897 or call Phillip Kim, Esq. toll-free at 866-767-3653 or email pkim@rosenlegal.com or cases@rosenlegal.com for information on the class action. A class action lawsuit has already been filed. If you wish to serve as lead plaintiff, you must move the Court no later than August 7, 2023. A lead plaintiff is a representative party acting on behalf of other class members in directing the litigation.\r\nWHY ROSEN LAW: We encourage investors to select qualified counsel with a track record of success in leadership roles. Often, firms issuing notices do not have comparable experience, resources or any meaningful peer recognition. Many of these firms do not actually litigate securities class actions, but are merely middlemen that refer clients or partner with law firms that actually litigate the cases. Be wise in selecting counsel. The Rosen Law Firm represents investors throughout the globe, concentrating its practice in securities class actions and shareholder derivative litigation. Rosen Law Firm has achieved the largest ever securities class action settlement against a Chinese Company. Rosen Law Firm was Ranked No. 1 by ISS Securities Class Action Services for number of securities class action settlements in 2017. The firm has been ranked in the top 4 each year since 2013 and has recovered hundreds of millions of dollars for investors. In 2019 alone the firm secured over $438 million for investors. In 2020, founding partner Laurence Rosen was named by law360 as a Titan of Plaintiffs' Bar. Many of the firm's attorneys have been recognized by Lawdragon and Super Lawyers.\r\nDETAILS OF THE CASE: According to the lawsuit, defendants throughout the Class Period made false and/or misleading statements and/or failed to disclose that: (1) SentinelOne lacked effective internal controls over accounting and financial reporting; (2) as a result, SentinelOne's Annualized Recurring Revenue (\"ARR\") was overstated; (3) as a result, SentinelOne's guidance was overstated; and (4) as a result of the foregoing, defendant's positive statements about the Company's business, operations, and prospects were materially misleading and/or lacked a reasonable basis. When the true details entered the market, the lawsuit claims that investors suffered damages.\r\nTo join the SentinelOne class action, go to https://rosenlegal.com/submit-form/?case_id=16897mailto:or call Phillip Kim, Esq. toll-free at 866-767-3653 or email pkim@rosenlegal.com or cases@rosenlegal.com for information on the class action.\r\nNo Class Has Been Certified. Until a class is certified, you are not represented by counsel unless you retain one. You may select counsel of your choice. You may also remain an absent class member and do nothing at this point. An investor's ability to share in any potential future recovery is not dependent upon serving as lead plaintiff.\r\nFollow us for updates on LinkedIn: https://www.linkedin.com/company/the-rosen-law-firm, on Twitter: https://twitter.com/rosen_firm or on Facebook: https://www.facebook.com/rosenlawfirm/.\r\nAttorney Advertising. Prior results do not guarantee a similar outcome.\r\nContact Information:\r\nLaurence Rosen, Esq.Phillip Kim, Esq.The Rosen Law Firm, P.A.275 Madison Avenue, 40th FloorNew York, NY 10016Tel: (212) 686-1060Toll Free: (866) 767-3653Fax: (212) 202-3827lrosen@rosenlegal.compkim@rosenlegal.comcases@rosenlegal.comwww.rosenlegal.com\r\n View original content to download multimedia:https://www.prnewswire.com/news-releases/rosen-a-leading-law-firm-encourages-sentinelone-inc-investors-to-secure-counsel-before-important-deadline-in-securities-class-action--s-301868346.html\r\nSOURCE Rosen Law Firm, P.A.",
        "sentiment_score": -0.9623,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Selling Practices & Product Labeling",
        "company_name": "SentinelOne Inc",
        "company_id": 243915,
        "url": "https://www.marketscreener.com/quote/stock/SENTINELONE-INC-124221575/news/ROSEN-A-LEADING-LAW-FIRM-Encourages-SentinelOne-Inc-Investors-to-Secure-Counsel-Before-Important-44249051/"
    },
    {
        "id": 62390634,
        "published_at": "2023-07-02T14:30:00Z",
        "title": "ROSEN, A LEADING LAW FIRM, Encourages SentinelOne, Inc. Investors to Secure Counsel Before Important Deadline in Securities Class Action - S",
        "file_name": "2023-07-02_62390634.txt",
        "full_text": "NEW YORK, July 2, 2023 /PRNewswire/ --\r\nWHY: Rosen Law Firm, a global investor rights law firm, reminds purchasers of securities of SentinelOne, Inc. (NYSE: S) between June 1, 2022 and June 1, 2023, both dates inclusive (the \"Class Period\"), of the important August 7, 2023 lead plaintiff deadline. \r\nSO WHAT: If you purchased SentinelOne securities during the Class Period you may be entitled to compensation without payment of any out of pocket fees or costs through a contingency fee arrangement.\r\nWHAT TO DO NEXT: To join the SentinelOne class action, go to https://rosenlegal.com/submit-form/?case_id=16897 or call Phillip Kim, Esq. toll-free at 866-767-3653 or email [email protected] or [email protected] for information on the class action. A class action lawsuit has already been filed. If you wish to serve as lead plaintiff, you must move the Court no later than August 7, 2023. A lead plaintiff is a representative party acting on behalf of other class members in directing the litigation.\r\nWHY ROSEN LAW: We encourage investors to select qualified counsel with a track record of success in leadership roles. Often, firms issuing notices do not have comparable experience, resources or any meaningful peer recognition. Many of these firms do not actually litigate securities class actions, but are merely middlemen that refer clients or partner with law firms that actually litigate the cases. Be wise in selecting counsel. The Rosen Law Firm represents investors throughout the globe, concentrating its practice in securities class actions and shareholder derivative litigation. Rosen Law Firm has achieved the largest ever securities class action settlement against a Chinese Company. Rosen Law Firm was Ranked No. 1 by ISS Securities Class Action Services for number of securities class action settlements in 2017. The firm has been ranked in the top 4 each year since 2013 and has recovered hundreds of millions of dollars for investors. In 2019 alone the firm secured over $438 million for investors. In 2020, founding partner Laurence Rosen was named by law360 as a Titan of Plaintiffs' Bar. Many of the firm's attorneys have been recognized by Lawdragon and Super Lawyers.\r\nDETAILS OF THE CASE: According to the lawsuit, defendants throughout the Class Period made false and/or misleading statements and/or failed to disclose that: (1) SentinelOne lacked effective internal controls over accounting and financial reporting; (2) as a result, SentinelOne's Annualized Recurring Revenue (\"ARR\") was overstated; (3) as a result, SentinelOne's guidance was overstated; and (4) as a result of the foregoing, defendant's positive statements about the Company's business, operations, and prospects were materially misleading and/or lacked a reasonable basis. When the true details entered the market, the lawsuit claims that investors suffered damages.\r\nTo join the SentinelOne class action, go to https://rosenlegal.com/submit-form/?case_id=16897mailto:or call Phillip Kim, Esq. toll-free at 866-767-3653 or email [email protected] or [email protected] for information on the class action.\r\nNo Class Has Been Certified. Until a class is certified, you are not represented by counsel unless you retain one. You may select counsel of your choice. You may also remain an absent class member and do nothing at this point. An investor's ability to share in any potential future recovery is not dependent upon serving as lead plaintiff.\r\nFollow us for updates on LinkedIn: https://www.linkedin.com/company/the-rosen-law-firm, on Twitter: https://twitter.com/rosen_firm or on Facebook: https://www.facebook.com/rosenlawfirm/.\r\nAttorney Advertising. Prior results do not guarantee a similar outcome.\r\nContact Information:\r\nLaurence Rosen, Esq.Phillip Kim, Esq.The Rosen Law Firm, P.A.275 Madison Avenue, 40th FloorNew York, NY 10016Tel: (212) 686-1060Toll Free: (866) 767-3653Fax: (212) 202-3827[email protected][email protected][email protected]www.rosenlegal.com\r\nSOURCE Rosen Law Firm, P.A.",
        "sentiment_score": -0.9623,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Selling Practices & Product Labeling",
        "company_name": "SentinelOne Inc",
        "company_id": 243915,
        "url": "https://www.prnewswire.com/news-releases/rosen-a-leading-law-firm-encourages-sentinelone-inc-investors-to-secure-counsel-before-important-deadline-in-securities-class-action--s-301868346.html"
    },
    {
        "id": 62390619,
        "published_at": "2023-07-02T13:01:01Z",
        "title": "TDS DEADLINE TOMORROW: ROSEN, A LEADING LAW FIRM, Encourages Telephone and Data Systems, Inc. Investors with Losses in Excess of $100K to Secure Counsel Before Important July 3 Deadline in Securities Class Action – TDS, TDS-PU, TDS-PV",
        "file_name": "2023-07-02_62390619.txt",
        "full_text": "WHY: Rosen Law Firm, a global investor rights law firm, reminds purchasers of securities of Telephone and Data Systems, Inc. (NYSE: TDS, TDS-PU, TDS-PV) between May 6, 2022 and November 3, 2022, both dates inclusive (the “Class Period”), of the important July 3, 2023 lead plaintiff deadline.\r\nSO WHAT: If you purchased TDS securities during the Class Period you may be entitled to compensation without payment of any out of pocket fees or costs through a contingency fee arrangement.\r\nWHAT TO DO NEXT: To join the TDS class action, go to https://rosenlegal.com/submit-form/?case_id=15807 or call Phillip Kim, Esq. toll-free at 866-767-3653 or email pkim@rosenlegal.com or cases@rosenlegal.com for information on the class action. A class action lawsuit has already been filed. If you wish to serve as lead plaintiff, you must move the Court no later than July 3, 2023. A lead plaintiff is a representative party acting on behalf of other class members in directing the litigation.\r\nWHY ROSEN LAW: We encourage investors to select qualified counsel with a track record of success in leadership roles. Often, firms issuing notices do not have comparable experience, resources or any meaningful peer recognition. Many of these firms do not actually litigate securities class actions, but are merely middlemen that refer clients or partner with law firms that actually litigate the cases.Be wise in selecting counsel. The Rosen Law Firm represents investors throughout the globe, concentrating its practice in securities class actions and shareholder derivative litigation. Rosen Law Firm has achieved the largest ever securities class action settlement against a Chinese Company. Rosen Law Firm was Ranked No. 1 by ISS Securities Class Action Services for number of securities class action settlements in 2017. The firm has been ranked in the top 4 each year since 2013 and has recovered hundreds of millions of dollars for investors. In 2019 alone the firm secured over $438 million for investors. In 2020, founding partner Laurence Rosen was named by law360 as a Titan of Plaintiffs’ Bar. Many of the firm’s attorneys have been recognized by Lawdragon and Super Lawyers.\r\nDETAILS OF THE CASE: According to the lawsuit, TDS and its subsidiary, United States Cellular Corporation (“UScellular”), made false and/or misleading statements and/or failed to disclose that: (1) defendants had no reason to believe UScellular’s “free upgrade” promotional activity, which was tested and trialed during the second quarter of 2022, was effective at reducing the Company’s postpaid churn rate as they represented to investors, as opposed to merely adding new postpaid subscribers, when its churn rate was actually increasing or remaining constant over most quarters in the class period; (2) UScellular was not making progress with respect to its churn rate, as it represented to investors; (3) UScellular was not in fact balancing its promotional activity and its profitability; (4) due to extreme competition among postpaid carriers, UScellular did not have the flexibility to offset the costs from widespread, expensive promotions with price increases; and (5) as a result of the Companies’ decision for UScellular to continue engaging in heavy promotions to address its postpaid subscriber churn rate despite any lack of positive impact on churn rate, UScellular’s profitability substantially declined. When the true details entered the market, the lawsuit claims that investors suffered damages.\r\nTo join the TDS class action, go to https://rosenlegal.com/submit-form/?case_id=15807 or call Phillip Kim, Esq. toll-free at 866-767-3653 or email pkim@rosenlegal.com or cases@rosenlegal.com for information on the class action.\r\nNo Class Has Been Certified. Until a class is certified, you are not represented by counsel unless you retain one. You may select counsel of your choice. You may also remain an absent class member and do nothing at this point. An investor’s ability to share in any potential future recovery is not dependent upon serving as lead plaintiff.\r\nFollow us for updates on LinkedIn: https://www.linkedin.com/company/the-rosen-law-firm, on Twitter: https://twitter.com/rosen_firm or on Facebook: https://www.facebook.com/rosenlawfirm/.\r\nAttorney Advertising. Prior results do not guarantee a similar outcome.\r\nView source version on businesswire.com: https://www.businesswire.com/news/home/20230702084819/en/",
        "sentiment_score": 0.1004,
        "sentiment_rank": "positive",
        "tagged_sent_topics": "Selling Practices & Product Labeling",
        "company_name": "Telephone and Data Systems, Inc",
        "company_id": 191509,
        "url": "https://www.marketscreener.com/quote/stock/TELEPHONE-AND-DATA-SYSTEM-9895013/news/TDS-DEADLINE-TOMORROW-ROSEN-A-LEADING-LAW-FIRM-Encourages-Telephone-and-Data-Systems-Inc-Invest-44249020/"
    },
    {
        "id": 62390623,
        "published_at": "2023-07-02T13:01:01Z",
        "title": "TDS DEADLINE TOMORROW: ROSEN, A LEADING LAW FIRM, Encourages Telephone and Data Systems, Inc. Investors with Losses in Excess of $100K to Secure Counsel Before Important July 3 Deadline in Securities Class Action – TDS, TDS-PU, TDS-PV",
        "file_name": "2023-07-02_62390623.txt",
        "full_text": "WHY: Rosen Law Firm, a global investor rights law firm, reminds purchasers of securities of Telephone and Data Systems, Inc. (NYSE: TDS, TDS-PU, TDS-PV) between May 6, 2022 and November 3, 2022, both dates inclusive (the “Class Period”), of the important July 3, 2023 lead plaintiff deadline.\r\nSO WHAT: If you purchased TDS securities during the Class Period you may be entitled to compensation without payment of any out of pocket fees or costs through a contingency fee arrangement.\r\nWHAT TO DO NEXT: To join the TDS class action, go to https://rosenlegal.com/submit-form/?case_id=15807 or call Phillip Kim, Esq. toll-free at 866-767-3653 or email pkim@rosenlegal.com or cases@rosenlegal.com for information on the class action. A class action lawsuit has already been filed. If you wish to serve as lead plaintiff, you must move the Court no later than July 3, 2023. A lead plaintiff is a representative party acting on behalf of other class members in directing the litigation.\r\nWHY ROSEN LAW: We encourage investors to select qualified counsel with a track record of success in leadership roles. Often, firms issuing notices do not have comparable experience, resources or any meaningful peer recognition. Many of these firms do not actually litigate securities class actions, but are merely middlemen that refer clients or partner with law firms that actually litigate the cases.Be wise in selecting counsel. The Rosen Law Firm represents investors throughout the globe, concentrating its practice in securities class actions and shareholder derivative litigation. Rosen Law Firm has achieved the largest ever securities class action settlement against a Chinese Company. Rosen Law Firm was Ranked No. 1 by ISS Securities Class Action Services for number of securities class action settlements in 2017. The firm has been ranked in the top 4 each year since 2013 and has recovered hundreds of millions of dollars for investors. In 2019 alone the firm secured over $438 million for investors. In 2020, founding partner Laurence Rosen was named by law360 as a Titan of Plaintiffs’ Bar. Many of the firm’s attorneys have been recognized by Lawdragon and Super Lawyers.\r\nDETAILS OF THE CASE: According to the lawsuit, TDS and its subsidiary, United States Cellular Corporation (“UScellular”), made false and/or misleading statements and/or failed to disclose that: (1) defendants had no reason to believe UScellular’s “free upgrade” promotional activity, which was tested and trialed during the second quarter of 2022, was effective at reducing the Company’s postpaid churn rate as they represented to investors, as opposed to merely adding new postpaid subscribers, when its churn rate was actually increasing or remaining constant over most quarters in the class period; (2) UScellular was not making progress with respect to its churn rate, as it represented to investors; (3) UScellular was not in fact balancing its promotional activity and its profitability; (4) due to extreme competition among postpaid carriers, UScellular did not have the flexibility to offset the costs from widespread, expensive promotions with price increases; and (5) as a result of the Companies’ decision for UScellular to continue engaging in heavy promotions to address its postpaid subscriber churn rate despite any lack of positive impact on churn rate, UScellular’s profitability substantially declined. When the true details entered the market, the lawsuit claims that investors suffered damages.\r\nTo join the TDS class action, go to https://rosenlegal.com/submit-form/?case_id=15807 or call Phillip Kim, Esq. toll-free at 866-767-3653 or email pkim@rosenlegal.com or cases@rosenlegal.com for information on the class action.\r\nNo Class Has Been Certified. Until a class is certified, you are not represented by counsel unless you retain one. You may select counsel of your choice. You may also remain an absent class member and do nothing at this point. An investor’s ability to share in any potential future recovery is not dependent upon serving as lead plaintiff.\r\nFollow us for updates on LinkedIn: https://www.linkedin.com/company/the-rosen-law-firm, on Twitter: https://twitter.com/rosen_firm or on Facebook: https://www.facebook.com/rosenlawfirm/.\r\nAttorney Advertising. Prior results do not guarantee a similar outcome.\r\nView source version on businesswire.com: https://www.businesswire.com/news/home/20230702084819/en/",
        "sentiment_score": 0.1004,
        "sentiment_rank": "positive",
        "tagged_sent_topics": "Selling Practices & Product Labeling",
        "company_name": "United States Cellular Corporation",
        "company_id": 190303,
        "url": "https://www.marketscreener.com/quote/stock/TELEPHONE-AND-DATA-SYSTEM-9895013/news/TDS-DEADLINE-TOMORROW-ROSEN-A-LEADING-LAW-FIRM-Encourages-Telephone-and-Data-Systems-Inc-Invest-44249020/"
    },
    {
        "id": 62390641,
        "published_at": "2023-07-02T13:01:00Z",
        "title": "ROSEN, SKILLED INVESTOR COUNSEL, Encourages John Wiley & Sons, Inc. Investors to Inquire About Securities Class Action Investigation – WLY, WLYB",
        "file_name": "2023-07-02_62390641.txt",
        "full_text": "NEW YORK, July 02, 2023 (GLOBE NEWSWIRE) -- WHY: Rosen Law Firm, a global investor rights law firm, continues its investigation of potential securities claims on behalf of shareholders of John Wiley &amp; Sons, Inc. (NYSE: WLY, WLYB) resulting from allegations that Wiley may have issued materially misleading business information to the investing public.\r\nSO WHAT: If you purchased Wiley securities you may be entitled to compensation without payment of any out of pocket fees or costs through a contingency fee arrangement. The Rosen Law Firm is preparing a class action seeking recovery of investor losses.\r\nWHAT TO DO NEXT: To join the prospective class action, go to https://rosenlegal.com/submit-form/?case_id=17186 or call Phillip Kim, Esq. toll-free at 866-767-3653 or email pkim@rosenlegal.com or cases@rosenlegal.com for information on the class action.\r\nWHAT IS THIS ABOUT: On March 9, 2023, Wiley announced its Q3 2023 financial results, in which it disclosed issues at Hindawi, one of its subsidiaries. The Companys CEO stated Our third quarter results and revised full year outlook are clearly below our expectations and While our core business and markets are strong, weve been challenged this year by unpredictable market headwinds and an unplanned publishing pause at Hindawi. It was further announced that Research was down 4% as reported, or down 2% at constant currency and excluding acquisitions, primarily due to a pause in the Hindawi special issues publishing program. The program was suspended temporarily due to the presence in certain special issues of compromised articles. As a result, Hindawi revenue declined $9 million vs. prior year, offsetting growth in other open access publishing programs.\r\nOn this news, the price of Wiley Class A stock price declined by $7.55, or 17.35%, to close at $35.96 per share on March 9, 2023.\r\nWHY ROSEN LAW: We encourage investors to select qualified counsel with a track record of success in leadership roles. Often, firms issuing notices do not have comparable experience, resources, or any meaningful peer recognition. Many of these firms do not actually litigate securities class actions. Be wise in selecting counsel. The Rosen Law Firm represents investors throughout the globe, concentrating its practice in securities class actions and shareholder derivative litigation. Rosen Law Firm has achieved the largest ever securities class action settlement against a Chinese Company. Rosen Law Firm was Ranked No. 1 by ISS Securities Class Action Services for number of securities class action settlements in 2017. The firm has been ranked in the top 4 each year since 2013 and has recovered hundreds of millions of dollars for investors. In 2019 alone the firm secured over $438 million for investors. In 2020, founding partner Laurence Rosen was named by law360 as a Titan of Plaintiffs Bar. Many of the firms attorneys have been recognized by Lawdragon and Super Lawyers.\r\nFollow us for updates on LinkedIn: https://www.linkedin.com/company/the-rosen-law-firm, on Twitter: https://twitter.com/rosen_firm or on Facebook: https://www.facebook.com/rosenlawfirm/.\r\nAttorney Advertising. Prior results do not guarantee a similar outcome.\r\n-------------------------------\r\nContact Information:\r\nLaurence Rosen, Esq.Phillip Kim, Esq.The Rosen Law Firm, P.A.275 Madison Avenue, 40th FloorNew York, NY 10016Tel: (212) 686-1060Toll Free: (866) 767-3653Fax: (212) 202-3827lrosen@rosenlegal.compkim@rosenlegal.comcases@rosenlegal.comwww.rosenlegal.com",
        "sentiment_score": -0.875,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Selling Practices & Product Labeling",
        "company_name": "John Wiley & Sons B",
        "company_id": 240031,
        "url": "https://www.globenewswire.com/news-release/2023/07/02/2698227/673/en/ROSEN-SKILLED-INVESTOR-COUNSEL-Encourages-John-Wiley-Sons-Inc-Investors-to-Inquire-About-Securities-Class-Action-Investigation-WLY-WLYB.html"
    },
    {
        "id": 62390644,
        "published_at": "2023-07-02T13:01:00Z",
        "title": "ROSEN, SKILLED INVESTOR COUNSEL, Encourages John Wiley & Sons, Inc. Investors to Inquire About Securities Class Action Investigation – WLY, WLYB",
        "file_name": "2023-07-02_62390644.txt",
        "full_text": "NEW YORK, July 02, 2023 (GLOBE NEWSWIRE) -- WHY: Rosen Law Firm, a global investor rights law firm, continues its investigation of potential securities claims on behalf of shareholders of John Wiley &amp; Sons, Inc. (NYSE: WLY, WLYB) resulting from allegations that Wiley may have issued materially misleading business information to the investing public.\r\nSO WHAT: If you purchased Wiley securities you may be entitled to compensation without payment of any out of pocket fees or costs through a contingency fee arrangement. The Rosen Law Firm is preparing a class action seeking recovery of investor losses.\r\nWHAT TO DO NEXT: To join the prospective class action, go to https://rosenlegal.com/submit-form/?case_id=17186 or call Phillip Kim, Esq. toll-free at 866-767-3653 or email pkim@rosenlegal.com or cases@rosenlegal.com for information on the class action.\r\nWHAT IS THIS ABOUT: On March 9, 2023, Wiley announced its Q3 2023 financial results, in which it disclosed issues at Hindawi, one of its subsidiaries. The Companys CEO stated Our third quarter results and revised full year outlook are clearly below our expectations and While our core business and markets are strong, weve been challenged this year by unpredictable market headwinds and an unplanned publishing pause at Hindawi. It was further announced that Research was down 4% as reported, or down 2% at constant currency and excluding acquisitions, primarily due to a pause in the Hindawi special issues publishing program. The program was suspended temporarily due to the presence in certain special issues of compromised articles. As a result, Hindawi revenue declined $9 million vs. prior year, offsetting growth in other open access publishing programs.\r\nOn this news, the price of Wiley Class A stock price declined by $7.55, or 17.35%, to close at $35.96 per share on March 9, 2023.\r\nWHY ROSEN LAW: We encourage investors to select qualified counsel with a track record of success in leadership roles. Often, firms issuing notices do not have comparable experience, resources, or any meaningful peer recognition. Many of these firms do not actually litigate securities class actions. Be wise in selecting counsel. The Rosen Law Firm represents investors throughout the globe, concentrating its practice in securities class actions and shareholder derivative litigation. Rosen Law Firm has achieved the largest ever securities class action settlement against a Chinese Company. Rosen Law Firm was Ranked No. 1 by ISS Securities Class Action Services for number of securities class action settlements in 2017. The firm has been ranked in the top 4 each year since 2013 and has recovered hundreds of millions of dollars for investors. In 2019 alone the firm secured over $438 million for investors. In 2020, founding partner Laurence Rosen was named by law360 as a Titan of Plaintiffs Bar. Many of the firms attorneys have been recognized by Lawdragon and Super Lawyers.\r\nFollow us for updates on LinkedIn: https://www.linkedin.com/company/the-rosen-law-firm, on Twitter: https://twitter.com/rosen_firm or on Facebook: https://www.facebook.com/rosenlawfirm/.\r\nAttorney Advertising. Prior results do not guarantee a similar outcome.\r\n-------------------------------\r\nContact Information:\r\nLaurence Rosen, Esq.Phillip Kim, Esq.The Rosen Law Firm, P.A.275 Madison Avenue, 40th FloorNew York, NY 10016Tel: (212) 686-1060Toll Free: (866) 767-3653Fax: (212) 202-3827lrosen@rosenlegal.compkim@rosenlegal.comcases@rosenlegal.comwww.rosenlegal.com",
        "sentiment_score": -0.875,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Selling Practices & Product Labeling",
        "company_name": "John Wiley & Sons",
        "company_id": 240179,
        "url": "https://www.globenewswire.com/news-release/2023/07/02/2698227/673/en/ROSEN-SKILLED-INVESTOR-COUNSEL-Encourages-John-Wiley-Sons-Inc-Investors-to-Inquire-About-Securities-Class-Action-Investigation-WLY-WLYB.html"
    },
    {
        "id": 62390421,
        "published_at": "2023-07-02T12:10:31Z",
        "title": "Ein elektrisches Boot mit aktueller Porsche-Technik",
        "file_name": "2023-07-02_62390421.txt",
        "full_text": "Porsche und Audi haben in den letzten Monaten an der PPE-Plattform gearbeitet, die auf der J1-Plattform des Porsche Taycan aufbaut. Das erste Modell wird der Porsche Macan als Elektroauto sein, doch 2024 kommt auch das erste Boot damit.\r\nDie Frauscher x Porsche 850 Fantom Air nutzt die PPE-Plattform, was bedeutet, dass man einen 100 kWh großen Akku bekommt und auch die 800 Volt-Technik vorhanden ist. Genaue Leistungsdaten wurden bisher allerdings nicht genannt.\r\n25 Einheiten sollen ab 2024 produziert werden und es hat auch einen guten Grund, warum es noch keine finalen Daten gibt: Die verrät Porsche natürlich erst mit der Ankündigung des elektrischen Macan, die wohl später in diesem Jahr stattfindet.\r\nDie finalen Details zur Frauscher x Porsche 850 Fantom Air gibt es in etwas weniger als 100 Tagen, was auch die Frage aufwirft, ob Porsche den Macan vorher zeigt. Und Porsche prüft aktuell weitere Anwendungsfälle seines Antriebsstrangs.\r\nDie Volkswagen AG hat letzte Woche eine neue Strategie vorgestellt und verraten, dass der Fokus vorerst auf zwei Elektro-Plattformen liegt: MEB+ und PPE. Doch im Hintergrund arbeitet man an der […]26. Juni 2023 JETZT LESEN →",
        "sentiment_score": -0.5994,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Employee Health & Safety",
        "company_name": "Volkswagen AG",
        "company_id": 208748,
        "url": "https://www.mobiflip.de/shortnews/ein-elektrisches-boot-mit-aktueller-porsche-technik/"
    },
    {
        "id": 62390491,
        "published_at": "2023-07-02T12:00:00Z",
        "title": "Batteries And Renewables Are Saving Texas During The Heat Wave",
        "file_name": "2023-07-02_62390491.txt",
        "full_text": "Texas, along with much of the South, has been subject to a relentless, prolonged heat wave for several weeks the kind of climate-fueled extreme weather event that scientists have warned us will happen with increasing frequency. This particular event is so extreme that Texas has been hotter than 99% of the Earth.\r\nBut unlike during Winter Storm Uri that blanketed Texas with ice and blackouts in 2021, the states grid has so far held up under the immense strain of powering millions of air conditioners cranked up at their highest power, driving peak demand to an all-time high of nearly 81,000 megawatts (MW), easily surpassing the 69,000 MW peak demand during the winter storm.\r\nSo, whats the difference from 2021? How has the grid managed to function with more demand placed on it than ever before?\r\nA cow stands next to a truck in a field on the ranch of cattle rancher Bob Helmers, who recently ... [+] allowed utility company Engie to build several wind turbines on his land, April 16, 2021 near Eldorado, Texas. - Cattle rancher Bobby Helmers cranes to listen as the blades of his six giant wind turbines slice through the air in the same Texas fields that once echoed with the sounds of oil pumps. Like JR and Bobby Ewing, lead characters in the hit 1970s and 80s TV series \"Dallas,\" Helmers hosted oil wells on his land for decades. But with renewable energy increasingly viable even in the petroleum-rich Lone Star State, the 79-year-old is among several ranchers who have plugged their pumps and made the shift to wind power. (Photo by Sergio FLORES / AFP) (Photo by SERGIO FLORES/AFP via Getty Images)\r\nAFP via Getty Images\r\nIts all thanks to the rapid additions of solar, wind, and grid-scale battery storage in the last two years. Texas has added almost 3,000 MW of wind since Winter Storm Uri, and utility scale solar in the state has doubled every year since 2020, with nearly 10,000 MW of new solar added since 2020.\r\nAnd here is the amazing statistic that few people know Texas accounted for nearly 70% of grid battery additions in the U.S. in the first three months of 2023, resulting in a total capacity of 3,300 MW, almost all of which have come online since early 2021. In fact, Texas passed California last year in total installed solar and almost kept pace with California when it comes to new grid battery installations.\r\nBut during this historic heat wave, its been all these new, low-cost wind, solar and batteries that have kept the grid afloat and Texans cool in many cases saving lives. Solar and wind provided 35% of statewide power last Tuesday and generated a record 31,500 MW Wednesday, which more than covered the 9,600 MW of electricity lost when extreme heat knocked several natural gas and coal plants offline. And just as solar power started falling in the evening, batteries kicked in immediately to get Texas through the most difficult part of the day when the sun was setting but the ACs were still cranking.\r\nThis all tallies with what energy system researchers have been saying for years: A combination of wind, solar, and battery storage are often more reliable than fossil fuel generation to handle periods of extremely high demand, especially if these peaks occur for short durations during a day.\r\nCoal and gas plants are much more vulnerable to failure during extreme weather events than renewables and batteries, as weve seen in both these Texas events. Equipment froze during Winter Storm Uri at natural gas and coal plants and natural gas pipelines, while coal and gas plants have been forced offline during the current heat wave. Coal and gas plants are extremely complex facilities with numerous valves, pipelines, and other moving parts, introducing so many points of failure when tested in extreme environments. Solar, wind and, batteries have few moving parts and are much less complex, making them less prone to weather-caused failure.\r\nThis heat wave makes recent efforts by the Texas legislature to punish renewables in the name of politics even more harmful. To score petty political points, they are exposing Texans to a more unreliable grid while worsening the climate problem thats subjecting their state to extreme events.\r\nWhite male uses thermal imaging camera to perform quality control and check for bad cells at the ... [+] Webberville Solar Farm, the largest active solar project of any public power utility in the country. It has over 127,000 modules and can generate more than 61 million kWh of electricity, (Photo by Robert Daemmrich Photography Inc/Corbis via Getty Images)\r\nCorbis via Getty Images\r\nAnd on top of this, creating a reliable Texas grid with renewables, storage and, efficiency will actually result in cheaper electricity rates for Texans. Recent Energy Innovation modeling found that tapping available federal clean energy tax credits from the Inflation Reduction Act would cut annual statewide energy expenditures a cumulative $21 billion through 2050, while increasing Texas GDP by $15 billion in 2030.\r\nWhats not to like about a reliable, resilient grid that someone will pay you to take?\r\nIt's not too late for Texas policymakers to redirect their energy to aid Texans. They can make it easier to build renewables and storage by streamlining the clean energy interconnection process, facilitating transmission buildout, pushing for greater regional grid coordination, and dedicating funding for public utility commissions and state agencies to maximize Inflation Reduction Act funding, among other initiatives. At the same time, policymakers should institute measures that encourage energy efficiency and demand response. Their citizens will thank them for making their lives better and helping them adapt to climate change.",
        "sentiment_score": 0.7906,
        "sentiment_rank": "positive",
        "tagged_sent_topics": "Energy Management",
        "company_name": "Getty Images Inc.",
        "company_id": 249965,
        "url": "https://www.forbes.com/sites/anandgopal/2023/07/02/batteries-and-renewables-are-saving-texas-in-the-heat-wave/"
    },
    {
        "id": 62390518,
        "published_at": "2023-07-02T10:00:00Z",
        "title": "After “Barbie,” Mattel Is Raiding Its Entire Toy Box",
        "file_name": "2023-07-02_62390518.txt",
        "full_text": "In 2019, Greta Gerwig became the latest in a line of writers, directors, and producers to make a pilgrimage to a toy workshop in El Segundo, California. Touring the facility, the Mattel Design Center, has become a rite of passage for Hollywood types who are considering transforming one of the companys products into a moviea list that now includes such names as J. J. Abrams (Hot Wheels) and Vin Diesel (Rock Em Sock Em Robots). The building has hundreds of workspaces for artists, model-makers, and project managers, and it houses elaborate museum-style exhibitions that document the companys history and core products. These displays can help a toy designer find inspiration; they can also offer a brand immersiona crash course in a Mattel property slated for adaptation. When a V.I.P. visits, Richard Dickson, a tall, bespectacled man who is the companys chief operating officer, plays the role of Willy Wonka. Hell show off the sixty-five-year-old machines that are still used to affix fake hair to Barbies; hell invite you to inspect life-size, road-ready replicas of Hot Wheels cars. The center even boasts a giant rendering of Castle Grayskull, the fearsome ancestral home of He-Man. The brand immersion is the everything moment, Dickson told me. I have met with some of the greatest artists, truly, in the world. . . . And, if you dont walk out drinking the Kool-Aid, then it was a great playdate, but maybe we dont continue playing.\r\nThe actress Margot Robbie, who had toured the center in 2018, wanted to continue playing. Shed signed up for a Barbie movie, and had approached Gerwig about writing the script. She saw in Gerwigs filmography the right combination of intelligence and heart: You watch something like Little Women, and the dialogue is very, very cleverits talking about some big thingsbut its also extremely emotional. The project wasnt an obvious fit for someone whose screenplays included the subtle dramas Lady Bird and Frances Ha, and Gerwig wavered for more than a year. At one point, Dickson called her when she was mixing Little Women in New York. I dont have a ton of friends in corporate America, she told me, over Zoom. But he was very excited. It was sweet. She finally agreed to come to El Segundo.\r\nThe Design Center is divided into such sectors as Girls, Wheels, and Action Play, but Barbie is a realm unto itselfthe largest in the building. Its demarcated by a signature pink: Pantone 219 C. Gerwig was shown a display called the Barbie Wall of Fame, whose entryway was emblazoned with the brands mission statement: to inspire &amp; nurture the limitless potential in every girl. Framed photographs captured Barbie posing with everyone from Diahann Carroll to Dean Martin, but Gerwig was most struck by a series of shots of historical models, including an all-Barbie Presidential ticket, from 1992. Oh, wow, Gerwig said. Weve had a Barbie President, I see. A Mattel employee proudly replied that Barbie had been to space before most earthly women had a credit card.\r\nAs Gerwig peppered Dickson with questions, a concept began to take shape. Barbie could be a meta-comedy that moved between the idealized, plastic realm of the dolls and the human world of the company that had created them. Just like the Design Center exhibition, the film could bring together Barbies from across the decades: Robbie could be one of many.\r\nGerwig would go on to write and direct Barbie, and her brand immersion left some visual imprints. The colorful conference room where she and Dickson chatted after her tour informed the look of the fictional Mattels inner sanctum. It was a combination of, like, Oh, this is a corporation, and its all very official and Its bright pink,  Gerwig told me. I thought, This is so cinematic. (In the film, Mattel execs huddle in a Dr. Strangelove-style war roomwith a heart-shaped table.)\r\nI met Dickson at the Design Center last November. At the start of my visit, he suggested that we race miniature Hot Wheels cars on a sloping, multistory orange track with six successive loop-the-loops. Both our cars got marooned on it. Dickson was embarrassed by the unsatisfactory play experience, but he rebounded as he guided me along a wall-mounted time line that juxtaposed major political and cultural events with seminal Mattel releases. (The year 1961 was marked by both the Bay of Pigs invasion and the creation of Ken, Barbies boyfriend.) The display, he explained, served as a reminder to Mattel designers to aim for relevance. As the cultural conception of womens roles had changed, so had Barbie: stewardess outfits had been supplanted by lab coats and plastic safety goggles. When our toys connect to whats happening in the world, you see significant growth in the company, he said. When we dont, you see a blip. What you start to realize is: This is a pop-culture company.\r\nWhen the Israeli-born businessman Ynon Kreiz became the head of Mattel, in 2018, he was its fourth C.E.O. in four years. Toys R Us had recently gone bankrupt, causing a slump in sales; Kreizs predecessor had resigned after Mattel suffered a loss of three hundred million dollars. Kreiz, whose résumé includes a stint at Fox Kids Europe, saw an opportunity for growth. Mattel, he argued, had a childrens-entertainment catalogue second only to Disney. Just as Marvel had gone from ailing comic-book publisher to Hollywood behemoth, the toymaker could leverage its intellectual property at the multiplex. Kreiz told me, My thesis was that we needed to transition from being a toy-manufacturing company, making items, to an I.P. company, managing franchises.\r\nBefore Kreiz took over, Mattel had licensed its flagship properties to an array of studios, and he was intent on reclaiming the rights to Barbie from Sony, where a satirical take on the doll had long been in the works, cycling through such stars as Anne Hathaway and Amy Schumer. A film that ridiculed Barbie, Kreiz believes, would have been disastrous for the brand. Barbie is aspirational, inspirationalnot something you want turned into a parody, he said. Within two months of his appointment, control of Barbie had reverted to Mattel, and Kreiz had a meeting with Margot Robbie.\r\nRobbie, who played the scandal-prone skater Tonya Harding in I, Tonya, is attracted to roles that moviegoers already have strong feelings aboutpositive or negative. She told me, There are people who adore Barbie, people who hate Barbiebut the bottom line is everyone knows Barbie. She wanted a film adaptation to confront those sharp edges, but when she met with Kreiz she led with her desire to take the brand seriously. Two and a half hours later, they were in business together. Soon, Warner Bros. had expressed interest in financing the project.\r\nKreiz, meanwhile, hired a veteran of Miramax, Robbie Brenner, to head up the newly minted Mattel Films. Her first task: assemble a team of development executives to rummage through Mattels toy chest and identify I.P. that could be fodder for Hollywood studios. Mattel would help match properties with writers, actors, and directors; studios would provide all the funding. The brands, and audiences familiarity with them, were their own form of currency. Brenner told me, In the world were living in, I.P. is king. Pre-awareness is so important.\r\nAt the start of the Barbie process, Gerwig decided to write the screenplay with her partner, the writer-director Noah Baumbach. Mattel and Warner Bros. insisted on seeing a preview of the scripts contents. The couple balkedthey needed the freedom to experiment. Jeremy Barber, an agent at U.T.A. who represents Gerwig and Baumbach, is close with Brenner, so he could be blunt. Are you crazy? he told her. You shouldve come into this office and thanked me when Greta and Noah showed up to write a fucking Barbie movie! In the end, Gerwig presented executives with a poem in the style of the Apostles Creed. They agreed to take their chancesand, after the script came in, the budget was set at about a hundred million dollars.\r\nThe gamble now looks like a smart one. The hyper-saturated trailers for Barbie have sparked endless memes, and interest in the films aesthetic sensibility, which mimics the look of Mattel play sets, is so intense that the hashtag #Barbiecore trended on TikTok for months. The movie, which opens in mid-July, is tracking to be one of the blockbusters of the summer. Meanwhile, Mattel has amassed a long slate of other projects. Daniel Kaluuya, for example, has agreed to produce a feature about Barney, the purple dinosaur. Thirteen more films have been publicly announced, including movies about He-Man and Polly Pocket; forty-five are in development. (Some of the projects have an ouroboros quality. Tom Hanks is supposed to star in Major Matt Mason, which will be based on an astronaut action figure that has been largely forgotten, except for the fact that it helped inspire Buzz Lightyearone of the protagonists of Pixars Toy Story franchise.)\r\nBarber told me that Mattel had figured out how to engage with filmmakers in a friendly way. Gerwig, meanwhile, was looking to move beyond the small-scale dramas she was known for. Greta and I have been very consciously constructing a career, Barber explained. Her ambition is to be not the biggest woman director but a big studio director. And Barbie was a piece of I.P. that was resonant to her.\r\nYou guys like calamity and misfortune?\r\nShop\r\nAlthough Barber was pleased with the Barbie partnership, he was clear-eyed about its implications. Is it a great thing that our great creative actors and filmmakers live in a world where you can only take giant swings around consumer content and mass-produced products? he said. I dont know. But it is the business. So, if thats what people will consume, then lets make it more interesting, more complicated. He wondered aloud whether such directors as Hal Ashby and Sydney Pollack would be making movies with Mattel if they were alive today: Its a super-interesting question. Its also an argument that weve lost already.\r\nKreizs thesis that Mattel should become an I.P. factory wasnt revolutionary. Lego had created a series of hit animated films, andas Kreiz and other Mattel executives repeatedly noted to methe companys main rival, Hasbro, had turned a faded toy-robot line, Transformers, into a multibillion-dollar movie franchise. They made no mention of the catastrophe that followed. In 2008, a year after the release of Michael Bays Transformers, Hasbro struck a six-year deal with Universal, which secured the film rights to a grab bag of other toys and games, including Monopoly and Candy Land. The arrangement was mocked relentlessly in the presswould Russell Crowe land the role of Uncle Pennybags, the mustachioed man on the Chance cards? After Ridley Scott signed on to direct Monopoly, he told a reporter that it might center on a Donald Trump-type character, adding, Greed becomes, hopefully, hysterically funny. He also hinted that it might have a futuristic look, like his film Blade Runner. Vulture compiled Scotts tortured efforts to explain the project in an article with the subhead go directly to jail. Transformers lent themselves naturally to an action-movie treatment; board games did not. The only picture to emerge from the deal was Battleshipand everyone hated it. (The movie, dizzyingly nonsensical, featured an alien invasion.) In 2012, Universal reportedly paid millions to nullify the partnership, accepting a penalty from Hasbro and off-loading the rest of the I.P. it had acquired. Candy Land went to Sony, which tried unsuccessfully to turn it into a vehicle for Adam Sandler.\r\nAs the Vulture article put it, Its plenty of fun to imagine teams of screenwriters, locked away on major-studio lots, chugging coffee while grappling with how to graft plots onto stuff like the View-Master. A View-Master film, as it happens, is one of Mattels current projects. But in other respects the company has apparently learned from Hasbros misadventure, by partnering with a range of studios and enshrining a series of timed development gates in each contract. If the creative team that Mattel assembles doesnt deliver, and quickly, it can be disbanded, allowing the toymaker to move on.\r\nMore important, in the intervening years, the opportunities available to ambitious directors have narrowed further. The notion of a starry, C.G.I. Bambi reboot has gone from a joke on the HBO Max industry satire The Other Two to an actual movie that Sarah Polley is making in the wake of her Oscar-winning film Women Talking. During the pandemic, multiplexes collapsed. The future of moviegoing now seems increasingly tenuous, and studios have leaned on pre-awareness as a means of drawing people to theatres: a nostalgia play like Hot Wheels is seen as a safer bet than an original concept. The box office has borne this out: the ten highest-grossing films of 2022 were all reboots or sequels. Disneys much derided strategy of remaking Aladdin and other animated classics as live-action spectacles has largely paid off; by contrast, Pixars recent attempt at an original story, Elemental, bombed. On an earnings call last November, David Zaslav, the head of Warner Bros. Discovery, emphasized that a real focus of his was to revive the conglomerates most popular franchises. We havent done a Harry Potter movie in fifteen years, he said. (In fact, there have been six.) The mandate for audience recognition has pushed artists to take increasingly desperate measuresincluding scrounging up plotlines from popular snacks. Eva Longoria recently directed the Cheetos dramedy Flamin Hot; Jerry Seinfeld is at work on Unfrosted: The Pop-Tart Story.\r\nI.P.-based filmmaking has become so commonplace that Gerwigwho made her name acting in tiny mumblecore projectswas caught off guard by complaints that shed sold out. (One viral tweet: i know this is an unpopular opinion but i feel like . . . completely repelled by the barbie movie. branded content with a wink and movie stars is still branded content!) Gerwig told me that adapting Barbie felt as natural as adapting Little Women, though she did use a toy metaphor to describe the process: creating a story where there hadnt been a story felt like solving an intellectual Rubiks Cube. The audience has shifted along with the industry. Whereas Scotts Monopoly was shamed into nonexistence, advance screenings of Barbie, billed as blowout parties, are selling out. Nevertheless, the films sloganIf you love Barbie, this movie is for you. If you hate Barbie, this movie is for youis indicative of the tightrope it has to walk. Barbie is somehow simultaneously a critique of corporate feminism, a love letter to a doll that has been a lightning rod for more than half a century, and a sendup of the company that actively participated in the adaptation. Its a tall order, Robbie admitted. The dangerous thing about making something for everyone is that you ultimately make it for no one.\r\nBarbie débuted in 1959, with a behind-the-scenes assist from the film worldthe head of makeup at Universal was enlisted to tone down her heavy eyelashes and bee-stung lips, insuring that she had an all-American look. Her creator, the Mattel co-founder Ruth Handler, had her own Hollywood connection: shed once been a secretary at Paramount. Whereas other dolls of the era were babies or toddlers, Barbie invited fantasies of adulthood. Commercials encouraged girls to make believe that I am you, or to get both Barbie and Ken, and see where the romance will lead. Sales took off, and Mattel threw itself into the development of different Barbiessurfer girl, C.E.O.with each reboot designed to tap into a new cultural trend.\r\nBarbie was far from universally beloved. Some mothers found her anatomically impossible figure inappropriately sexual; others objected to her perfectly coiffed blond hair. Feminists argued that these qualities reinforced gendered stereotypes and unforgiving beauty standards. In the seventies, I am not a Barbie doll became a refrain of womens-rights protesters. Other people came to see Barbie as a tool for empowermenta proto-girl-boss.\r\nMattel, which now makes $1.5 billion annually from Barbie, is fiercely protective of the brand. Its legal team once went after a company that tried to sell Barbie-Que chips. In 1997, Mattel sued M.C.A. Records over the Aqua song Barbie Girl, a Euro-pop parody that included such lines as Im a blond bimbo girl in a fantasy world. A Ninth Circuit judge ruled against the toymaker, concluding, The parties are advised to chill.\r\nMattel itself sometimes reinforced the bimbo stereotype: in the nineties, a talking Barbie sparked backlash over its ditzy declaration that math class is tough. By the twenty-tens, the doll was reviled as an antiquated vision of femininityand sales were at their lowest point in a quarter century. Dickson, the C.O.O., presided over a radical about-face. Since 2016, after years of criticism for her improbably slender waist, Barbie has been sold in petite, tall, and curvy incarnations, and designers have continued to expand the options available in terms of race, ethnicity, and body type. By 2022, when Gerwigs movie was in production, Barbie was the best-selling fashion doll in the world.\r\nThough Dickson was excited to work with Gerwig, he was also nervous about damaging the brand. He went to London, where the film was largely shot, a half-dozen times, spending days on set and engaging in lengthy discussions about the highs and lows of the dolls history. Once, he flew in to hear dialogue from the script which worried him. Robbie told me that the conversation around the exchangein which her character is lambasted for hurting girls self-esteemwas about six hours long. It stayed in.",
        "sentiment_score": -0.3182,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Competitive Behavior",
        "company_name": "Universal Corporation",
        "company_id": 190283,
        "url": "https://www.newyorker.com/magazine/onward-and-upward-with-the-arts/07/10/after-barbie-mattel-is-raiding-its-entire-toy-box"
    },
    {
        "id": 62390446,
        "published_at": "2023-07-02T10:00:00Z",
        "title": "After “Barbie,” Mattel Is Raiding Its Entire Toy Box",
        "file_name": "2023-07-02_62390446.txt",
        "full_text": "In 2019, Greta Gerwig became the latest in a line of writers, directors, and producers to make a pilgrimage to a toy workshop in El Segundo, California. Touring the facility, the Mattel Design Center, has become a rite of passage for Hollywood types who are considering transforming one of the companys products into a moviea list that now includes such names as J. J. Abrams (Hot Wheels) and Vin Diesel (Rock Em Sock Em Robots). The building has hundreds of workspaces for artists, model-makers, and project managers, and it houses elaborate museum-style exhibitions that document the companys history and core products. These displays can help a toy designer find inspiration; they can also offer a brand immersiona crash course in a Mattel property slated for adaptation. When a V.I.P. visits, Richard Dickson, a tall, bespectacled man who is the companys chief operating officer, plays the role of Willy Wonka. Hell show off the sixty-five-year-old machines that are still used to affix fake hair to Barbies; hell invite you to inspect life-size, road-ready replicas of Hot Wheels cars. The center even boasts a giant rendering of Castle Grayskull, the fearsome ancestral home of He-Man. The brand immersion is the everything moment, Dickson told me. I have met with some of the greatest artists, truly, in the world. . . . And, if you dont walk out drinking the Kool-Aid, then it was a great playdate, but maybe we dont continue playing.\r\nThe actress Margot Robbie, who had toured the center in 2018, wanted to continue playing. Shed signed up for a Barbie movie, and had approached Gerwig about writing the script. She saw in Gerwigs filmography the right combination of intelligence and heart: You watch something like Little Women, and the dialogue is very, very cleverits talking about some big thingsbut its also extremely emotional. The project wasnt an obvious fit for someone whose screenplays included the subtle dramas Lady Bird and Frances Ha, and Gerwig wavered for more than a year. At one point, Dickson called her when she was mixing Little Women in New York. I dont have a ton of friends in corporate America, she told me, over Zoom. But he was very excited. It was sweet. She finally agreed to come to El Segundo.\r\nThe Design Center is divided into such sectors as Girls, Wheels, and Action Play, but Barbie is a realm unto itselfthe largest in the building. Its demarcated by a signature pink: Pantone 219 C. Gerwig was shown a display called the Barbie Wall of Fame, whose entryway was emblazoned with the brands mission statement: to inspire &amp; nurture the limitless potential in every girl. Framed photographs captured Barbie posing with everyone from Diahann Carroll to Dean Martin, but Gerwig was most struck by a series of shots of historical models, including an all-Barbie Presidential ticket, from 1992. Oh, wow, Gerwig said. Weve had a Barbie President, I see. A Mattel employee proudly replied that Barbie had been to space before most earthly women had a credit card.\r\nAs Gerwig peppered Dickson with questions, a concept began to take shape. Barbie could be a meta-comedy that moved between the idealized, plastic realm of the dolls and the human world of the company that had created them. Just like the Design Center exhibition, the film could bring together Barbies from across the decades: Robbie could be one of many.\r\nGerwig would go on to write and direct Barbie, and her brand immersion left some visual imprints. The colorful conference room where she and Dickson chatted after her tour informed the look of the fictional Mattels inner sanctum. It was a combination of, like, Oh, this is a corporation, and its all very official and Its bright pink,  Gerwig told me. I thought, This is so cinematic. (In the film, Mattel execs huddle in a Dr. Strangelove-style war roomwith a heart-shaped table.)\r\nI met Dickson at the Design Center last November. At the start of my visit, he suggested that we race miniature Hot Wheels cars on a sloping, multistory orange track with six successive loop-the-loops. Both our cars got marooned on it. Dickson was embarrassed by the unsatisfactory play experience, but he rebounded as he guided me along a wall-mounted time line that juxtaposed major political and cultural events with seminal Mattel releases. (The year 1961 was marked by both the Bay of Pigs invasion and the creation of Ken, Barbies boyfriend.) The display, he explained, served as a reminder to Mattel designers to aim for relevance. As the cultural conception of womens roles had changed, so had Barbie: stewardess outfits had been supplanted by lab coats and plastic safety goggles. When our toys connect to whats happening in the world, you see significant growth in the company, he said. When we dont, you see a blip. What you start to realize is: This is a pop-culture company.\r\nWhen the Israeli-born businessman Ynon Kreiz became the head of Mattel, in 2018, he was its fourth C.E.O. in four years. Toys R Us had recently gone bankrupt, causing a slump in sales; Kreizs predecessor had resigned after Mattel suffered a loss of three hundred million dollars. Kreiz, whose résumé includes a stint at Fox Kids Europe, saw an opportunity for growth. Mattel, he argued, had a childrens-entertainment catalogue second only to Disney. Just as Marvel had gone from ailing comic-book publisher to Hollywood behemoth, the toymaker could leverage its intellectual property at the multiplex. Kreiz told me, My thesis was that we needed to transition from being a toy-manufacturing company, making items, to an I.P. company, managing franchises.\r\nBefore Kreiz took over, Mattel had licensed its flagship properties to an array of studios, and he was intent on reclaiming the rights to Barbie from Sony, where a satirical take on the doll had long been in the works, cycling through such stars as Anne Hathaway and Amy Schumer. A film that ridiculed Barbie, Kreiz believes, would have been disastrous for the brand. Barbie is aspirational, inspirationalnot something you want turned into a parody, he said. Within two months of his appointment, control of Barbie had reverted to Mattel, and Kreiz had a meeting with Margot Robbie.\r\nRobbie, who played the scandal-prone skater Tonya Harding in I, Tonya, is attracted to roles that moviegoers already have strong feelings aboutpositive or negative. She told me, There are people who adore Barbie, people who hate Barbiebut the bottom line is everyone knows Barbie. She wanted a film adaptation to confront those sharp edges, but when she met with Kreiz she led with her desire to take the brand seriously. Two and a half hours later, they were in business together. Soon, Warner Bros. had expressed interest in financing the project.\r\nKreiz, meanwhile, hired a veteran of Miramax, Robbie Brenner, to head up the newly minted Mattel Films. Her first task: assemble a team of development executives to rummage through Mattels toy chest and identify I.P. that could be fodder for Hollywood studios. Mattel would help match properties with writers, actors, and directors; studios would provide all the funding. The brands, and audiences familiarity with them, were their own form of currency. Brenner told me, In the world were living in, I.P. is king. Pre-awareness is so important.\r\nAt the start of the Barbie process, Gerwig decided to write the screenplay with her partner, the writer-director Noah Baumbach. Mattel and Warner Bros. insisted on seeing a preview of the scripts contents. The couple balkedthey needed the freedom to experiment. Jeremy Barber, an agent at U.T.A. who represents Gerwig and Baumbach, is close with Brenner, so he could be blunt. Are you crazy? he told her. You shouldve come into this office and thanked me when Greta and Noah showed up to write a fucking Barbie movie! In the end, Gerwig presented executives with a poem in the style of the Apostles Creed. They agreed to take their chancesand, after the script came in, the budget was set at about a hundred million dollars.\r\nThe gamble now looks like a smart one. The hyper-saturated trailers for Barbie have sparked endless memes, and interest in the films aesthetic sensibility, which mimics the look of Mattel play sets, is so intense that the hashtag #Barbiecore trended on TikTok for months. The movie, which opens in mid-July, is tracking to be one of the blockbusters of the summer. Meanwhile, Mattel has amassed a long slate of other projects. Daniel Kaluuya, for example, has agreed to produce a feature about Barney, the purple dinosaur. Thirteen more films have been publicly announced, including movies about He-Man and Polly Pocket; forty-five are in development. (Some of the projects have an ouroboros quality. Tom Hanks is supposed to star in Major Matt Mason, which will be based on an astronaut action figure that has been largely forgotten, except for the fact that it helped inspire Buzz Lightyearone of the protagonists of Pixars Toy Story franchise.)\r\nBarber told me that Mattel had figured out how to engage with filmmakers in a friendly way. Gerwig, meanwhile, was looking to move beyond the small-scale dramas she was known for. Greta and I have been very consciously constructing a career, Barber explained. Her ambition is to be not the biggest woman director but a big studio director. And Barbie was a piece of I.P. that was resonant to her.\r\nYou guys like calamity and misfortune?\r\nShop\r\nAlthough Barber was pleased with the Barbie partnership, he was clear-eyed about its implications. Is it a great thing that our great creative actors and filmmakers live in a world where you can only take giant swings around consumer content and mass-produced products? he said. I dont know. But it is the business. So, if thats what people will consume, then lets make it more interesting, more complicated. He wondered aloud whether such directors as Hal Ashby and Sydney Pollack would be making movies with Mattel if they were alive today: Its a super-interesting question. Its also an argument that weve lost already.\r\nKreizs thesis that Mattel should become an I.P. factory wasnt revolutionary. Lego had created a series of hit animated films, andas Kreiz and other Mattel executives repeatedly noted to methe companys main rival, Hasbro, had turned a faded toy-robot line, Transformers, into a multibillion-dollar movie franchise. They made no mention of the catastrophe that followed. In 2008, a year after the release of Michael Bays Transformers, Hasbro struck a six-year deal with Universal, which secured the film rights to a grab bag of other toys and games, including Monopoly and Candy Land. The arrangement was mocked relentlessly in the presswould Russell Crowe land the role of Uncle Pennybags, the mustachioed man on the Chance cards? After Ridley Scott signed on to direct Monopoly, he told a reporter that it might center on a Donald Trump-type character, adding, Greed becomes, hopefully, hysterically funny. He also hinted that it might have a futuristic look, like his film Blade Runner. Vulture compiled Scotts tortured efforts to explain the project in an article with the subhead go directly to jail. Transformers lent themselves naturally to an action-movie treatment; board games did not. The only picture to emerge from the deal was Battleshipand everyone hated it. (The movie, dizzyingly nonsensical, featured an alien invasion.) In 2012, Universal reportedly paid millions to nullify the partnership, accepting a penalty from Hasbro and off-loading the rest of the I.P. it had acquired. Candy Land went to Sony, which tried unsuccessfully to turn it into a vehicle for Adam Sandler.\r\nAs the Vulture article put it, Its plenty of fun to imagine teams of screenwriters, locked away on major-studio lots, chugging coffee while grappling with how to graft plots onto stuff like the View-Master. A View-Master film, as it happens, is one of Mattels current projects. But in other respects the company has apparently learned from Hasbros misadventure, by partnering with a range of studios and enshrining a series of timed development gates in each contract. If the creative team that Mattel assembles doesnt deliver, and quickly, it can be disbanded, allowing the toymaker to move on.\r\nMore important, in the intervening years, the opportunities available to ambitious directors have narrowed further. The notion of a starry, C.G.I. Bambi reboot has gone from a joke on the HBO Max industry satire The Other Two to an actual movie that Sarah Polley is making in the wake of her Oscar-winning film Women Talking. During the pandemic, multiplexes collapsed. The future of moviegoing now seems increasingly tenuous, and studios have leaned on pre-awareness as a means of drawing people to theatres: a nostalgia play like Hot Wheels is seen as a safer bet than an original concept. The box office has borne this out: the ten highest-grossing films of 2022 were all reboots or sequels. Disneys much derided strategy of remaking Aladdin and other animated classics as live-action spectacles has largely paid off; by contrast, Pixars recent attempt at an original story, Elemental, bombed. On an earnings call last November, David Zaslav, the head of Warner Bros. Discovery, emphasized that a real focus of his was to revive the conglomerates most popular franchises. We havent done a Harry Potter movie in fifteen years, he said. (In fact, there have been six.) The mandate for audience recognition has pushed artists to take increasingly desperate measuresincluding scrounging up plotlines from popular snacks. Eva Longoria recently directed the Cheetos dramedy Flamin Hot; Jerry Seinfeld is at work on Unfrosted: The Pop-Tart Story.\r\nI.P.-based filmmaking has become so commonplace that Gerwigwho made her name acting in tiny mumblecore projectswas caught off guard by complaints that shed sold out. (One viral tweet: i know this is an unpopular opinion but i feel like . . . completely repelled by the barbie movie. branded content with a wink and movie stars is still branded content!) Gerwig told me that adapting Barbie felt as natural as adapting Little Women, though she did use a toy metaphor to describe the process: creating a story where there hadnt been a story felt like solving an intellectual Rubiks Cube. The audience has shifted along with the industry. Whereas Scotts Monopoly was shamed into nonexistence, advance screenings of Barbie, billed as blowout parties, are selling out. Nevertheless, the films sloganIf you love Barbie, this movie is for you. If you hate Barbie, this movie is for youis indicative of the tightrope it has to walk. Barbie is somehow simultaneously a critique of corporate feminism, a love letter to a doll that has been a lightning rod for more than half a century, and a sendup of the company that actively participated in the adaptation. Its a tall order, Robbie admitted. The dangerous thing about making something for everyone is that you ultimately make it for no one.\r\nBarbie débuted in 1959, with a behind-the-scenes assist from the film worldthe head of makeup at Universal was enlisted to tone down her heavy eyelashes and bee-stung lips, insuring that she had an all-American look. Her creator, the Mattel co-founder Ruth Handler, had her own Hollywood connection: shed once been a secretary at Paramount. Whereas other dolls of the era were babies or toddlers, Barbie invited fantasies of adulthood. Commercials encouraged girls to make believe that I am you, or to get both Barbie and Ken, and see where the romance will lead. Sales took off, and Mattel threw itself into the development of different Barbiessurfer girl, C.E.O.with each reboot designed to tap into a new cultural trend.\r\nBarbie was far from universally beloved. Some mothers found her anatomically impossible figure inappropriately sexual; others objected to her perfectly coiffed blond hair. Feminists argued that these qualities reinforced gendered stereotypes and unforgiving beauty standards. In the seventies, I am not a Barbie doll became a refrain of womens-rights protesters. Other people came to see Barbie as a tool for empowermenta proto-girl-boss.\r\nMattel, which now makes $1.5 billion annually from Barbie, is fiercely protective of the brand. Its legal team once went after a company that tried to sell Barbie-Que chips. In 1997, Mattel sued M.C.A. Records over the Aqua song Barbie Girl, a Euro-pop parody that included such lines as Im a blond bimbo girl in a fantasy world. A Ninth Circuit judge ruled against the toymaker, concluding, The parties are advised to chill.\r\nMattel itself sometimes reinforced the bimbo stereotype: in the nineties, a talking Barbie sparked backlash over its ditzy declaration that math class is tough. By the twenty-tens, the doll was reviled as an antiquated vision of femininityand sales were at their lowest point in a quarter century. Dickson, the C.O.O., presided over a radical about-face. Since 2016, after years of criticism for her improbably slender waist, Barbie has been sold in petite, tall, and curvy incarnations, and designers have continued to expand the options available in terms of race, ethnicity, and body type. By 2022, when Gerwigs movie was in production, Barbie was the best-selling fashion doll in the world.\r\nThough Dickson was excited to work with Gerwig, he was also nervous about damaging the brand. He went to London, where the film was largely shot, a half-dozen times, spending days on set and engaging in lengthy discussions about the highs and lows of the dolls history. Once, he flew in to hear dialogue from the script which worried him. Robbie told me that the conversation around the exchangein which her character is lambasted for hurting girls self-esteemwas about six hours long. It stayed in.",
        "sentiment_score": -0.3182,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Competitive Behavior",
        "company_name": "Universal Corporation",
        "company_id": 190283,
        "url": "https://www.newyorker.com/magazine/2023/07/10/after-barbie-mattel-is-raiding-its-entire-toy-box"
    },
    {
        "id": 62390342,
        "published_at": "2023-07-02T09:28:00Z",
        "title": "Inside Tesla's 18-wheeler Semi, which can travel 500 miles on one charge",
        "file_name": "2023-07-02_62390342.txt",
        "full_text": "Tesla first announced its 18-wheeler semi truck in 2017, and made its first Semi delivery five years later to Pepsi after several 18-wheeler production delays.\r\nOfficially named the Tesla Semi, it's the EV maker's first offering beyond passenger vehicles. \"If you're a trucker and you want the most badass rig on the road, this is it,\" Elon Musk said last December.\r\nThere are two versions which, while fully loaded to an 87,000 lbs capacity, have maximum ranges of either 300 or 500 miles.\r\nWhile there are already some Tesla Semis on the roads, its pricing is unclear.\r\nIn 2017, Tesla said the shorter-range electric vehicle cost would be $150,000 and the 500-mile Semi would cost $180,000. \r\nThe sleek interior design features one central seat with two 15-inch screens to the left and right of the steering wheel.\r\nAs well as providing information about the truck's speed and battery level, they display a nearly 360-degree view thanks to four cameras that help the driver avoid blind spots.\r\nThe Tesla Semi's interior.\r\nCourtesy of Tesla, Inc.\r\nThe semi doesn't come with a sleeper cab because it's designed for day trips. Tesla said it could be charged up to 70% in 30 minutes. That could bring huge benefits for companies wanting to reduce their carbon footprint.\r\nAnheuser-Busch, Walmart, and UPS are among the other big companies that have ordered the vehicle.\r\nTesla Semi's recharging at the Frito-Lay production facility.\r\nAndy Alfaro/The Modesto Bee/Tribune News Service via Getty Images\r\nTesla Semis branded with the Frito-Lay logo have been spotted on the roads around the facility, but several of these had apparently broken down. \r\nThen in March, Tesla recalled 35 of its Semis because of a risk that its parking brake could fail and cause the truck to roll away.\r\nMusk said in a 2018 Tesla earnings call that about 2,000 Tesla Semis had been reserved, but it's unclear how many have been ordered so far.\r\n\"We haven't really tried to sell the Semi. It's not like there's like an ongoing sales effort,\" the Tesla CEO added. \"Orders for Semi are like opportunistic, really companies approaching us.\"\r\nBut there are still big expectations because the company is aiming for 50,000 Tesla Semis in North America by 2024, Musk said in a 2022 earnings call.",
        "sentiment_score": -0.8402,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Product Quality & Safety",
        "company_name": "Tesla, Inc",
        "company_id": 190112,
        "url": "https://www.businessinsider.com/tesla-18-wheeler-semi"
    },
    {
        "id": 62390546,
        "published_at": "2023-07-02T09:26:18Z",
        "title": "Domestic automakers accelerate employment of women in shop floors",
        "file_name": "2023-07-02_62390546.txt",
        "full_text": "Homegrown automakers Tata Motors, Mahindra &amp; Mahindra, Ashok Leyland and Hero MotoCorp are accelerating the drive to employ more women in shop floors as they press hard on the pedal to enhance diversity.\r\nOnce outsiders but no longer, thousands of women are now rolling out from two-wheelers to popular SUVs and heavy commercial vehicles across different factories of these companies.\r\nTata Motors has over 4,500 women working in the shop floors across six manufacturing plants, including an all-women line at its Pune facility with over 1,500 of them producing popular SUVs such as Harrier and Safari.\r\n\"We are an equal opportunity employer and believe a gender-balanced workforce leads to increased productivity, better decisions, enhanced collaboration, and more innovative ideas. Our focus is on enhancing diversity, especially on the shop floor and 25 per cent of all our new recruits are women,\" Tata Motors Chief Human Resources Officer (CHRO) Ravindra Kumar GP told PTI.\r\nHe further said, \"Today, over 4,500 women are actively engaged on the shop floors of our various plants. They exercise a wide range of functional capabilities on multiple products, from small passenger cars to heavy commercial vehicles.\"\r\nAnother homegrown automaker Mahindra &amp; Mahindra (M&amp;M) has seen the number of women as its employees at manufacturing plants grow by three times over last year to 1,202 at present, involved in core activities ranging from welding to robotics loading, vehicle assembly and machine shop, among others.\r\nAccording to M&amp;M CHRO, Auto &amp; Farm Sector Rajeshwar Tripathi, the company hires from over 25 Industrial Training Institutes (ITIs), some of which are women-only ITIs.\r\n\"Our annual intake is in the excess of 1,200. We have adopted about eight ITIs in tribal areas, from where our intake is very regular,\" he said, adding, M&amp;M too strongly believes that a diverse team is far more productive, the work culture is far better and such teams are more creative and more innovative.\r\nWhen asked about the challenges in more women entering into automobile manufacturing, he said it is as much internal within the company as it is social.\r\nAlthough the company has worked to put in place the basics such as policies and physical infrastructure, the external factor of social and family pressure can be a hindrance in getting more women to work in the shop floors.\r\nThe social and family pressure on women not to take up manufacturing as a career is quite significant and it can play a significant role if not addressed adequately, Tripathi asserted.\r\nAt commercial vehicle maker Ashok Leyland, 991 women work at its seven different manufacturing plants. At the company's Hosur plant, an all-women assembly line comprising nearly 120 of them is engaged in the assembly of engines for light commercial vehicles producing 120 engines per shift in a day.\r\nAshok Leyland President &amp; Chief of Operations Ganesh Mani said the company has always been propagating that any job need not be gender specific.\r\nCiting the example of the company's Pantnagar plant, where women executives who take part in truck assembly, could take leadership positions much earlier after working for nearly one to two years, he said it inspired the company to contemplate an all-women engine assembly line.\r\n\"If they (women) can make trucks why not we go for (an all-women) engine assembly line,\" Mani said, adding, \"Our new tag line is 'Koi manzil door nahin', which means no dreams too far for anyone. Keeping that in view we thought that we should be a starting point that an all-women line should be that.\"\r\nWomen empowerment is also witnessed at the world's largest two-wheeler maker Hero MotoCorp, which has over 1,500 women employees.\r\nThe concept of women technicians and engineers in the automobile industry which seemed like a distant dream is now a reality. Women are now not only finding their feet in the shop floors but they are running the show at the factories, thanks to these Indian automobile manufacturers.\r\n(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)",
        "sentiment_score": 0.802,
        "sentiment_rank": "positive",
        "tagged_sent_topics": "Employee Engagement, Diversity & Inclusion",
        "company_name": "Mahindra & Mahindra Limited",
        "company_id": 213758,
        "url": "https://www.business-standard.com/industry/auto/domestic-automakers-accelerate-employment-of-women-in-shop-floors-123070200194_1.html"
    },
    {
        "id": 62390376,
        "published_at": "2023-07-02T09:05:48Z",
        "title": "TipRanks ‘Perfect 10’ List: These 2 Top-Rated Stocks Tick All the Boxes",
        "file_name": "2023-07-02_62390376.txt",
        "full_text": "The key to earning in the stock market is to find an equity that shows the right profile based on a mix of attributes that will predict success. Finding them can be tough, especially given the sheer volume of data generated by the market. With thousands of stocks, hundreds of thousands of traders, and a legion of Wall Street analysts all putting their own sometimes contradictory views into the ring, getting down to brass tacks is no easy task.\r\nThats where the TipRanks Smart Score can become a traders best friend. The Smart Score is a data sifting and collating tool, based on a proprietary algorithm that measures every stock against a series of factors, 8 in all, that have been correlated with market gains. The factors are taken together and distilled into a single score on a 1 to 10 scale, giving every stock a simple, single-digit score that points toward the stocks general health and potential performance.\r\nWe can take a look under the hood of the Smart Score system to pull up the details on two stocks that have ticked all the boxes and earned the Perfect 10 score. Here they are, presented along with comments from the Streets analysts. Lets see why theyve earned their accolades.\r\nCorteva, Inc.(CTVA)\r\nThe first stock on our list is Corteva, an agricultural company that spun off from the chemical firm DowDuPont in 2019, taking the venerable parent firms agricultural segment public as an independent entity. Today, Corteva produces seeds and agricultural chemicals, products that can help farmers increase their acre-productivity and overall agricultural output. The companys product line features the fungicides, herbicides, and insecticides necessary to protect crops, along with high-performance seeds, under the brand names Pioneer and Brevant, to maximize output.\r\nCorteva is a pure-play agriculture firm, working in a sector that is absolutely essential, and numbers back that up. The company boasts more than 10 million customers across 140 countries, and generated $17.46 billion in total sales last year. The companys shareholders were major beneficiaries of that success, as the company generated some $1.4 billion in total returns to shareholders for 2022.\r\nThe companys success continued into the first quarter of this year. The 1Q23 financial results showed a top line of $4.88 billion, $143 million above expectations and a 6% improvement from the prior-year Q1 revenue. At the bottom line, quarterly earnings came in at $1.16 per share by non-GAAP measures, for a 20% y/y gain and a beat of 23 cents per share compared to the forecasts.\r\nAmong the bulls is Canaccord analyst Bobby Burleson who notes the companys strong position in its core seed and agrichemical businesses. He sees high potential for the firm going forward and writes of Corteva, We see the companys seed trait technology and expanding biological crop protection and nutrition portfolio supporting strong revenue and profitability growth, while helping enable agricultures transition to sustainable production methods. Our outlook for healthy EBITDA growth through 2024 (12% CAGR 22-24E) justifies a valuation premium for Corteva\r\nThese comments back up Burlesons Buy rating on the stock, and his $75 price target implies upside potential of 31% for the year ahead. (To watch Burlesons track record, click here)\r\nThe Strong Buy consensus rating on CTVA is based on 13 recent analyst reviews, including 11 Buys and 2 Holds. The shares are priced at $57.30, with an average price target of $72.83 suggesting a 27% gain heading out to the one-year horizon. (See CTVA stock forecast)\r\nAmbrx Biopharma(AMAM)\r\nThe second stock well look is a clinical stage biopharmaceutical company, Ambrx. This firm is researching new treatments for dangerous cancers, including breast cancer and prostate cancer. The company uses an expanded genetic code technology platform in its development efforts, and its pipeline is currently focused on antibody drug conjugates (ADCs), a class of engineered therapies designed to attack specific cancers while sparing healthy cells.\r\nAmbrx has an active research pipeline, with two proprietary drug candidates currently in the research clinic, and two additional candidates under investigation through partner programs. On the clinical side, the company has in recent months reported positive results from a mid-stage trial; just last December, the stock leaped over 1000% after announcement of positive data from the phase 2 study of ARX788 in the treatment of metastatic breast cancer. These are the signs that investors look for, in pre-revenue biopharma companies.\r\nARX788, an anti-HER2 ADC, is currently under investigation in the treatment of breast cancer, gastric/GEJ cancer and other solid tumors. Earlier this year, the company announced that in a Phase 3 study in the treatment of HER2+ metastatic breast cancer (conducted by partner, NovoCodex Biopharmaceuticals), interim analysis showed the drug had met the primary efficacy endpoint, displaying clinically significant survival benefits when compared to the control group.\r\nARX517, the companys second leading candidate, is a prostate-specific ADC, and the subject of Phase 1 testing. Results announced this year have indicated that ARX517 is also showing statistically significant activity, in this case causing important decreases in PSA levels in patients with advance prostate cancer.\r\nCovering this stock for B. Riley Financial, analyst Yuan Zhi is impressed by Ambrxs leading pipeline tracks. The analyst points out near-term catalysts for each, and writes, [We] believe there is an increasing market opportunity for ARX517 in mCRPC with and without prior Pluvicto treatment and for ARX788 in HER2+ mBC after Enhertu. We recommend investors build positions ahead of the anticipated clinical updates of ARX517 at ESMO23 (in October) and ARX788 at SABCS23 (in December). Following what we believe to be likely positive data readouts from the oncology platform, we would anticipate value appreciation of other early-stage assets in AMAMs pipeline via partnerships with significant up-front payments.\r\nIn Zhis view, this adds up to a Buy rating, and a $26 price target that suggests a one-year potential upside of 58% for the stock. (To watch Zhis track record, click here)\r\nAmbrx only has 5 recent analyst reviews on file, but they break down 4 to 1 in favor of Buy over Hold and give the shares a Strong Buy consensus rating. The average price target of $26.75 implies 12-month share appreciation of 62% from the current trading price of $16.46. (See Ambrx stock forecast)\r\nTo find good ideas for stocks trading at attractive valuations, visit TipRanks Best Stocks to Buy, a tool that unites all of TipRanks equity insights.\r\nDisclaimer: The opinions expressed in this article are solely those of the featured analysts. The content is intended to be used for informational purposes only. It is very important to do your own analysis before making any investment.",
        "sentiment_score": 0.6126499999999999,
        "sentiment_rank": "positive",
        "tagged_sent_topics": "Water & Wastewater Management || Customer Welfare || Business Model Resilience",
        "company_name": "Corteva, Inc",
        "company_id": 205329,
        "url": "https://finance.yahoo.com/news/tipranks-perfect-10-list-2-090548322.html"
    },
    {
        "id": 62390435,
        "published_at": "2023-07-02T09:00:00Z",
        "title": "Cape Breton municipality starts program to inform seniors in social setting",
        "file_name": "2023-07-02_62390435.txt",
        "full_text": "A program launched by the Municipality of the County of Inverness called the Age Well Academy is aimed at bringing seniors together while giving them information to make their lives easier.\r\nThe pandemic slowed the initiative, which is providing information sessions around everyday issues affecting seniors.\r\nPresenters include a water conservation specialist, Nova Scotia Continuing Care, Caregivers Nova Scotia, the RCMP, Alzheimer's Society of Nova Scotia and Sort-it-out Waste Services.\r\nThere are 13 presentations on the schedule that will run until November.\r\nThe program has been assisted by some federal funding.\r\n\"So we're very excited to be able to go out to the various communities throughout Inverness County to bring information to our senior groups,\" said municipal CAO Keith MacDonald.\r\nBeth Bennett of the Alzheimer's Society Of Nova Scotia said she looks forward to providing more information to people at meetings in the future.\r\n\"We were able to go and do a presentation on brain health and dementia,\" said Bennett. \"And so we talked a little bit about what dementia is and how you can reduce your risk and practise better brain health at any age.\"\r\nThere are many organizations involved, who volunteer their time to spread knowledge to seniors in the community, who take the time to go to these events.\r\nThere is a wide range of topics in every seminar, from a lot of different voices.\r\nAt least two sessions will be held in each electoral district.\r\nTopics include continuing care, waste services, water operations, recreation and wellness, food insecurity and social isolation.\r\nThe schedule for upcoming sessions will be made available at the municipality's website.",
        "sentiment_score": 0.1027,
        "sentiment_rank": "positive",
        "tagged_sent_topics": "Ecological Impacts",
        "company_name": "Waste Services",
        "company_id": 248281,
        "url": "https://www.cbc.ca/news/canada/nova-scotia/cape-breton-seniors-learning-inverness-1.6893494"
    },
    {
        "id": 62390407,
        "published_at": "2023-07-02T08:00:00Z",
        "title": "Why putting down the phone and enjoying the summer is harder than you think",
        "file_name": "2023-07-02_62390407.txt",
        "full_text": "Most anyone who owns a smartphone knows the feeling: You pick it up to check the weather  then you see a news headline pop up. Then a recipe. Then a notification from a friend on social media.\r\nBefore you know it, you've been on the phone for an hour or more, swiping and scrolling through an endless river of posts, videos and advertisements.\r\nAs the summer months roll along, you might feel powerless to tear your eyes and thumbs from the phone and actually get outside to enjoy the weather.\r\nBut it's not your fault, experts say, because the companies that design our devices are intentionally working to make them addictive.\r\n\"We don't realize it, because the designs that tech companies have made to keep us online longer are invisible to us,\" said Gaia Bernstein, a technology, privacy and policy professor at Seton Hall Law School in Newark, N.J., and author of Unwired: Gaining Control Over Addictive Technologies.\r\n\"They also want to make sure that we think it's our responsibility. And that's a very old trick that corporate industries have used for many years.\"\r\nInfinite scrolls, infinite content\r\nBernstein, in an interview with Spark's Nora Young, cited a number of features and tricks meant to keep us glued to our phones that by now have become ubiquitous, no matter what phone or social network app we use.\r\nInfinite scrolling, for example, ensures that there's no end or \"next page\" button after browsing a certain number of stories or videos. Whether on YouTube, Netflix or TikTok, a new video automatically plays as soon as you finish the previous one unless you manually turn off the option.\r\nAccording to Bernstein, Snapchat is home to \"the most vile feature of all of them\": streaks.\r\nUsers build streaks when mutual friends on the app exchange messages every day. The more consecutive Snaps they send, the higher their streak count climbs. Visual and audio cues such as a flame icon appear as you build a higher streak but skipping a day brings your streak count back to zero.\r\nThe concept isn't unfamiliar if you've played any number of mobile games with friendship networks, such as Pokémon Go. But streaks have become so popular that in March, Snapchat introduced a way for U.S. users to restore a lost streak\r\n. The first \"Streak Restore\" is free, but subsequent uses cost 99 cents US.\r\nBernstein said the feature, introduced in 2015, is more about revenue than user engagement. \"The whole idea is to get people on Snapchat so they will see the advertising,\" she said.\r\nIn 2019, the U.K.'s privacy regulator drafted a code of conduct that proposed penalties on companies that promoted \"nudge\" techniques, such as Snapchat streaks or Facebook \"likes,\" to minors.\r\n\"We've designed streaks thoughtfully so they're a positive experience for our community,\" Snap Inc., said in an emailed statement. \"There are no nudging notifications, public-facing incentives or in-app reminders to maintain a streak, and all Snapchatters have the ability to restore a streak if it lapses.\"\r\nThe company added that \"in recent years,\" it made streak emoji graphics \"less prominent\" than before. It also touted a new ability to \"freeze\" streaks when users \"want to go off the grid,\" which is limited to users who pay for its premium Snapchat+ service.\r\nPhones are 'engineered to be addictive'\r\nDr. Anna Lembke, a psychiatry professor at California's Stanford University and author of Dopamine Nation: Finding Balance in the Age of Indulgence, said phones \"are engineered to be addictive\" roping users into a \"compulsive state of overconsumption and, in some cases, outright addiction.\"\r\nFlashy graphic and musical flourishes reward us for continued use, not unlike a slot machine on a crowded casino floor. And push notifications, often accompanied by a ring and vibration, grab your attention even if you're not actively using your phone.\r\nLembke said people often start overusing an app or device for many of the same reasons they might use a drug.\r\n\"That problem can range anywhere from boredom, isolation to depression, insomnia, inattention and everything in between,\" she explained.\r\nWe can be compelled to keep using our devices even if we don't like the news, videos or other content we're seeing a phenomenon known as \"doomscrolling.\"\r\n\"What ends up happening is you get sucked into negative news updates and ... armchair analysis of current news events, particularly negative events, because they are so pervasive now,\" said journalist Karen K. Ho, who helped popularize the term.\r\nLembke said there's a \"general consensus\" among health-care providers that people can be addicted to technology; however it's not currently included in the Diagnostic and Statistical Manual of Mental Disorders.\r\nBernstein said video-gaming addiction is the only type of tech addiction that's formally recognized by the World Health Organization as of 2018.\r\nDespite how often people talk about being addicted to tech, she said, it's usually more accurate to say we're overusing it.\r\nSome legal steps are being taken to tackle technology overuse, particularly for children and students, but it remains to be seen how or whether they will be effective.\r\nSeattle's public school district filed a lawsuit in January\r\n against TikTok, Facebook, YouTube and Snapchat in an attempt to hold them accountable for a decline in youths' mental health.\r\nIn Canada, some schools are experimenting with banning phones in the classroom\r\n, though debate continues on whether it will help or harm students' mental health.\r\nAnd a proposed class-action lawsuit led by a parent in British Columbia\r\n alleges that Epic Games, the maker of Fortnite, designed the video game to be \"as addictive as possible\" for children although it's not exclusively available on mobile devices.\r\nDo screen time trackers help?\r\nMajor device manufacturers now include apps that can track and set hard limits on how much you use your phone or certain apps. On Apple's iPhones, it's called Screen Time; Google Android phones call it Digital Wellbeing.\r\nBernstein said she doubts these tools are very useful for weaning people off of devices that were designed to encourage compulsive use in the first place.\r\n\"Instead of giving self-help measures, I have to think about how we can solve this collectively by exerting pressures on technology companies to redesign [the devices] ... and not hope that people can help themselves. Because they can't,\" she said.\r\nShe pointed to a 2020 column by Android Central writer Daniel Bader\r\n, who found the Digital Wellbeing app \"hasn't really stopped my scrolling it's just sapped the fun out of it.\"\r\nIn an email to CBC, Apple pointed to its Focus app, which includes options to put notifications to sleep, and to its parental controls settings on iPhones, as additional tools beyond Screen Time.\r\nHow to stop the summer of scroll\r\nGiven the myriad ways tech is designed to keep us online for as long as possible, one can be forgiven for wondering what we can do to help us separate from our smartphones long enough to enjoy the sunny and short Canadian summer.\r\nLembke suggests starting small with a \"24-hour digital fast\" and if you're spending a weekend at the cottage or visiting the park with friends or family, everyone can do it together.\r\n\"Just even pay attention to the number of times you think about your phone and want to touch it, because that alone can be a wake-up call for a lot of people,\" she said.\r\nAmerican psychologist and author Jean Twenge, whose 2017 book iGen interrogated how tech affects Generation Z (people born roughly between 1995 and 2012), advised parents to \"put off giving your child a full-blown smartphone as long as possible.\"\r\nShe told The Sunday Magazine's David Common that there are lots of options for teen and preteen kids, like flip phones or other phones with only basic text and calling functions, without support for the apps that drain away our time.\r\nBernstein said it will likely take a while before government and legal actions dramatically shape our screen time habits. But in the meantime, small things may help \"bridge the gap\" such as deleting the one app you use the most from your phone.\r\n\"I think we need to do everything we can to try to change norms in little ways, until things change more socially.\"",
        "sentiment_score": -0.4939,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Customer Privacy",
        "company_name": "Facebook, Inc",
        "company_id": 190623,
        "url": "https://www.cbc.ca/radio/spark/summer-scrolling-smartphones-unplugged-1.6871589"
    },
    {
        "id": 62390404,
        "published_at": "2023-07-02T08:00:00Z",
        "title": "Why putting down the phone and enjoying the summer is harder than you think",
        "file_name": "2023-07-02_62390404.txt",
        "full_text": "Most anyone who owns a smartphone knows the feeling: You pick it up to check the weather  then you see a news headline pop up. Then a recipe. Then a notification from a friend on social media.\r\nBefore you know it, you've been on the phone for an hour or more, swiping and scrolling through an endless river of posts, videos and advertisements.\r\nAs the summer months roll along, you might feel powerless to tear your eyes and thumbs from the phone and actually get outside to enjoy the weather.\r\nBut it's not your fault, experts say, because the companies that design our devices are intentionally working to make them addictive.\r\n\"We don't realize it, because the designs that tech companies have made to keep us online longer are invisible to us,\" said Gaia Bernstein, a technology, privacy and policy professor at Seton Hall Law School in Newark, N.J., and author of Unwired: Gaining Control Over Addictive Technologies.\r\n\"They also want to make sure that we think it's our responsibility. And that's a very old trick that corporate industries have used for many years.\"\r\nInfinite scrolls, infinite content\r\nBernstein, in an interview with Spark's Nora Young, cited a number of features and tricks meant to keep us glued to our phones that by now have become ubiquitous, no matter what phone or social network app we use.\r\nInfinite scrolling, for example, ensures that there's no end or \"next page\" button after browsing a certain number of stories or videos. Whether on YouTube, Netflix or TikTok, a new video automatically plays as soon as you finish the previous one unless you manually turn off the option.\r\nAccording to Bernstein, Snapchat is home to \"the most vile feature of all of them\": streaks.\r\nUsers build streaks when mutual friends on the app exchange messages every day. The more consecutive Snaps they send, the higher their streak count climbs. Visual and audio cues such as a flame icon appear as you build a higher streak but skipping a day brings your streak count back to zero.\r\nThe concept isn't unfamiliar if you've played any number of mobile games with friendship networks, such as Pokémon Go. But streaks have become so popular that in March, Snapchat introduced a way for U.S. users to restore a lost streak\r\n. The first \"Streak Restore\" is free, but subsequent uses cost 99 cents US.\r\nBernstein said the feature, introduced in 2015, is more about revenue than user engagement. \"The whole idea is to get people on Snapchat so they will see the advertising,\" she said.\r\nIn 2019, the U.K.'s privacy regulator drafted a code of conduct that proposed penalties on companies that promoted \"nudge\" techniques, such as Snapchat streaks or Facebook \"likes,\" to minors.\r\n\"We've designed streaks thoughtfully so they're a positive experience for our community,\" Snap Inc., said in an emailed statement. \"There are no nudging notifications, public-facing incentives or in-app reminders to maintain a streak, and all Snapchatters have the ability to restore a streak if it lapses.\"\r\nThe company added that \"in recent years,\" it made streak emoji graphics \"less prominent\" than before. It also touted a new ability to \"freeze\" streaks when users \"want to go off the grid,\" which is limited to users who pay for its premium Snapchat+ service.\r\nPhones are 'engineered to be addictive'\r\nDr. Anna Lembke, a psychiatry professor at California's Stanford University and author of Dopamine Nation: Finding Balance in the Age of Indulgence, said phones \"are engineered to be addictive\" roping users into a \"compulsive state of overconsumption and, in some cases, outright addiction.\"\r\nFlashy graphic and musical flourishes reward us for continued use, not unlike a slot machine on a crowded casino floor. And push notifications, often accompanied by a ring and vibration, grab your attention even if you're not actively using your phone.\r\nLembke said people often start overusing an app or device for many of the same reasons they might use a drug.\r\n\"That problem can range anywhere from boredom, isolation to depression, insomnia, inattention and everything in between,\" she explained.\r\nWe can be compelled to keep using our devices even if we don't like the news, videos or other content we're seeing a phenomenon known as \"doomscrolling.\"\r\n\"What ends up happening is you get sucked into negative news updates and ... armchair analysis of current news events, particularly negative events, because they are so pervasive now,\" said journalist Karen K. Ho, who helped popularize the term.\r\nLembke said there's a \"general consensus\" among health-care providers that people can be addicted to technology; however it's not currently included in the Diagnostic and Statistical Manual of Mental Disorders.\r\nBernstein said video-gaming addiction is the only type of tech addiction that's formally recognized by the World Health Organization as of 2018.\r\nDespite how often people talk about being addicted to tech, she said, it's usually more accurate to say we're overusing it.\r\nSome legal steps are being taken to tackle technology overuse, particularly for children and students, but it remains to be seen how or whether they will be effective.\r\nSeattle's public school district filed a lawsuit in January\r\n against TikTok, Facebook, YouTube and Snapchat in an attempt to hold them accountable for a decline in youths' mental health.\r\nIn Canada, some schools are experimenting with banning phones in the classroom\r\n, though debate continues on whether it will help or harm students' mental health.\r\nAnd a proposed class-action lawsuit led by a parent in British Columbia\r\n alleges that Epic Games, the maker of Fortnite, designed the video game to be \"as addictive as possible\" for children although it's not exclusively available on mobile devices.\r\nDo screen time trackers help?\r\nMajor device manufacturers now include apps that can track and set hard limits on how much you use your phone or certain apps. On Apple's iPhones, it's called Screen Time; Google Android phones call it Digital Wellbeing.\r\nBernstein said she doubts these tools are very useful for weaning people off of devices that were designed to encourage compulsive use in the first place.\r\n\"Instead of giving self-help measures, I have to think about how we can solve this collectively by exerting pressures on technology companies to redesign [the devices] ... and not hope that people can help themselves. Because they can't,\" she said.\r\nShe pointed to a 2020 column by Android Central writer Daniel Bader\r\n, who found the Digital Wellbeing app \"hasn't really stopped my scrolling it's just sapped the fun out of it.\"\r\nIn an email to CBC, Apple pointed to its Focus app, which includes options to put notifications to sleep, and to its parental controls settings on iPhones, as additional tools beyond Screen Time.\r\nHow to stop the summer of scroll\r\nGiven the myriad ways tech is designed to keep us online for as long as possible, one can be forgiven for wondering what we can do to help us separate from our smartphones long enough to enjoy the sunny and short Canadian summer.\r\nLembke suggests starting small with a \"24-hour digital fast\" and if you're spending a weekend at the cottage or visiting the park with friends or family, everyone can do it together.\r\n\"Just even pay attention to the number of times you think about your phone and want to touch it, because that alone can be a wake-up call for a lot of people,\" she said.\r\nAmerican psychologist and author Jean Twenge, whose 2017 book iGen interrogated how tech affects Generation Z (people born roughly between 1995 and 2012), advised parents to \"put off giving your child a full-blown smartphone as long as possible.\"\r\nShe told The Sunday Magazine's David Common that there are lots of options for teen and preteen kids, like flip phones or other phones with only basic text and calling functions, without support for the apps that drain away our time.\r\nBernstein said it will likely take a while before government and legal actions dramatically shape our screen time habits. But in the meantime, small things may help \"bridge the gap\" such as deleting the one app you use the most from your phone.\r\n\"I think we need to do everything we can to try to change norms in little ways, until things change more socially.\"",
        "sentiment_score": 0.0,
        "sentiment_rank": "positive",
        "tagged_sent_topics": "Customer Privacy",
        "company_name": "Gaia Inc",
        "company_id": 242920,
        "url": "https://www.cbc.ca/radio/spark/summer-scrolling-smartphones-unplugged-1.6871589"
    },
    {
        "id": 62390570,
        "published_at": "2023-07-02T07:32:16Z",
        "title": "Domestic automakers accelerate employment of women in shop floors",
        "file_name": "2023-07-02_62390570.txt",
        "full_text": "Homegrown automakers Tata Motors, Mahindra &amp; Mahindra, Ashok Leyland and Hero MotoCorp are accelerating the drive to employ more women in shop floors as they press hard on the pedal to enhance diversity. Once outsiders but no longer, thousands of women are now rolling out from two-wheelers to popular SUVs and heavy commercial vehicles across different factories of these companies. Tata Motors has over 4,500 women working in the shop floors across six manufacturing plants, including an all-women line at its Pune facility with over 1,500 of them producing popular SUVs such as Harrier and Safari. \r\n\"We are an equal opportunity employer and believe a gender-balanced workforce leads to increased productivity, better decisions, enhanced collaboration, and more innovative ideas. Our focus is on enhancing diversity, especially on the shop floor and 25 per cent of all our new recruits are women,\" Tata Motors Chief Human Resources Officer (CHRO) Ravindra Kumar GP told PTI. He further said, \"Today, over 4,500 women are actively engaged on the shop floors of our various plants. They exercise a wide range of functional capabilities on multiple products, from small passenger cars to heavy commercial vehicles.\" Another homegrown automaker Mahindra &amp; Mahindra (M&amp;M) has seen the number of women as its employees at manufacturing plants grow by three times over last year to 1,202 at present, involved in core activities ranging from welding to robotics loading, vehicle assembly and machine shop, among others. \r\n According to M&amp;M CHRO, Auto &amp; Farm Sector Rajeshwar Tripathi, the company hires from over 25 Industrial Training Institutes (ITIs), some of which are women-only ITIs. \"Our annual intake is in the excess of 1,200. We have adopted about eight ITIs in tribal areas, from where our intake is very regular,\" he said, adding, M&amp;M too strongly believes that a diverse team is far more productive, the work culture is far better and such teams are more creative and more innovative. When asked about the challenges in more women entering into automobile manufacturing, he said it is as much internal within the company as it is social. Although the company has worked to put in place the basics such as policies and physical infrastructure, the external factor of social and family pressure can be a hindrance in getting more women to work in the shop floors. \r\nThe social and family pressure on women not to take up manufacturing as a career is quite significant and it can play a significant role if not addressed adequately, Tripathi asserted. \r\nAt commercial vehicle maker Ashok Leyland, 991 women work at its seven different manufacturing plants. At the company's Hosur plant, an all-women assembly line comprising nearly 120 of them is engaged in the assembly of engines for light commercial vehicles producing 120 engines per shift in a day. \r\nAshok Leyland President &amp; Chief of Operations Ganesh Mani said the company has always been propagating that any job need not be gender specific. \r\nCiting the example of the company's Pantnagar plant, where women executives who take part in truck assembly, could take leadership positions much earlier after working for nearly one to two years, he said it inspired the company to contemplate an all-women engine assembly line. \r\n\"If they (women) can make trucks why not we go for (an all-women) engine assembly line,\" Mani said, adding, \"Our new tag line is 'Koi manzil door nahin', which means no dreams too far for anyone. Keeping that in view we thought that we should be a starting point that an all-women line should be that.\" \r\nWomen empowerment is also witnessed at the world's largest two-wheeler maker Hero MotoCorp, which has over 1,500 women employees. \r\nThe concept of women technicians and engineers in the automobile industry which seemed like a distant dream is now a reality. Women are now not only finding their feet in the shop floors but they are running the show at the factories, thanks to these Indian automobile manufacturers.\r\nDon’t miss out on ET Prime stories! Get your daily dose of business updates on WhatsApp. click here!",
        "sentiment_score": 0.802,
        "sentiment_rank": "positive",
        "tagged_sent_topics": "Employee Engagement, Diversity & Inclusion",
        "company_name": "Mahindra & Mahindra Limited",
        "company_id": 213758,
        "url": "https://economictimes.indiatimes.com/industry/auto/auto-news/domestic-automakers-accelerate-employment-of-women-in-shop-floors/articleshow/101431075.cms"
    },
    {
        "id": 62390383,
        "published_at": "2023-07-02T06:36:46Z",
        "title": "Groupe Minoteries SA (VTX:GMI) most popular amongst retail investors who own 52%, insiders hold 25%",
        "file_name": "2023-07-02_62390383.txt",
        "full_text": "Key Insights\r\n<ul><li>The considerable ownership by retail investors in Groupe Minoteries indicates that they collectively have a greater say in management and business strategy\r\n</li><li>48% of the business is held by the top 22 shareholders\r\n</li><li> Insider ownership in Groupe Minoteries is 25%\r\n</li></ul>A look at the shareholders of Groupe Minoteries SA (VTX:GMI) can tell us which group is most powerful. We can see that retail investors own the lion's share in the company with 52% ownership. Put another way, the group faces the maximum upside potential (or downside risk).\r\nAnd individual insiders on the other hand have a 25% ownership in the company. Insiders often own a large chunk of younger, smaller, companies while huge companies tend to have institutions as shareholders.\r\nLet's take a closer look to see what the different types of shareholders can tell us about Groupe Minoteries.\r\n Check out our latest analysis for Groupe Minoteries \r\nWhat Does The Institutional Ownership Tell Us About Groupe Minoteries?\r\nInstitutional investors commonly compare their own returns to the returns of a commonly followed index. So they generally do consider buying larger companies that are included in the relevant benchmark index.\r\nAs you can see, institutional investors have a fair amount of stake in Groupe Minoteries. This can indicate that the company has a certain degree of credibility in the investment community. However, it is best to be wary of relying on the supposed validation that comes with institutional investors. They too, get it wrong sometimes. It is not uncommon to see a big share price drop if two large institutional investors try to sell out of a stock at the same time. So it is worth checking the past earnings trajectory of Groupe Minoteries, (below). Of course, keep in mind that there are other factors to consider, too.\r\nearnings-and-revenue-growth\r\nWe note that hedge funds don't have a meaningful investment in Groupe Minoteries. The company's largest shareholder is Ernst Sturzenegger, with ownership of 6.6%. With 6.4% and 5.7% of the shares outstanding respectively, AMG Fondsverwaltung AG and Gamma Stawag Ag are the second and third largest shareholders.\r\nOur studies suggest that the top 22 shareholders collectively control less than half of the company's shares, meaning that the company's shares are widely disseminated and there is no dominant shareholder.\r\nWhile studying institutional ownership for a company can add value to your research, it is also a good practice to research analyst recommendations to get a deeper understand of a stock's expected performance. We're not picking up on any analyst coverage of the stock at the moment, so the company is unlikely to be widely held.\r\nInsider Ownership Of Groupe Minoteries\r\nThe definition of an insider can differ slightly between different countries, but members of the board of directors always count. The company management answer to the board and the latter should represent the interests of shareholders. Notably, sometimes top-level managers are on the board themselves.\r\nMost consider insider ownership a positive because it can indicate the board is well aligned with other shareholders. However, on some occasions too much power is concentrated within this group.\r\nOur most recent data indicates that insiders own a reasonable proportion of Groupe Minoteries SA. It has a market capitalization of just CHF97m, and insiders have CHF24m worth of shares in their own names. It is great to see insiders so invested in the business. It might be worth checking if those insiders have been buying recently. \r\nGeneral Public Ownership\r\nThe general public, who are usually individual investors, hold a substantial 52% stake in Groupe Minoteries, suggesting it is a fairly popular stock. With this amount of ownership, retail investors can collectively play a role in decisions that affect shareholder returns, such as dividend policies and the appointment of directors. They can also exercise the power to vote on acquisitions or mergers that may not improve profitability.\r\nPrivate Company Ownership\r\nWe can see that Private Companies own 9.6%, of the shares on issue. It might be worth looking deeper into this. If related parties, such as insiders, have an interest in one of these private companies, that should be disclosed in the annual report. Private companies may also have a strategic interest in the company.\r\nNext Steps:\r\nIt's always worth thinking about the different groups who own shares in a company. But to understand Groupe Minoteries better, we need to consider many other factors. For example, we've discovered 3 warning signs for Groupe Minoteries (1 is concerning!) that you should be aware of before investing here.\r\nIf you would prefer check out another company -- one with potentially superior financials -- then do not miss this free list of interesting companies, backed by strong financial data.\r\nNB: Figures in this article are calculated using data from the last twelve months, which refer to the 12-month period ending on the last date of the month the financial statement is dated. This may not be consistent with full year annual report figures.\r\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\r\nJoin A Paid User Research SessionYoull receive a US$30 Amazon Gift card for 1 hour of your time while helping us build better investing tools for the individual investors like yourself. Sign up here",
        "sentiment_score": 0.7003,
        "sentiment_rank": "positive",
        "tagged_sent_topics": "Business Model Resilience",
        "company_name": "Groupe Minoteries SA",
        "company_id": 215337,
        "url": "https://finance.yahoo.com/news/groupe-minoteries-sa-vtx-gmi-063646934.html"
    },
    {
        "id": 62390370,
        "published_at": "2023-07-02T06:03:14Z",
        "title": "Koninklijke Vopak N.V.'s (AMS:VPK) largest shareholders are private equity firms with 48% ownership, institutions own 25%",
        "file_name": "2023-07-02_62390370.txt",
        "full_text": "Key Insights\r\n<ul><li>The considerable ownership by private equity firms in Koninklijke Vopak indicates that they collectively have a greater say in management and business strategy\r\n</li><li>51% of the business is held by the top 2 shareholders\r\n</li><li> 25% of Koninklijke Vopak is held by Institutions\r\n</li></ul>If you want to know who really controls Koninklijke Vopak N.V. (AMS:VPK), then you'll have to look at the makeup of its share registry. The group holding the most number of shares in the company, around 48% to be precise, is private equity firms. In other words, the group stands to gain the most (or lose the most) from their investment into the company.\r\nInstitutions, on the other hand, account for 25% of the company's stockholders. Insiders often own a large chunk of younger, smaller, companies while huge companies tend to have institutions as shareholders.\r\nLet's take a closer look to see what the different types of shareholders can tell us about Koninklijke Vopak.\r\n Check out our latest analysis for Koninklijke Vopak \r\nWhat Does The Institutional Ownership Tell Us About Koninklijke Vopak?\r\nInstitutional investors commonly compare their own returns to the returns of a commonly followed index. So they generally do consider buying larger companies that are included in the relevant benchmark index.\r\nWe can see that Koninklijke Vopak does have institutional investors; and they hold a good portion of the company's stock. This can indicate that the company has a certain degree of credibility in the investment community. However, it is best to be wary of relying on the supposed validation that comes with institutional investors. They too, get it wrong sometimes. When multiple institutions own a stock, there's always a risk that they are in a 'crowded trade'. When such a trade goes wrong, multiple parties may compete to sell stock fast. This risk is higher in a company without a history of growth. You can see Koninklijke Vopak's historic earnings and revenue below, but keep in mind there's always more to the story.\r\nearnings-and-revenue-growth\r\nWe note that hedge funds don't have a meaningful investment in Koninklijke Vopak. Our data shows that HAL Investments B.V. is the largest shareholder with 48% of shares outstanding. The second and third largest shareholders are Sprucegrove Investment Management Ltd and Maple-Brown Abbott, with an equal amount of shares to their name at 3.0%.\r\nA more detailed study of the shareholder registry showed us that 2 of the top shareholders have a considerable amount of ownership in the company, via their 51% stake.\r\nWhile it makes sense to study institutional ownership data for a company, it also makes sense to study analyst sentiments to know which way the wind is blowing. Quite a few analysts cover the stock, so you could look into forecast growth quite easily.\r\nInsider Ownership Of Koninklijke Vopak\r\nThe definition of an insider can differ slightly between different countries, but members of the board of directors always count. The company management answer to the board and the latter should represent the interests of shareholders. Notably, sometimes top-level managers are on the board themselves.\r\nI generally consider insider ownership to be a good thing. However, on some occasions it makes it more difficult for other shareholders to hold the board accountable for decisions.\r\nWe can report that insiders do own shares in Koninklijke Vopak N.V.. The insiders have a meaningful stake worth 129m. Most would see this as a real positive. If you would like to explore the question of insider alignment, you can click here to see if insiders have been buying or selling. \r\nGeneral Public Ownership\r\nWith a 24% ownership, the general public, mostly comprising of individual investors, have some degree of sway over Koninklijke Vopak. This size of ownership, while considerable, may not be enough to change company policy if the decision is not in sync with other large shareholders.\r\nPrivate Equity Ownership\r\nWith a stake of 48%, private equity firms could influence the Koninklijke Vopak board. Sometimes we see private equity stick around for the long term, but generally speaking they have a shorter investment horizon and -- as the name suggests -- don't invest in public companies much. After some time they may look to sell and redeploy capital elsewhere.\r\nNext Steps:\r\nIt's always worth thinking about the different groups who own shares in a company. But to understand Koninklijke Vopak better, we need to consider many other factors. For instance, we've identified 2 warning signs for Koninklijke Vopak that you should be aware of.\r\nIf you would prefer discover what analysts are predicting in terms of future growth, do not miss this freereport on analyst forecasts.\r\nNB: Figures in this article are calculated using data from the last twelve months, which refer to the 12-month period ending on the last date of the month the financial statement is dated. This may not be consistent with full year annual report figures.\r\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\r\nJoin A Paid User Research SessionYoull receive a US$30 Amazon Gift card for 1 hour of your time while helping us build better investing tools for the individual investors like yourself. Sign up here",
        "sentiment_score": 0.6124,
        "sentiment_rank": "positive",
        "tagged_sent_topics": "Business Model Resilience",
        "company_name": "Koninklijke Vopak N.V",
        "company_id": 214791,
        "url": "https://finance.yahoo.com/news/koninklijke-vopak-n-v-ams-060314870.html"
    },
    {
        "id": 62390519,
        "published_at": "2023-07-02T05:42:48Z",
        "title": "Humpback whale buried in NSW dunes after stranding on Seven Mile beach",
        "file_name": "2023-07-02_62390519.txt",
        "full_text": "A 30-tonne humpback whale has been buried in the dunes behind where it beached and died on Seven Mile beach on the New South Wales mid-north coast.\r\nThe adult whale became stranded early on Saturday morning and, despite attempts by the NSW National Parks and Wildlife Service to save it, died about 7pm.\r\nThe mayor of Ballina Shire council, Sharon Cadwallader, said the whale was buried on Sunday in the dunes behind the beach. There was a ceremony at the request of the Jali local Aboriginal land council.\r\nEverything has to be according to government guidelines. Jali does have to be consulted and that was the preference to have a burial rather than it be disposed of in the waste facility, Cadwallader said.\r\nThe humpback whale stranded at Lennox Head on Saturday. Photograph: Twitter/DPE Environment and Heritage (inc NPWS)\r\nIn 2017, a whale buried at Port Macquarie beach was subsequently dug up and removed when locals raised concerns it could attract sharks.\r\nA research project in 2019 found those fears were unfounded. Cadwallader said there were still no state government guidelines on disposing of whale carcasses but the mayor said if done correctly, a whale burial should not attract sharks to the area.\r\nCadwallader said the whale had to be buried above the water table and the high tide mark. The most important thing is no water passes through the burial site, she said.\r\nThe OzGrom 2023 junior surfing competition is scheduled for nearby Lennox Head later this week and the mayor said extra safety precautions would be put in place.\r\nIt attracts young surfers from all around Australia. Staff are working with the organisers to see if there are any further safety measures that need to be put in place. But the event will be going ahead, which is wonderful.\r\nskip past newsletter promotionSign up to Guardian Australia's Morning Mail\r\nOur Australian morning briefing email breaks down the key national and international stories of the day and why they matter\r\n&lt;label class=\\\"email-signup-iframe-njjzu0\\\"&gt;&lt;div class=\\\"email-signup-iframe-de6my7\\\"&gt;Enter your email address &lt;/div&gt;&lt;/label&gt;&lt;div class=\\\"email-signup-iframe-17gkgdc\\\"&gt;&lt;div class=\\\"email-signup-iframe-lxzyg5\\\"&gt;&lt;label for=\\\"src-component-1529191\\\" class=\\\"email-signup-iframe-0\\\"&gt;&lt;div class=\\\"email-signup-iframe-19ilr9m\\\"&gt;Enter your email address &lt;/div&gt;&lt;/label&gt;&lt;input type=\\\"email\\\" id=\\\"src-component-1529191\\\" aria-required=\\\"true\\\" aria-invalid=\\\"false\\\" aria-describedby required name=\\\"email\\\" class=\\\"email-signup-iframe-82t7uz\\\"/&gt;&lt;/div&gt;&lt;button type=\\\"submit\\\" aria-live=\\\"polite\\\" class=\\\"email-signup-iframe-1wosa0f\\\"&gt;Sign up&lt;/button&gt;&lt;/div&gt;&lt;/form&gt;\",\"styles\":\"&lt;style data-emotion=\\\"email-signup-iframe-global 0\\\"&gt;&lt;/style&gt;&lt;style data-emotion=\\\"email-signup-iframe njjzu0 de6my7 17gkgdc lxzyg5 19ilr9m 82t7uz 1wosa0f\\\"&gt;.email-signup-iframe-njjzu0 div{font-family:GuardianTextSans,Guardian Text Sans Web,Helvetica Neue,Helvetica,Arial,Lucida Grande,sans-serif;font-size:0.875rem;line-height:1.35;font-weight:700;--source-text-decoration-thickness:2px;}.email-signup-iframe-de6my7{font-family:GuardianTextSans,Guardian Text Sans Web,Helvetica Neue,Helvetica,Arial,Lucida Grande,sans-serif;font-size:1.0625rem;line-height:1.35;font-weight:700;--source-text-decoration-thickness:2px;color:#121212;}.email-signup-iframe-17gkgdc{display:-webkit-box;display:-webkit-flex;display:-ms-flexbox;display:flex;-webkit-flex-direction:row;-ms-flex-direction:row;flex-direction:row;-webkit-align-items:flex-start;-webkit-box-align:flex-start;-ms-flex-align:flex-start;align-items:flex-start;-webkit-box-flex-wrap:wrap;-webkit-flex-wrap:wrap;-ms-flex-wrap:wrap;flex-wrap:wrap;}.email-signup-iframe-lxzyg5{margin-right:12px;margin-bottom:8px;-webkit-flex-basis:335px;-ms-flex-preferred-size:335px;flex-basis:335px;-webkit-flex-shrink:1;-ms-flex-negative:1;flex-shrink:1;}.email-signup-iframe-19ilr9m{font-family:GuardianTextSans,Guardian Text Sans Web,Helvetica Neue,Helvetica,Arial,Lucida Grande,sans-serif;font-size:1.0625rem;line-height:1.35;font-weight:700;--source-text-decoration-thickness:2px;color:#121212;position:absolute;overflow:hidden;white-space:nowrap;width:1px;height:1px;margin:-1px;padding:0;border:0;clip:rect(1px, 1px, 1px, 1px);-webkit-clip-path:inset(50%);-webkit-clip-path:inset(50%);clip-path:inset(50%);}.email-signup-iframe-82t7uz{width:100%;box-sizing:border-box;height:44px;font-family:GuardianTextSans,Guardian Text Sans Web,Helvetica Neue,Helvetica,Arial,Lucida Grande,sans-serif;font-size:1.0625rem;line-height:1.35;font-weight:400;--source-text-decoration-thickness:2px;color:#121212;background-color:#FFFFFF;border:1px solid #707070;border-radius:4px;padding:0 8px;margin-top:4px;height:36px;margin-top:0;}.email-signup-iframe-82t7uz:focus{outline:0;}html:not(.src-focus-disabled) .email-signup-iframe-82t7uz:focus{box-shadow:0 0 0 3px #0077B6;}.email-signup-iframe-82t7uz:invalid{box-shadow:none;}.email-signup-iframe-82t7uz:invalid[value]:not([value='']){border:2px solid #C70000;border-radius:4px;color:#121212;margin-top:0;}.email-signup-iframe-1wosa0f{display:-webkit-inline-box;display:-webkit-inline-flex;display:-ms-inline-flexbox;display:inline-flex;-webkit-box-pack:justify;-webkit-justify-content:space-between;justify-content:space-between;-webkit-align-items:center;-webkit-box-align:center;-ms-flex-align:center;align-items:center;box-sizing:border-box;border:none;background:transparent;cursor:pointer;-webkit-transition:.3s ease-in-out;transition:.3s ease-in-out;-webkit-text-decoration:none;text-decoration:none;white-space:nowrap;font-family:GuardianTextSans,Guardian Text Sans Web,Helvetica Neue,Helvetica,Arial,Lucida Grande,sans-serif;font-size:1.0625rem;line-height:1.35;font-weight:700;--source-text-decoration-thickness:2px;height:36px;min-height:36px;padding:0 16px;border-radius:36px;padding-bottom:2px;background-color:#052962;color:#FFFFFF;-webkit-box-pack:center;-ms-flex-pack:center;-webkit-justify-content:center;justify-content:center;background-color:#000000;-webkit-flex-basis:118px;-ms-flex-preferred-size:118px;flex-basis:118px;-webkit-flex-shrink:0;-ms-flex-negative:0;flex-shrink:0;margin-bottom:8px;}.email-signup-iframe-1wosa0f:disabled{cursor:not-allowed;}.email-signup-iframe-1wosa0f:focus{outline:0;}html:not(.src-focus-disabled) .email-signup-iframe-1wosa0f:focus{outline:5px solid #0077B6;outline-offset:3px;}.email-signup-iframe-1wosa0f:hover{background-color:#234B8A;}.email-signup-iframe-1wosa0f:hover{background-color:#333333;}&lt;/style&gt;\",\"newsletterId\":\"morning-mail\",\"successDescription\":\"We'll send you Guardian Australia's Morning Mail every weekday\"}\" clientOnly&gt;\r\nPrivacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy. We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply.\r\nafter newsletter promotion\r\nSkippy Love, from the Organisation for the Rescue and Research of Cetaceans in Australia, told Guardian Australia on Saturday it was not clear how the whale ended up stranded on the beach.\r\nBeing that its in good body condition, and theres no obvious injury like a boat strike or anything like that, its hard to determine what has happened, she said.\r\nHumpbacks tend to strand on their own and it normally indicates there is some kind of a problem that has occurred to make that happen.",
        "sentiment_score": 0.4215,
        "sentiment_rank": "positive",
        "tagged_sent_topics": "Product Quality & Safety",
        "company_name": "Lennox International Inc",
        "company_id": 207339,
        "url": "https://www.theguardian.com/environment/2023/jul/02/humpback-whale-buried-in-nsw-dunes-after-stranding-on-seven-mile-beach"
    },
    {
        "id": 62390607,
        "published_at": "2023-07-02T05:02:00Z",
        "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Investigates Claims On Behalf of Investors of PTC Therapeutics, Inc. - PTCT",
        "file_name": "2023-07-02_62390607.txt",
        "full_text": "NEW YORK, July 02, 2023 (GLOBE NEWSWIRE) -- Pomerantz LLP is investigating claims on behalf of investors of PTC Therapeutics, Inc. (PTC or the Company) (NASDAQ: PTCT).   Such investors are advised to contact Robert S. Willoughby at  newaction@pomlaw.com\r\n or 888-476-6529, ext. 7980.\r\nThe investigation concerns whether PTC and certain of its officers and/or directors have engaged in securities fraud or other unlawful business practices. \r\n[Click here for information about joining the class action]\r\nOn May 23, 2023, PTC issued a press release report[ing] topline results from the MOVE-FA trial of vatiquinone in patients with Friedreich ataxia, in which the Company disclosed that [t]he study did not meet its primary endpoint of statistically significant change in mFARS score at 72 weeks in the primary analysis population.  Then, on May 24, 2023, PTC disclosed that following review of its preclinical and clinical development programs . . . the Company has determined to discontinue its preclinical and early research programs in its gene therapy platform.  In connection with the strategic pipeline prioritization, on May 22, 2023, the Company committed to a reduction in workforce of approximately 8%, which will primarily affect employees in the United States.  Concurrently, PTC disclosed that [o]n May 20, 2023, the Company informed Emily Hill, its Chief Financial Officer, that her employment will be terminated effective as of August 20, 2023, and effective immediately she will cease to serve as the Companys Chief Financial Officer. \r\nFollowing these disclosures, PTCs stock price fell $11.46 per share, or 19.62%, to close at $46.95 per share on May 24, 2023.\r\nPomerantz LLP, with offices in New York, Chicago, Los Angeles, London, Paris, and Tel Aviv, is acknowledged as one of the premier firms in the areas of corporate, securities, and antitrust class litigation. Founded by the late Abraham L. Pomerantz, known as the dean of the class action bar, Pomerantz pioneered the field of securities class actions. Today, more than 85 years later, Pomerantz continues in the tradition he established, fighting for the rights of the victims of securities fraud, breaches of fiduciary duty, and corporate misconduct. The Firm has recovered numerous multimillion-dollar damages awards on behalf of class members. See www.pomlaw.com\r\n.\r\nCONTACT:Robert S. WilloughbyPomerantz LLPrswilloughby@pomlaw.com\r\n888-476-6529 ext. 7980",
        "sentiment_score": -0.7964,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Business Model Resilience",
        "company_name": "PTC Inc",
        "company_id": 190865,
        "url": "https://www.globenewswire.com/news-release/2023/07/02/2698222/1087/en/SHAREHOLDER-ALERT-Pomerantz-Law-Firm-Investigates-Claims-On-Behalf-of-Investors-of-PTC-Therapeutics-Inc-PTCT.html"
    },
    {
        "id": 62390605,
        "published_at": "2023-07-02T04:58:00Z",
        "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Investigates Claims On Behalf of Investors of Comerica Incorporated - CMA",
        "file_name": "2023-07-02_62390605.txt",
        "full_text": "NEW YORK, July 02, 2023 (GLOBE NEWSWIRE) -- Pomerantz LLP is investigating claims on behalf of investors of Comerica Incorporated (Comerica or the Company) (NYSE: CMA).   Such investors are advised to contact Robert S. Willoughby at  newaction@pomlaw.com\r\n or 888-476-6529, ext. 7980.\r\nThe investigation concerns whether Comerica and certain of its officers and/or directors have engaged in securities fraud or other unlawful business practices. \r\n[Click here for information about joining the class action]\r\nOn May 29, 2023, citing a review of internal documents, American Banker reported that Comerica Bank officials privately acknowledged significant compliance failures in their operation of a Treasury Department program that provides federal benefits on prepaid cards to millions of unbanked Americans[.]  American Banker stated that [a] Comerica executive said the Dallas bank faced a serious contract violation for allowing fraud disputes and data on Direct Express and cardholders to be handled out of a vendors office in Lahore, Pakistan[.] \r\nOn this news, Comericas stock fell $1.40 per share, or 3.59% to close at $37.59 per share on May 30, 2023.\r\nPomerantz LLP, with offices in New York, Chicago, Los Angeles, London, Paris, and Tel Aviv, is acknowledged as one of the premier firms in the areas of corporate, securities, and antitrust class litigation. Founded by the late Abraham L. Pomerantz, known as the dean of the class action bar, Pomerantz pioneered the field of securities class actions. Today, more than 85 years later, Pomerantz continues in the tradition he established, fighting for the rights of the victims of securities fraud, breaches of fiduciary duty, and corporate misconduct. The Firm has recovered billions of dollars in damages awards on behalf of class members. See www.pomlaw.com\r\n.\r\nCONTACT:Robert S. WilloughbyPomerantz LLPrswilloughby@pomlaw.com\r\n888-476-6529 ext. 7980",
        "sentiment_score": -0.2502,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Management of the Legal & Regulatory Environment || Business Model Resilience",
        "company_name": "Comerica Incorporated",
        "company_id": 204780,
        "url": "https://www.globenewswire.com/news-release/2023/07/02/2698221/1087/en/SHAREHOLDER-ALERT-Pomerantz-Law-Firm-Investigates-Claims-On-Behalf-of-Investors-of-Comerica-Incorporated-CMA.html"
    },
    {
        "id": 62390609,
        "published_at": "2023-07-02T04:46:00Z",
        "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Investigates Claims On Behalf of Investors of Advance Auto Parts, Inc. - AAP",
        "file_name": "2023-07-02_62390609.txt",
        "full_text": "NEW YORK, July 02, 2023 (GLOBE NEWSWIRE) -- Pomerantz LLP is investigating claims on behalf of investors of Advance Auto Parts, Inc. (Advance Auto Parts or the Company) (NYSE: AAP).   Such investors are advised to contact Robert S. Willoughby at  newaction@pomlaw.com\r\n or 888-476-6529, ext. 7980.\r\nThe investigation concerns whether Advance Auto Parts and certain of its officers and/or directors have engaged in securities fraud or other unlawful business practices. \r\n[Click here for information about joining the class action]\r\nOn May 31, 2023, Advance Auto Parts revealed disappointing results for the first quarter of fiscal year 2023, including a net sales decrease of more than 1.6% compared to the prior year and an operating margin rate of 2.6%, which was well below expectations due to higher than planned investments to narrow competitive price gaps in the professional sales channel as well as unfavorable product mix.  The Company further disclosed that it was slashing its full year 2023 guidance, which it had provided just three months earlier, because it now expect[s] the competitive dynamics . . . faced in the first quarter to continue.  Moreover, the Company revealed that it was cutting its quarterly dividend by 84% to provide enhanced financial flexibility. \r\nOn this news, Advance Auto Parts stock price fell $39.31 per share, or 35.04%, to close at $72.89 per share on May 31, 2023.\r\nPomerantz LLP, with offices in New York, Chicago, Los Angeles, London, Paris, and Tel Aviv, is acknowledged as one of the premier firms in the areas of corporate, securities, and antitrust class litigation. Founded by the late Abraham L. Pomerantz, known as the dean of the class action bar, Pomerantz pioneered the field of securities class actions. Today, more than 85 years later, Pomerantz continues in the tradition he established, fighting for the rights of the victims of securities fraud, breaches of fiduciary duty, and corporate misconduct. The Firm has recovered numerous multimillion-dollar damages awards on behalf of class members. See www.pomlaw.com\r\n.\r\nCONTACT:Robert S. WilloughbyPomerantz LLPrswilloughby@pomlaw.com\r\n888-476-6529 ext. 7980",
        "sentiment_score": -0.7964,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Business Model Resilience",
        "company_name": "Advance Auto Parts, Inc",
        "company_id": 191410,
        "url": "https://www.globenewswire.com/news-release/2023/07/02/2698219/1087/en/SHAREHOLDER-ALERT-Pomerantz-Law-Firm-Investigates-Claims-On-Behalf-of-Investors-of-Advance-Auto-Parts-Inc-AAP.html"
    },
    {
        "id": 62390595,
        "published_at": "2023-07-02T04:35:00Z",
        "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Investigates Claims On Behalf of Investors of Zai Lab Limited - ZLAB",
        "file_name": "2023-07-02_62390595.txt",
        "full_text": "NEW YORK, July 02, 2023 (GLOBE NEWSWIRE) -- Pomerantz LLP is investigating claims on behalf of investors of Zai Lab Limited (Zai Lab or the Company) (NASDAQ: ZLAB).   Such investors are advised to contact Robert S. Willoughby at  newaction@pomlaw.com\r\n or 888-476-6529, ext. 7980.\r\nThe investigation concerns whether Zai Lab and certain of its officers and/or directors have engaged in securities fraud or other unlawful business practices. \r\n[Click here for information about joining the class action]\r\nOn June 6, 2023, Zai Lab reported phase 3 trials for an oncology therapy it is developing with the oncology company NovoCure.  Zai Lab said that its tumor treating fields (TTFields) therapy, which uses skin patches to deliver electric fields to areas of the body, when used with standard therapies, met its primary endpoint of three-month improvement in median overall survival (OS) in metastatic non-small cell lung cancer (NSCLC) patients.  Further, according to Zai Lab, patients with the TTFields therapy had a median OS of 13.2 months compared to 9.9 months with patients who just had standard therapies. However, 70% of the study participants didn't use an initial checkpoint inhibitor, which is seen as the leading way to treat NSCLC, thereby allowing for the possibility that the study was skewed by comparing TTFields to a lesser therapy.  \r\nOn this news, Zai Labs stock fell $4.88 per share, or 14.55%, to close at $28.66 per share on June 7, 2023, damaging investors.\r\nPomerantz LLP, with offices in New York, Chicago, Los Angeles, London, Paris, and Tel Aviv, is acknowledged as one of the premier firms in the areas of corporate, securities, and antitrust class litigation. Founded by the late Abraham L. Pomerantz, known as the dean of the class action bar, Pomerantz pioneered the field of securities class actions. Today, more than 85 years later, Pomerantz continues in the tradition he established, fighting for the rights of the victims of securities fraud, breaches of fiduciary duty, and corporate misconduct. The Firm has recovered billions of dollars in damages awards on behalf of class members. See www.pomlaw.com\r\n.\r\nCONTACT:Robert S. WilloughbyPomerantz LLPrswilloughby@pomlaw.com\r\n888-476-6529 ext. 7980",
        "sentiment_score": -0.7964,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Business Model Resilience",
        "company_name": "Zai Lab Limited",
        "company_id": 194805,
        "url": "https://www.globenewswire.com/news-release/2023/07/02/2698218/1087/en/SHAREHOLDER-ALERT-Pomerantz-Law-Firm-Investigates-Claims-On-Behalf-of-Investors-of-Zai-Lab-Limited-ZLAB.html"
    },
    {
        "id": 62390604,
        "published_at": "2023-07-02T04:28:00Z",
        "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Investigates Claims On Behalf of Investors of Franchise Group, Inc. - FRG",
        "file_name": "2023-07-02_62390604.txt",
        "full_text": "NEW YORK, July 02, 2023 (GLOBE NEWSWIRE) -- Pomerantz LLP is investigating claims on behalf of investors of Franchise Group, Inc. (Franchise Group or the Company) (NASDAQ: FRG).   Such investors are advised to contact Robert S. Willoughby at  newaction@pomlaw.com\r\n or 888-476-6529, ext. 7980.\r\nThe investigation concerns whether Franchise Group and certain of its officers and/or directors have engaged in securities fraud or other unlawful business practices. \r\n[Click here for information about joining the class action]\r\nOn May 10, 2023, Franchise Group announced that it would be acquired by Freedom VCM, Inc., an investment consortium that includes Franchise Groups CEO, at a price of $30.00 per share, representing a premium of less than 4% to the stocks closing price the prior day.  Following the closing of the proposed transaction, Franchise Group investors will be cashed out of their investment position and the Companys shares will no longer be publicly traded. \r\nFollowing the announcement, Franchise Groups stock price fell $0.23 per share, or 0.78%, to close at $29.10 per share on May 11, 2023.\r\nPomerantz LLP, with offices in New York, Chicago, Los Angeles, London, Paris, and Tel Aviv, is acknowledged as one of the premier firms in the areas of corporate, securities, and antitrust class litigation. Founded by the late Abraham L. Pomerantz, known as the dean of the class action bar, Pomerantz pioneered the field of securities class actions. Today, more than 85 years later, Pomerantz continues in the tradition he established, fighting for the rights of the victims of securities fraud, breaches of fiduciary duty, and corporate misconduct. The Firm has recovered numerous multimillion-dollar damages awards on behalf of class members. See www.pomlaw.com\r\n.\r\nCONTACT:Robert S. WilloughbyPomerantz LLPrswilloughby@pomlaw.com\r\n888-476-6529 ext. 7980",
        "sentiment_score": -0.7964,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Business Model Resilience",
        "company_name": "Franchise Group Inc",
        "company_id": 244910,
        "url": "https://www.globenewswire.com/news-release/2023/07/02/2698217/1087/en/SHAREHOLDER-ALERT-Pomerantz-Law-Firm-Investigates-Claims-On-Behalf-of-Investors-of-Franchise-Group-Inc-FRG.html"
    },
    {
        "id": 62390597,
        "published_at": "2023-07-02T04:22:00Z",
        "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Investigates Claims On Behalf of Investors of EPAM Systems, Inc. - EPAM",
        "file_name": "2023-07-02_62390597.txt",
        "full_text": "NEW YORK, July 02, 2023 (GLOBE NEWSWIRE) -- Pomerantz LLP is investigating claims on behalf of investors of EPAM Systems, Inc. (EPAM or the Company) (NYSE: EPAM).   Such investors are advised to contact Robert S. Willoughby at  newaction@pomlaw.com\r\n or 888-476-6529, ext. 7980.\r\nThe investigation concerns whether EPAM and certain of its officers and/or directors have engaged in securities fraud or other unlawful business practices. \r\n[Click here for information about joining the class action]\r\n                On June 5, 2023, just one month after issuing guidance during its first quarter earnings call on May 5, 2023, EPAM lowered its expectations for the second quarter and the full year, claiming that the demand for IT consulting appeared to have dried up. \r\nOn this news, EPAMs stock price fell $56.40 per share, or 21.72%, to close at $203.25 per share on June 5, 2023.\r\nPomerantz LLP, with offices in New York, Chicago, Los Angeles, London, Paris, and Tel Aviv, is acknowledged as one of the premier firms in the areas of corporate, securities, and antitrust class litigation. Founded by the late Abraham L. Pomerantz, known as the dean of the class action bar, Pomerantz pioneered the field of securities class actions. Today, more than 85 years later, Pomerantz continues in the tradition he established, fighting for the rights of the victims of securities fraud, breaches of fiduciary duty, and corporate misconduct. The Firm has recovered numerous multimillion-dollar damages awards on behalf of class members. See www.pomlaw.com\r\n.\r\nCONTACT:Robert S. WilloughbyPomerantz LLPrswilloughby@pomlaw.com\r\n888-476-6529 ext. 7980",
        "sentiment_score": -0.7964,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Business Model Resilience",
        "company_name": "EPAM Systems, Inc",
        "company_id": 190516,
        "url": "https://www.globenewswire.com/news-release/2023/07/02/2698216/1087/en/SHAREHOLDER-ALERT-Pomerantz-Law-Firm-Investigates-Claims-On-Behalf-of-Investors-of-EPAM-Systems-Inc-EPAM.html"
    },
    {
        "id": 62390589,
        "published_at": "2023-07-02T04:06:00Z",
        "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Investigates Claims On Behalf of Investors of Expensify, Inc. - EXFY",
        "file_name": "2023-07-02_62390589.txt",
        "full_text": "NEW YORK, July 02, 2023 (GLOBE NEWSWIRE) -- Pomerantz LLP is investigating claims on behalf of investors of Expensify, Inc. (Expensify or the Company) (NASDAQ: EXFY).   Such investors are advised to contact Robert S. Willoughby at  newaction@pomlaw.com\r\n or 888-476-6529, ext. 7980.\r\nThe investigation concerns whether Expensify and certain of its officers and/or directors have engaged in securities fraud or other unlawful business practices. \r\n[Click here for information about joining the class action]\r\nOn or around November 11, 2021, Expensify conducted its initial public offering (IPO), selling 2.6 million shares priced at $27.00 per share.  Then, on June 12, 2023, Morgan Stanley downgraded Expensify to Underweight from Equal-weight, citing structural headwinds and the Companys risk-reward profile. \r\nOn this news, Expensifys stock price fell $0.45 per share, or 6.28%, to close at $6.72 per share on June 12, 2023.\r\nPomerantz LLP, with offices in New York, Chicago, Los Angeles, London, Paris, and Tel Aviv, is acknowledged as one of the premier firms in the areas of corporate, securities, and antitrust class litigation. Founded by the late Abraham L. Pomerantz, known as the dean of the class action bar, Pomerantz pioneered the field of securities class actions. Today, more than 85 years later, Pomerantz continues in the tradition he established, fighting for the rights of the victims of securities fraud, breaches of fiduciary duty, and corporate misconduct. The Firm has recovered numerous multimillion-dollar damages awards on behalf of class members. See www.pomlaw.com\r\n.\r\nCONTACT:Robert S. WilloughbyPomerantz LLPrswilloughby@pomlaw.com\r\n888-476-6529 ext. 7980",
        "sentiment_score": -0.7964,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Business Model Resilience",
        "company_name": "Expensify Inc",
        "company_id": 243141,
        "url": "https://www.globenewswire.com/news-release/2023/07/02/2698215/1087/en/SHAREHOLDER-ALERT-Pomerantz-Law-Firm-Investigates-Claims-On-Behalf-of-Investors-of-Expensify-Inc-EXFY.html"
    },
    {
        "id": 62390616,
        "published_at": "2023-07-02T03:53:00Z",
        "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Investigates Claims On Behalf of Investors of Mersana Therapeutics, Inc. - MRSN",
        "file_name": "2023-07-02_62390616.txt",
        "full_text": "NEW YORK, July 01, 2023 (GLOBE NEWSWIRE) -- Pomerantz LLP is investigating claims on behalf of investors of Mersana Therapeutics, Inc. (Mersana or the Company) (NASDAQ: MRSN).   Such investors are advised to contact Robert S. Willoughby at  newaction@pomlaw.com\r\n or 888-476-6529, ext. 7980.\r\nThe investigation concerns whether Mersana and certain of its officers and/or directors have engaged in securities fraud or other unlawful business practices. \r\n[Click here for information about joining the class action]\r\nOn June 15, 2023, Mersana issued a press release announc[ing] that the U.S. Food and Drug Administration (FDA) has issued a partial clinical hold pausing new patient enrollment in UP-NEXT and UPGRADE-A, the companys ongoing clinical trials of UpRi in platinum-sensitive ovarian cancer.  UPLIFT, Mersanas ongoing clinical trial of UpRi in platinum-resistant ovarian cancer, completed enrollment in October 2022.  Mersana stated that [t]he partial clinical hold follows a submission by Mersana of a recent aggregate safety report of all patients dosed with UpRi (approximately 560 patients) evaluating bleeding events and that Mersanas recent assessment determined that serious bleeding events appear to occur at a higher rate than background.  While most bleeding cases in this aggregate safety analysis were low-grade, five (&lt;1%) Grade 5 (fatal) bleeding events were observed among the approximately 560 patients dosed to date.  The causes of bleeding events remain under investigation. \r\nOn this news, Mersanas stock price fell $5.66 per share, or 59.27%, to close at $3.89 per share on June 15, 2023.\r\nPomerantz LLP, with offices in New York, Chicago, Los Angeles, London, Paris, and Tel Aviv, is acknowledged as one of the premier firms in the areas of corporate, securities, and antitrust class litigation. Founded by the late Abraham L. Pomerantz, known as the dean of the class action bar, Pomerantz pioneered the field of securities class actions. Today, more than 85 years later, Pomerantz continues in the tradition he established, fighting for the rights of the victims of securities fraud, breaches of fiduciary duty, and corporate misconduct. The Firm has recovered numerous multimillion-dollar damages awards on behalf of class members. See www.pomlaw.com\r\n.\r\nCONTACT:Robert S. WilloughbyPomerantz LLPrswilloughby@pomlaw.com\r\n888-476-6529 ext. 7980",
        "sentiment_score": -0.7964,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Business Model Resilience",
        "company_name": "Mersana Therapeutics, Inc",
        "company_id": 204596,
        "url": "https://www.globenewswire.com/news-release/2023/07/02/2698213/1087/en/SHAREHOLDER-ALERT-Pomerantz-Law-Firm-Investigates-Claims-On-Behalf-of-Investors-of-Mersana-Therapeutics-Inc-MRSN.html"
    },
    {
        "id": 62390319,
        "published_at": "2023-07-02T03:50:03Z",
        "title": "Fired Wells Fargo Director Claims Racial Bias in Finance Group",
        "file_name": "2023-07-02_62390319.txt",
        "full_text": "A former director in Wells Fargo &amp; Co.s subscription finance group sued the bank alleging he faced racial bias in personal dealings, client allocation, performance reviews, his bonus and, finally, his firing.None Dizzying Bond Moves Put 4% Yield in Play to Win Over InvestorsNone China Has $3 Trillion of Hidden Currency Reserves, Setser SaysNone Taylor Swift Is\r\n#wellsfargocos#declassifynotfound#doj#intelligenceagency#yomiakinyemi#manhattan#wellsfargo#lloydsbankinggroup\r\nThis story appeared on finance.yahoo.com, .",
        "sentiment_score": -0.7845,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Employee Engagement, Diversity & Inclusion",
        "company_name": "Wells Fargo & Company",
        "company_id": 189823,
        "url": "https://biztoc.com/x/fac9d6dfeb5d826b"
    },
    {
        "id": 62390650,
        "published_at": "2023-07-02T03:47:00Z",
        "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Reminds Shareholders with Losses on their Investment in DZS Inc. of Class Action Lawsuit and Upcoming Deadline – DZSI",
        "file_name": "2023-07-02_62390650.txt",
        "full_text": "NEW YORK, July 01, 2023 (GLOBE NEWSWIRE) -- Pomerantz LLP announces that a class action lawsuit has been filed against DZS Inc. (DZS or the Company) (NASDAQ: DZSI), and certain officers.   The class action, filed in the United States District Court for the Eastern District of Texas, Sherman Division, and docketed under 23-cv-00603, is on behalf of a class consisting of all persons and entities other than Defendants that purchased or otherwise acquired publicly traded DZS securities between March 10, 2023 and May 31, 2023, inclusive (the Class Period).  Plaintiff seeks to recover compensable damages caused by Defendants violations of the federal securities laws under the Securities Exchange Act of 1934 (Exchange Act).\r\nIf you are a shareholder who purchased or otherwise acquired DZS securities during the Class Period, you have until August 14, 2023 to ask the Court to appoint you as Lead Plaintiff for the class.  A copy of the Complaint can be obtained at www.pomerantzlaw.com\r\n.   To discuss this action, contact Robert S. Willoughby at newaction@pomlaw.com\r\n or 888.476.6529 (or 888.4-POMLAW), toll-free, Ext. 7980. Those who inquire by e-mail are encouraged to include their mailing address, telephone number, and the number of shares purchased. \r\n           [Click here for information about joining the class action]\r\nDZS purports to be a global provider of access and optical networking infrastructure and cloud software solutions that enable the emerging hyper-connected, hyper-broadband world and broadband experiences.  The Company provides a wide array of reliable, cost-effective networking technologies and software to a diverse customer base.\r\nThe complaint alleges that throughout the Class Period, Defendants made materially false and/or misleading statements, as well as failed to disclose material adverse facts about the Companys business, operations, and prospects.  Specifically, Defendants made false and/or misleading statements and/or failed to disclose that: (i) DZS financial statements from March 31, 2023 to the present included certain errors; (ii) as a result, DZS would need to restate its previously filed quarterly financial statement for the period ending March 31, 2023; (iii) the Company had ongoing undisclosed issues with its internal controls over financial reporting; and (iv) as a result, Defendants statements about the Companys business, operations, and prospects were materially false and misleading and/or lacked a reasonable basis at all relevant times.\r\nOn June 1, 2023, DZS announced that it would restate its financial results for the Companys first fiscal quarter ended March 31, 2023, noting that it improperly recognized approximately $15 million of revenue during the quarter.  DZS further disclosed that [t]he restatement relates to timing of revenue recognition with respect to two customer projects and [t]he most significant of the two revenue restatements is with a long standing, highly valued customer.  Moreover, the Company withdrew its previously issued guidance for its second quarter of 2023. \r\nOn this news, DZSs stock price plummeted by $2.17 per share, or 36%, to close at $3.82 on June 1, 2023, on extremely high trading volume.  The next day, DZSs stock price declined another $0.36 per share, or 9.42%, to close at $3.46 per share on June 2, 2023.\r\nPomerantz LLP, with offices in New York, Chicago, Los Angeles, London, Paris, and Tel Aviv, is acknowledged as one of the premier firms in the areas of corporate, securities, and antitrust class litigation. Founded by the late Abraham L. Pomerantz, known as the dean of the class action bar, Pomerantz pioneered the field of securities class actions. Today, more than 85 years later, Pomerantz continues in the tradition he established, fighting for the rights of the victims of securities fraud, breaches of fiduciary duty, and corporate misconduct. The Firm has recovered billions of dollars in damages awards on behalf of class members. See www.pomlaw.com\r\n.\r\nCONTACT: Robert S. Willoughby Pomerantz LLP rswilloughby@pomlaw.com\r\n888-476-6529 ext. 7980",
        "sentiment_score": -0.9831,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Selling Practices & Product Labeling",
        "company_name": "DZS Inc",
        "company_id": 246014,
        "url": "https://www.globenewswire.com/news-release/2023/07/02/2698212/1087/en/SHAREHOLDER-ALERT-Pomerantz-Law-Firm-Reminds-Shareholders-with-Losses-on-their-Investment-in-DZS-Inc-of-Class-Action-Lawsuit-and-Upcoming-Deadline-DZSI.html"
    },
    {
        "id": 62390587,
        "published_at": "2023-07-02T03:37:00Z",
        "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Investigates Claims On Behalf of Investors of Arcellx, Inc. - ACLX",
        "file_name": "2023-07-02_62390587.txt",
        "full_text": "NEW YORK, July 01, 2023 (GLOBE NEWSWIRE) -- Pomerantz LLP is investigating claims on behalf of investors of Arcellx, Inc. (Arcellx or the Company) (NASDAQ: ACLX).   Such investors are advised to contact Robert S. Willoughby at  newaction@pomlaw.com\r\n or 888-476-6529, ext. 7980.\r\nThe investigation concerns whether Arcellx and certain of its officers and/or directors have engaged in securities fraud or other unlawful business practices. \r\n[Click here for information about joining the class action]\r\nOn June 19, 2023, Arcellx issued a press release announc[ing] . . . that it has received notification from the U.S. Food and Drug Administration (FDA) that a clinical hold has been placed on its CART-ddBCMA investigational new drug (IND) for the treatment of patients with relapsed or refractory multiple myeloma (rrMM).  Arcellx specified that [t]he clinical hold was received on June 16, following a recent patient death.  The company believes limitations on bridging therapy are a contributing factor and is working with FDA to amend the protocol to expand options for patients that are consistent with current clinical practice.  The FDA has provided clearance to Arcellx to continue to dose patients who have undergone lymphodepletion. \r\nOn this news, Arcellxs stock price fell $2.57 per share, or 7.18%, to close at $33.23 per share on June 20, 2023.\r\nPomerantz LLP, with offices in New York, Chicago, Los Angeles, London, Paris, and Tel Aviv, is acknowledged as one of the premier firms in the areas of corporate, securities, and antitrust class litigation. Founded by the late Abraham L. Pomerantz, known as the dean of the class action bar, Pomerantz pioneered the field of securities class actions. Today, more than 85 years later, Pomerantz continues in the tradition he established, fighting for the rights of the victims of securities fraud, breaches of fiduciary duty, and corporate misconduct. The Firm has recovered billions of dollars in damages awards on behalf of class members. See www.pomlaw.com\r\n.\r\nCONTACT: Robert S. Willoughby Pomerantz LLP rswilloughby@pomlaw.com\r\n 888-476-6529 ext. 7980",
        "sentiment_score": -0.7964,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Business Model Resilience",
        "company_name": "Arcellx Inc",
        "company_id": 244691,
        "url": "https://www.globenewswire.com/news-release/2023/07/02/2698211/1087/en/SHAREHOLDER-ALERT-Pomerantz-Law-Firm-Investigates-Claims-On-Behalf-of-Investors-of-Arcellx-Inc-ACLX.html"
    },
    {
        "id": 62390615,
        "published_at": "2023-07-02T02:28:00Z",
        "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Investigates Claims On Behalf of Investors of Aldeyra Therapeutics, Inc. - ALDX",
        "file_name": "2023-07-02_62390615.txt",
        "full_text": "NEW YORK, July 01, 2023 (GLOBE NEWSWIRE) -- Pomerantz LLP is investigating claims on behalf of investors of Aldeyra Therapeutics, Inc. (Aldeyra or the Company) (NASDAQ: ALDX).   Such investors are advised to contact Robert S. Willoughby at  newaction@pomlaw.com\r\n or 888-476-6529, ext. 7980.\r\nThe investigation concerns whether Aldeyra and certain of its officers and/or directors have engaged in securities fraud or other unlawful business practices. \r\n[Click here for information about joining the class action]\r\nOn June 21, 2023, Aldeyra issued a press release announc[ing] receipt of a Complete Response Letter from the U.S. Food and Drug Administration (FDA) for the 505(b)(2) New Drug Application (NDA) of ADX-2191 (methotrexate for injection, USP), an investigational drug candidate, for the treatment of primary vitreoretinal lymphoma (PVRL).  The press release stated that [a]lthough no safety or manufacturing issues with ADX-2191 were identified, the FDA stated that there was a lack of substantial evidence of effectiveness due to a lack of adequate and well-controlled investigations in the literature-based NDA submission.  On this news, Aldeyras stock price fell sharply during intraday trading on June 21, 2023.\r\nPomerantz LLP, with offices in New York, Chicago, Los Angeles, London, Paris, and Tel Aviv, is acknowledged as one of the premier firms in the areas of corporate, securities, and antitrust class litigation. Founded by the late Abraham L. Pomerantz, known as the dean of the class action bar, Pomerantz pioneered the field of securities class actions. Today, more than 85 years later, Pomerantz continues in the tradition he established, fighting for the rights of the victims of securities fraud, breaches of fiduciary duty, and corporate misconduct. The Firm has recovered billions of dollars in damages awards on behalf of class members. See www.pomlaw.com\r\n.\r\nCONTACT: Robert S. Willoughby Pomerantz LLP rswilloughby@pomlaw.com\r\n 888-476-6529 ext. 7980",
        "sentiment_score": -0.7964,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Business Model Resilience",
        "company_name": "Aldeyra Therapeutics, Inc",
        "company_id": 207440,
        "url": "https://www.globenewswire.com/news-release/2023/07/02/2698210/1087/en/SHAREHOLDER-ALERT-Pomerantz-Law-Firm-Investigates-Claims-On-Behalf-of-Investors-of-Aldeyra-Therapeutics-Inc-ALDX.html"
    },
    {
        "id": 62390596,
        "published_at": "2023-07-02T02:13:00Z",
        "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Investigates Claims On Behalf of Investors of NovoCure Limited - NVCR",
        "file_name": "2023-07-02_62390596.txt",
        "full_text": "NEW YORK, July 01, 2023 (GLOBE NEWSWIRE) -- Pomerantz LLP is investigating claims on behalf of investors of NovoCure Limited (NovoCure or the Company) (NASDAQ: NVCR).   Such investors are advised to contact Robert S. Willoughby at  newaction@pomlaw.com\r\n or 888-476-6529, ext. 7980.\r\nThe investigation concerns whether NovoCure and certain of its officers and/or directors have engaged in securities fraud or other unlawful business practices. \r\n[Click here for information about joining the class action]\r\nOn June 6, 2023, NovoCure issued a press release announcing positive results from the Phase 3 LUNAR clinical trial evaluating the use of its Tumor Treating Fields (TTFields) therapy together with standard therapies for the treatment of non-small cell lung cancer.  Despite reporting that patients receiving TTFields combined with standard therapies achieved median overall survival (OS) of 13.2 months, compared to 9.9 months for patients treated only with standard therapies, analysts noted that the therapy was tested in patients who worsened following chemotherapy, which is no longer the standard of care in lung cancer, and that most patients first receive immune checkpoint inhibitors (ICIs).  Although the Company stated that there was a profound OS benefit with a subgroup of patients who received ICIs, only a few patients (66) were treated with ICIs. \r\nOn this news, NovoCures ordinary share price fell $35.51 per share, or 43.04%, to close at $47.00 per share on June 6, 2023.\r\nPomerantz LLP, with offices in New York, Chicago, Los Angeles, London, Paris, and Tel Aviv, is acknowledged as one of the premier firms in the areas of corporate, securities, and antitrust class litigation. Founded by the late Abraham L. Pomerantz, known as the dean of the class action bar, Pomerantz pioneered the field of securities class actions. Today, more than 85 years later, Pomerantz continues in the tradition he established, fighting for the rights of the victims of securities fraud, breaches of fiduciary duty, and corporate misconduct. The Firm has recovered numerous multimillion-dollar damages awards on behalf of class members. See www.pomlaw.com\r\n.\r\nCONTACT:Robert S. WilloughbyPomerantz LLPrswilloughby@pomlaw.com\r\n888-476-6529 ext. 7980",
        "sentiment_score": -0.7964,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Business Model Resilience",
        "company_name": "NovoCure Limited",
        "company_id": 210582,
        "url": "https://www.globenewswire.com/news-release/2023/07/02/2698208/1087/en/SHAREHOLDER-ALERT-Pomerantz-Law-Firm-Investigates-Claims-On-Behalf-of-Investors-of-NovoCure-Limited-NVCR.html"
    },
    {
        "id": 62390581,
        "published_at": "2023-07-02T01:51:00Z",
        "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Investigates Claims On Behalf of Investors of Funko, Inc. - FNKO",
        "file_name": "2023-07-02_62390581.txt",
        "full_text": "NEW YORK, July 01, 2023 (GLOBE NEWSWIRE) -- Pomerantz LLP is investigating claims on behalf of investors of Funko, Inc. (Funko or the Company) (NASDAQ: FNKO).   Such investors are advised to contact Robert S. Willoughby at  newaction@pomlaw.com\r\n or 888-476-6529, ext. 7980.\r\nThe investigation concerns whether Funko and certain of its officers and/or directors have engaged in securities fraud or other unlawful business practices. \r\n[Click here for information about joining the class action]\r\nThroughout 2022 and 2023, Funko promoted both the planned move of its distribution center from Everett, Washington to Buckeye, Arizona, as well as the planned upgrade of the Companys enterprise resource planning (ERP) software system. On November 3, 2022, Funko announced its third quarter 2022 results, including earnings per diluted share of $0.28, more than 42% below Street estimates of $0.49 per share.  In addition, Funko reported that its gross margin in the third quarter of 2022 decreased 100 basis points from the third quarter of 2021, and that selling, general, and administrative (SG&amp;A) expenses increased 63.5% due to increased infrastructure investment to accommodate recent rapid growth and provide capacity for sustained future growth.  Funko also dramatically lowered its full year (FY) 2022 guidance ranges for adjusted net income and earnings per diluted share, while cutting its projected FY 2022 Adjusted EBITDA margin to high single digits, from prior estimates of 14.6%. On an earnings call to discuss the results, Company management disclosed that Funkos Buckeye, Arizona distribution center had opened without the benefit of the warehouse management software it was designed to operate with as a result of a delayed ERP software system, resulting in higher than expected short-term operating expenses and increased margin pressure. In response to an analyst question regarding how the ERP implementation delays caught Funko by surprise, Company management responded that Funko had decided to launch the new warehouse without the benefit of a fully functioning or implemented ERP system. \r\nOn this news, Funkos stock price fell $11.58 per share, or 59.4%, to close at $7.92 per share on November 4, 2022. \r\nThen, on March 1, 2023, Funko announced its FY 2022 results and guidance for FY 2023, reporting, among other results, net income for FY 2022 that had decreased to a $5.2 million loss and Adjusted Earnings per Diluted Share that came in well below prior estimates.  Funko also disclosed that [g]ross margin in the fourth quarter of 2022 decreased . . . driven primarily by storage and container rental charges associated with inventory in excess of warehouse capacity and that SG&amp;A expenses increased 78%, including a $32.5 million write down of capitalized costs associated with the decision not to implement [the] previously disclosed [ERP] system[.]  \r\nOn this news, in after-hours trading on March 1, 2023, Funkos stock price fell $3.17 per share from closing at $10.70 per share to $7.53 per share or a 29.6% drop. Funkos stock recovered somewhat during intra-day trading, but still closed down at $9.94 per share on heavy trading volume.\r\nPomerantz LLP, with offices in New York, Chicago, Los Angeles, London, Paris, and Tel Aviv, is acknowledged as one of the premier firms in the areas of corporate, securities, and antitrust class litigation. Founded by the late Abraham L. Pomerantz, known as the dean of the class action bar, Pomerantz pioneered the field of securities class actions. Today, more than 85 years later, Pomerantz continues in the tradition he established, fighting for the rights of the victims of securities fraud, breaches of fiduciary duty, and corporate misconduct. The Firm has recovered numerous multimillion-dollar damages awards on behalf of class members. See www.pomlaw.com\r\n.\r\nCONTACT: Robert S. WilloughbyPomerantz LLPrswilloughby@pomlaw.com\r\n888-476-6529 ext. 7980",
        "sentiment_score": -0.7964,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Business Model Resilience",
        "company_name": "Funko, Inc",
        "company_id": 205860,
        "url": "https://www.globenewswire.com/news-release/2023/07/02/2698204/1087/en/SHAREHOLDER-ALERT-Pomerantz-Law-Firm-Investigates-Claims-On-Behalf-of-Investors-of-Funko-Inc-FNKO.html"
    },
    {
        "id": 62390583,
        "published_at": "2023-07-02T01:30:00Z",
        "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Investigates Claims On Behalf of Investors of Cutera, Inc. - CUTR",
        "file_name": "2023-07-02_62390583.txt",
        "full_text": "NEW YORK, July 01, 2023 (GLOBE NEWSWIRE) -- Pomerantz LLP is investigating claims on behalf of investors of Cutera, Inc. (Cutera or the Company) (NASDAQ: CUTR).   Such investors are advised to contact Robert S. Willoughby at  newaction@pomlaw.com\r\n or 888-476-6529, ext. 7980.\r\nThe investigation concerns whether Cutera and certain of its officers and/or directors have engaged in securities fraud or other unlawful business practices. \r\n[Click here for information about joining the class action]\r\nOn January 9, 2023, Cutera reported its preliminary financial results for full-year 2022, including the fact that Cutera had failed to meet its revenue guidance for 2022.  On this news, Cuteras stock price fell $9.41 per share, or more than 23%, to close at $31.04 per share on January 9, 2023. \r\nOn February 28, 2023, Cutera filed a Notification of Late Filing with the U.S. Securities and Exchange Commission, reporting that the Company would not be able to timely file its annual financial report on Form 10-K by the March 1, 2023 deadline. The Company further disclosed that it ha[d] identified and expect[ed] to disclose in the Form 10-K material weaknesses in its internal control over financial reporting related to . . . ineffective inventory count controls.  On this news, Cuteras stock price fell $0.32 per share, or approximately 1%, to close at $32.11 per share on March 1, 2023. \r\nOn March 16, 2023, Cutera announced that it would not meet the extended deadline for filing its 2022 annual report and would endeavor to file its 2022 annual report as soon as practicable. The Company also revealed that, in addition to the material weaknesses previously identified, Cutera had identified material weaknesses related to stock-based compensation.  On this news, Cuteras stock price fell $3.49 per share, or approximately 12.5%, to close at $24.36 per share on March 17, 2023. \r\nOn March 24, 2023, Cutera disclosed that Nasdaq notified the Company that it was not in compliance with Nasdaq Listing Rule 5250(c)(1) for failing to timely file its 2022 annual financial report.  On this news, Cuteras stock price fell $0.92 per share, or approximately 3.4%, to close at $26.15 per share on March 27, 2023.\r\nOn April 12, 2023, the Company revealed that it had terminated J. Daniel Plants as the Companys Executive Chairman and Chairman of the Board and David H. Mowry as the Companys Chief Executive Officer, appointing current Board members Janet D. Widmann and Sheila A. Hopkins as Independent Chair of the Board and Interim Chief Executive Officer, respectively. In connection with this announcement, the Company also formally withdrew its full-year 2023 financial guidance.  On this news, Cuteras stock price fell $7.63 per share, or more than 28%, to close at $19.44 per share on April 12, 2023. \r\nFinally, on May 9, 2023, the Company reported disappointing financial results for the first quarter 2023 that were below expectations due to execution challenges in the business and announced that Rohan Seth had resigned as the Companys Chief Financial Officer.  On this news, Cuteras stock price fell $6.06 per share, or 30%, over the following two trading sessions, to close at $14.14 per share on May 11, 2023.\r\nPomerantz LLP, with offices in New York, Chicago, Los Angeles, Paris, and Tel Aviv, is acknowledged as one of the premier firms in the areas of corporate, securities, and antitrust class litigation. Founded by the late Abraham L. Pomerantz, known as the dean of the class action bar, Pomerantz pioneered the field of securities class actions. Today, more than 85 years later, Pomerantz continues in the tradition he established, fighting for the rights of the victims of securities fraud, breaches of fiduciary duty, and corporate misconduct. The Firm has recovered numerous multimillion-dollar damages awards on behalf of class members. See www.pomlaw.com\r\n.\r\nCONTACT: Robert S. Willoughby Pomerantz LLP rswilloughby@pomlaw.com\r\n 888-476-6529 ext. 7980",
        "sentiment_score": -0.4588,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Management of the Legal & Regulatory Environment",
        "company_name": "Nasdaq, Inc",
        "company_id": 190443,
        "url": "https://www.globenewswire.com/news-release/2023/07/02/2698202/1087/en/SHAREHOLDER-ALERT-Pomerantz-Law-Firm-Investigates-Claims-On-Behalf-of-Investors-of-Cutera-Inc-CUTR.html"
    },
    {
        "id": 62390582,
        "published_at": "2023-07-02T01:30:00Z",
        "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Investigates Claims On Behalf of Investors of Cutera, Inc. - CUTR",
        "file_name": "2023-07-02_62390582.txt",
        "full_text": "NEW YORK, July 01, 2023 (GLOBE NEWSWIRE) -- Pomerantz LLP is investigating claims on behalf of investors of Cutera, Inc. (Cutera or the Company) (NASDAQ: CUTR).   Such investors are advised to contact Robert S. Willoughby at  newaction@pomlaw.com\r\n or 888-476-6529, ext. 7980.\r\nThe investigation concerns whether Cutera and certain of its officers and/or directors have engaged in securities fraud or other unlawful business practices. \r\n[Click here for information about joining the class action]\r\nOn January 9, 2023, Cutera reported its preliminary financial results for full-year 2022, including the fact that Cutera had failed to meet its revenue guidance for 2022.  On this news, Cuteras stock price fell $9.41 per share, or more than 23%, to close at $31.04 per share on January 9, 2023. \r\nOn February 28, 2023, Cutera filed a Notification of Late Filing with the U.S. Securities and Exchange Commission, reporting that the Company would not be able to timely file its annual financial report on Form 10-K by the March 1, 2023 deadline. The Company further disclosed that it ha[d] identified and expect[ed] to disclose in the Form 10-K material weaknesses in its internal control over financial reporting related to . . . ineffective inventory count controls.  On this news, Cuteras stock price fell $0.32 per share, or approximately 1%, to close at $32.11 per share on March 1, 2023. \r\nOn March 16, 2023, Cutera announced that it would not meet the extended deadline for filing its 2022 annual report and would endeavor to file its 2022 annual report as soon as practicable. The Company also revealed that, in addition to the material weaknesses previously identified, Cutera had identified material weaknesses related to stock-based compensation.  On this news, Cuteras stock price fell $3.49 per share, or approximately 12.5%, to close at $24.36 per share on March 17, 2023. \r\nOn March 24, 2023, Cutera disclosed that Nasdaq notified the Company that it was not in compliance with Nasdaq Listing Rule 5250(c)(1) for failing to timely file its 2022 annual financial report.  On this news, Cuteras stock price fell $0.92 per share, or approximately 3.4%, to close at $26.15 per share on March 27, 2023.\r\nOn April 12, 2023, the Company revealed that it had terminated J. Daniel Plants as the Companys Executive Chairman and Chairman of the Board and David H. Mowry as the Companys Chief Executive Officer, appointing current Board members Janet D. Widmann and Sheila A. Hopkins as Independent Chair of the Board and Interim Chief Executive Officer, respectively. In connection with this announcement, the Company also formally withdrew its full-year 2023 financial guidance.  On this news, Cuteras stock price fell $7.63 per share, or more than 28%, to close at $19.44 per share on April 12, 2023. \r\nFinally, on May 9, 2023, the Company reported disappointing financial results for the first quarter 2023 that were below expectations due to execution challenges in the business and announced that Rohan Seth had resigned as the Companys Chief Financial Officer.  On this news, Cuteras stock price fell $6.06 per share, or 30%, over the following two trading sessions, to close at $14.14 per share on May 11, 2023.\r\nPomerantz LLP, with offices in New York, Chicago, Los Angeles, Paris, and Tel Aviv, is acknowledged as one of the premier firms in the areas of corporate, securities, and antitrust class litigation. Founded by the late Abraham L. Pomerantz, known as the dean of the class action bar, Pomerantz pioneered the field of securities class actions. Today, more than 85 years later, Pomerantz continues in the tradition he established, fighting for the rights of the victims of securities fraud, breaches of fiduciary duty, and corporate misconduct. The Firm has recovered numerous multimillion-dollar damages awards on behalf of class members. See www.pomlaw.com\r\n.\r\nCONTACT: Robert S. Willoughby Pomerantz LLP rswilloughby@pomlaw.com\r\n 888-476-6529 ext. 7980",
        "sentiment_score": -0.6275999999999999,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Management of the Legal & Regulatory Environment || Business Model Resilience",
        "company_name": "Cutera, Inc",
        "company_id": 205395,
        "url": "https://www.globenewswire.com/news-release/2023/07/02/2698202/1087/en/SHAREHOLDER-ALERT-Pomerantz-Law-Firm-Investigates-Claims-On-Behalf-of-Investors-of-Cutera-Inc-CUTR.html"
    },
    {
        "id": 62390317,
        "published_at": "2023-07-02T00:46:11Z",
        "title": "$541,000,000,000 Will Exit US Banking System in ‘Severely Adverse’ Scenario, Warns Federal Reserve",
        "file_name": "2023-07-02_62390317.txt",
        "full_text": "The Federal Reserve says more than half a trillion dollars will exit the American banking system in its severely adverse scenario.The Fed just released its annual bank stress test, which found large US banks would survive a severe recession.However, the results of the stress test show a group of 23 banking giants including JPMorgan Chase, Bank of America and Wells Fargo\r\n#federalreserve#jpmorganchase#bankofamerica#wellsfargo\r\nThis story appeared on dailyhodl.com, .",
        "sentiment_score": -0.25,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Systemic Risk Management",
        "company_name": "JPMorgan Chase & Co",
        "company_id": 190429,
        "url": "https://biztoc.com/x/622b5a1a88db4550"
    },
    {
        "id": 62390316,
        "published_at": "2023-07-02T00:46:11Z",
        "title": "$541,000,000,000 Will Exit US Banking System in ‘Severely Adverse’ Scenario, Warns Federal Reserve",
        "file_name": "2023-07-02_62390316.txt",
        "full_text": "The Federal Reserve says more than half a trillion dollars will exit the American banking system in its severely adverse scenario.The Fed just released its annual bank stress test, which found large US banks would survive a severe recession.However, the results of the stress test show a group of 23 banking giants including JPMorgan Chase, Bank of America and Wells Fargo\r\n#federalreserve#jpmorganchase#bankofamerica#wellsfargo\r\nThis story appeared on dailyhodl.com, .",
        "sentiment_score": -0.25,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Systemic Risk Management",
        "company_name": "Wells Fargo & Company",
        "company_id": 189823,
        "url": "https://biztoc.com/x/622b5a1a88db4550"
    },
    {
        "id": 62390610,
        "published_at": "2023-07-02T00:13:00Z",
        "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Investigates Claims On Behalf of Investors of The Walt Disney Company - DIS",
        "file_name": "2023-07-02_62390610.txt",
        "full_text": "NEW YORK, July 01, 2023 (GLOBE NEWSWIRE) -- Pomerantz LLP is investigating claims on behalf of investors of The Walt Disney Company (Disney or the Company) (NYSE: DIS). Such investors are advised to contact Robert S. Willoughby at  newaction@pomlaw.com\r\n or 888-476-6529, ext. 7980.\r\nThe investigation concerns whether Disney and certain of its officers and/or directors have engaged in securities fraud or other unlawful business practices. \r\n[Click here for information about joining the class action]\r\nOn September 21, 2021, Disney gave a virtual presentation at the Goldman Sachs Communacopia Conference.  During the presentation, Chief Executive Officer Robert Chapek acknowledged that Disney+ subscriber growth had slowed in the fourth quarter of the fiscal year ended October 2, 2021. \r\nOn this news, Disneys stock price fell $7.44 per share, or more than 4%, to close at $178.61 per share on September 20, 2021. \r\nOn November 10, 2021, Disney reported its financial results for its fourth quarter and fiscal year ended October 2, 2021.  Disney posted quarterly results that missed Wall Streets already diminished expectations as the Company saw a dramatic slowdown in Disney+ subscribers.  The Company added just 2.1 million customers during the quarter (the smallest quarterly gain since the services launch two years prior), revenue of $18.53 billion, and adjusted earnings per share of 37 cents all of which were below consensus estimates of 119.6 million subscribers, $18.78 billion in revenues, and adjusted earnings per share of 49 cents. \r\nOn this news, Disneys stock price fell $12.34 per share, or more than 7%, to close at $162.11 per share on November 11, 2021. \r\nFinally, on November 8, 2022, Disney issued a press release reporting the Companys financial results for its fourth quarter and fiscal year ended October 1, 2022. Disney missed analyst estimates by wide margins on both the top and bottom lines. Revenue in the quarter grew just 9% to $20.15 billion, below estimates at $21.36 billion. Sales, at $20.2 billion, fell about $1 billion short of analysts projections. Earnings, excluding certain items, fell to 30 cents share, missing the average estimate of 51 cents from analysts surveyed by Bloomberg. The Companys DTC segment, which includes streaming services Disney+, ESPN+, Hulu, and Hotstar, reported a monumental operating loss of $1.47 billion compared to a $630 million loss in the same quarter the year prior.  Revenue in the segment increased just 8% to $4.9 billion. The Company also reported a decline in its average revenue per Disney+ subscriber, as more customers subscribed through a discounted bundle with the Companys other services.  Notably, the bundled offering made up about 40% of domestic subscribers, confirming that Disney was relying on short-term promotional efforts to boost subscriber growth while impairing the platforms long-term profitability. \r\nOn this news, Disneys stock price fell $13.15 per share, or more than 13%, to close at $86.75 per share on November 9, 2022.\r\nPomerantz LLP, with offices in New York, Chicago, Los Angeles, Paris, and Tel Aviv, is acknowledged as one of the premier firms in the areas of corporate, securities, and antitrust class litigation. Founded by the late Abraham L. Pomerantz, known as the dean of the class action bar, Pomerantz pioneered the field of securities class actions. Today, more than 85 years later, Pomerantz continues in the tradition he established, fighting for the rights of the victims of securities fraud, breaches of fiduciary duty, and corporate misconduct. The Firm has recovered numerous multimillion-dollar damages awards on behalf of class members. See www.pomlaw.com\r\n.\r\nCONTACT: Robert S. WilloughbyPomerantz LLPrswilloughby@pomlaw.com\r\n888-476-6529 ext. 7980",
        "sentiment_score": -0.7964,
        "sentiment_rank": "negative",
        "tagged_sent_topics": "Business Model Resilience",
        "company_name": "The Walt Disney Company",
        "company_id": 191473,
        "url": "https://www.globenewswire.com/news-release/2023/07/02/2698199/1087/en/SHAREHOLDER-ALERT-Pomerantz-Law-Firm-Investigates-Claims-On-Behalf-of-Investors-of-The-Walt-Disney-Company-DIS.html"
    }
]